/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_ACCESS: &[u8; 3] = b"RW\0";
pub const I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_HAS_DMA_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_INTR_IO_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_VERSION_IC_COMP_VERSION_ACCESS: &[u8; 3] = b"RO\0";
pub const I2C_IC_COMP_TYPE_IC_COMP_TYPE_ACCESS: &[u8; 3] = b"RO\0";
pub const PARAM_ASSERTIONS_ENABLED_HARDWARE_I2C: u32 = 0;
pub const BSP_I2C_SDA_PIN: u32 = 6;
pub const BSP_I2C_SCL_PIN: u32 = 7;
unsafe extern "C" {
    pub fn __assert(arg1: *const cty::c_char, arg2: cty::c_int, arg3: *const cty::c_char) -> !;
}
unsafe extern "C" {
    pub fn __assert_func(
        arg1: *const cty::c_char,
        arg2: cty::c_int,
        arg3: *const cty::c_char,
        arg4: *const cty::c_char,
    ) -> !;
}
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_longlong;
pub type __uint64_t = cty::c_ulonglong;
pub type __int_least8_t = cty::c_schar;
pub type __uint_least8_t = cty::c_uchar;
pub type __int_least16_t = cty::c_short;
pub type __uint_least16_t = cty::c_ushort;
pub type __int_least32_t = cty::c_int;
pub type __uint_least32_t = cty::c_uint;
pub type __int_least64_t = cty::c_longlong;
pub type __uint_least64_t = cty::c_ulonglong;
pub type __intmax_t = cty::c_longlong;
pub type __uintmax_t = cty::c_ulonglong;
pub type __intptr_t = cty::c_int;
pub type __uintptr_t = cty::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type uint_fast8_t = cty::c_uchar;
pub type int_fast16_t = cty::c_short;
pub type uint_fast16_t = cty::c_ushort;
pub type int_fast32_t = cty::c_int;
pub type uint_fast32_t = cty::c_uint;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast64_t = cty::c_ulonglong;
pub type wchar_t = cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: cty::c_longlong,
    pub __max_align_ld: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 16usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 8usize];
    ["Offset of field: max_align_t::__max_align_ll"]
        [::core::mem::offset_of!(max_align_t, __max_align_ll) - 0usize];
    ["Offset of field: max_align_t::__max_align_ld"]
        [::core::mem::offset_of!(max_align_t, __max_align_ld) - 8usize];
};
pub type uint = cty::c_uint;
pub type absolute_time_t = u64;
unsafe extern "C" {
    #[doc = " \\brief Panics with the message \"Unsupported\"\n  \\ingroup pico_platform\n  \\see panic"]
    pub fn panic_unsupported() -> !;
}
unsafe extern "C" {
    #[doc = " \\brief Displays a panic message and halts execution\n  \\ingroup pico_platform\n\n An attempt is made to output the message to all registered STDOUT drivers\n after which this method executes a BKPT instruction.\n\n @param fmt format string (printf-like)\n @param ...  printf-like arguments"]
    pub fn panic(fmt: *const cty::c_char, ...) -> !;
}
unsafe extern "C" {
    #[doc = " \\brief Returns the RP2350 chip revision number\n  \\ingroup pico_platform\n @return the RP2350 chip revision number (1 for B0/B1, 2 for B2)"]
    pub fn rp2350_chip_version() -> u8;
}
#[doc = "< No error; the operation succeeded"]
pub const pico_error_codes_PICO_OK: pico_error_codes = 0;
#[doc = "< No error; the operation succeeded"]
pub const pico_error_codes_PICO_ERROR_NONE: pico_error_codes = 0;
#[doc = "< An unspecified error occurred"]
pub const pico_error_codes_PICO_ERROR_GENERIC: pico_error_codes = -1;
#[doc = "< The function failed due to timeout"]
pub const pico_error_codes_PICO_ERROR_TIMEOUT: pico_error_codes = -2;
#[doc = "< Attempt for example to read from an empty buffer/FIFO"]
pub const pico_error_codes_PICO_ERROR_NO_DATA: pico_error_codes = -3;
#[doc = "< Permission violation e.g. write to read-only flash partition, or security violation"]
pub const pico_error_codes_PICO_ERROR_NOT_PERMITTED: pico_error_codes = -4;
#[doc = "< Argument is outside of range of supported values`"]
pub const pico_error_codes_PICO_ERROR_INVALID_ARG: pico_error_codes = -5;
#[doc = "< An I/O error occurred"]
pub const pico_error_codes_PICO_ERROR_IO: pico_error_codes = -6;
#[doc = "< The authorization failed due to bad credentials"]
pub const pico_error_codes_PICO_ERROR_BADAUTH: pico_error_codes = -7;
#[doc = "< The connection failed"]
pub const pico_error_codes_PICO_ERROR_CONNECT_FAILED: pico_error_codes = -8;
#[doc = "< Dynamic allocation of resources failed"]
pub const pico_error_codes_PICO_ERROR_INSUFFICIENT_RESOURCES: pico_error_codes = -9;
#[doc = "< Address argument was out-of-bounds or was determined to be an address that the caller may not access"]
pub const pico_error_codes_PICO_ERROR_INVALID_ADDRESS: pico_error_codes = -10;
#[doc = "< Address was mis-aligned (usually not on word boundary)"]
pub const pico_error_codes_PICO_ERROR_BAD_ALIGNMENT: pico_error_codes = -11;
#[doc = "< Something happened or failed to happen in the past, and consequently we (currently) can't service the request"]
pub const pico_error_codes_PICO_ERROR_INVALID_STATE: pico_error_codes = -12;
#[doc = "< A user-allocated buffer was too small to hold the result or working state of this function"]
pub const pico_error_codes_PICO_ERROR_BUFFER_TOO_SMALL: pico_error_codes = -13;
#[doc = "< The call failed because another function must be called first"]
pub const pico_error_codes_PICO_ERROR_PRECONDITION_NOT_MET: pico_error_codes = -14;
#[doc = "< Cached data was determined to be inconsistent with the actual version of the data"]
pub const pico_error_codes_PICO_ERROR_MODIFIED_DATA: pico_error_codes = -15;
#[doc = "< A data structure failed to validate"]
pub const pico_error_codes_PICO_ERROR_INVALID_DATA: pico_error_codes = -16;
#[doc = "< Attempted to access something that does not exist; or, a search failed"]
pub const pico_error_codes_PICO_ERROR_NOT_FOUND: pico_error_codes = -17;
#[doc = "< Write is impossible based on previous writes; e.g. attempted to clear an OTP bit"]
pub const pico_error_codes_PICO_ERROR_UNSUPPORTED_MODIFICATION: pico_error_codes = -18;
#[doc = "< A required lock is not owned"]
pub const pico_error_codes_PICO_ERROR_LOCK_REQUIRED: pico_error_codes = -19;
#[doc = "< A version mismatch occurred (e.g. trying to run PIO version 1 code on RP2040)"]
pub const pico_error_codes_PICO_ERROR_VERSION_MISMATCH: pico_error_codes = -20;
#[doc = "< The call could not proceed because the required resources were unavailable"]
pub const pico_error_codes_PICO_ERROR_RESOURCE_IN_USE: pico_error_codes = -21;
#[doc = " \\brief Common return codes from pico_sdk methods that return a status\n\n All `PICO_ERROR_` values are negative so they can be returned from functions that also\n want to return a zero or positive value on success.\n\n Note these error codes may be returned via bootrom functions too.\n\n \\ingroup pico_base"]
pub type pico_error_codes = cty::c_int;
pub type __gnuc_va_list = u32;
pub type va_list = __gnuc_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stdio_driver {
    _unused: [u8; 0],
}
pub type stdio_driver_t = stdio_driver;
unsafe extern "C" {
    #[doc = " \\brief Initialize all of the present standard stdio types that are linked into the binary.\n \\ingroup pico_stdio\n\n Call this method once you have set up your clocks to enable the stdio support for UART, USB,\n semihosting, and RTT based on the presence of the respective libraries in the binary.\n\n When stdio_usb is configured, this method can be optionally made to block, waiting for a connection\n via the variables specified in \\ref stdio_usb_init (i.e. \\ref PICO_STDIO_USB_CONNECT_WAIT_TIMEOUT_MS)\n\n \\return true if at least one output was successfully initialized, false otherwise.\n \\see stdio_uart, stdio_usb, stdio_semihosting, stdio_rtt"]
    pub fn stdio_init_all() -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Deinitialize all of the present standard stdio types that are linked into the binary.\n \\ingroup pico_stdio\n\n This method currently only supports stdio_uart and stdio_semihosting\n\n \\return true if all outputs was successfully deinitialized, false otherwise.\n \\see stdio_uart, stdio_usb, stdio_semihosting, stdio_rtt"]
    pub fn stdio_deinit_all() -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Flushes any buffered output.\n \\ingroup pico_stdio"]
    pub fn stdio_flush();
}
unsafe extern "C" {
    #[doc = " \\brief Return a character from stdin if there is one available within a timeout\n \\ingroup pico_stdio\n\n \\param timeout_us the timeout in microseconds, or 0 to not wait for a character if none available.\n \\return the character from 0-255 or PICO_ERROR_TIMEOUT if timeout occurs"]
    pub fn stdio_getchar_timeout_us(timeout_us: u32) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Adds or removes a driver from the list of active drivers used for input/output\n \\ingroup pico_stdio\n\n \\note this method should always be called on an initialized driver and is not re-entrant\n \\param driver the driver\n \\param enabled true to add, false to remove"]
    pub fn stdio_set_driver_enabled(driver: *mut stdio_driver_t, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Control limiting of output to a single driver\n \\ingroup pico_stdio\n\n \\note this method should always be called on an initialized driver\n\n \\param driver if non-null then output only that driver will be used for input/output (assuming it is in the list of enabled drivers).\n               if NULL then all enabled drivers will be used"]
    pub fn stdio_filter_driver(driver: *mut stdio_driver_t);
}
unsafe extern "C" {
    #[doc = " \\brief control conversion of line feeds to carriage return on transmissions\n \\ingroup pico_stdio\n\n \\note this method should always be called on an initialized driver\n\n \\param driver the driver\n \\param translate If true, convert line feeds to carriage return on transmissions"]
    pub fn stdio_set_translate_crlf(driver: *mut stdio_driver_t, translate: bool);
}
unsafe extern "C" {
    #[doc = " \\brief putchar variant that skips any CR/LF conversion if enabled\n \\ingroup pico_stdio"]
    pub fn stdio_putchar_raw(c: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief puts variant that skips any CR/LF conversion if enabled\n \\ingroup pico_stdio"]
    pub fn stdio_puts_raw(s: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief get notified when there are input characters available\n \\ingroup pico_stdio\n\n \\param fn Callback function to be called when characters are available. Pass NULL to cancel any existing callback\n \\param param Pointer to pass to the callback"]
    pub fn stdio_set_chars_available_callback(
        fn_: ::core::option::Option<unsafe extern "C" fn(arg1: *mut cty::c_void)>,
        param: *mut cty::c_void,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Waits until a timeout to read at least one character into a buffer\n \\ingroup pico_stdio\n\n This method returns as soon as input is available, but more characters may\n be returned up to the end of the buffer.\n\n \\param buf the buffer to read into\n \\param len the length of the buffer\n \\return the number of characters read or PICO_ERROR_TIMEOUT\n \\param until the time after which to return PICO_ERROR_TIMEOUT if no characters are available"]
    pub fn stdio_get_until(
        buf: *mut cty::c_char,
        len: cty::c_int,
        until: absolute_time_t,
    ) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Prints a buffer to stdout with optional newline and carriage return insertion\n \\ingroup pico_stdio\n\n This method returns as soon as input is available, but more characters may\n be returned up to the end of the buffer.\n\n \\param s the characters to print\n \\param len the length of s\n \\param newline true if a newline should be added after the string\n \\param cr_translation true if line feed to carriage return translation should be performed\n \\return the number of characters written"]
    pub fn stdio_put_string(
        s: *const cty::c_char,
        len: cty::c_int,
        newline: bool,
        cr_translation: bool,
    ) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Alias for \\ref getchar that definitely does not go thru the implementation\n in the standard C library even when \\ref PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS == 0\n\n \\ingroup pico_stdio"]
    pub fn stdio_getchar() -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Alias for \\ref putchar that definitely does not go thru the implementation\n in the standard C library even when \\ref PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS == 0\n\n \\ingroup pico_stdio"]
    pub fn stdio_putchar(arg1: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Alias for \\ref puts that definitely does not go thru the implementation\n in the standard C library even when \\ref PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS == 0\n\n \\ingroup pico_stdio"]
    pub fn stdio_puts(s: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Alias for \\ref vprintf that definitely does not go thru the implementation\n in the standard C library even when \\ref PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS == 0\n\n \\ingroup pico_stdio"]
    pub fn stdio_vprintf(format: *const cty::c_char, va: va_list) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief Alias for \\ref printf that definitely does not go thru the implementation\n in the standard C library even when \\ref PICO_STDIO_SHORT_CIRCUIT_CLIB_FUNCS == 0\n\n \\ingroup pico_stdio"]
    pub fn stdio_printf(format: *const cty::c_char, ...) -> cty::c_int;
}
pub type io_rw_64 = u64;
pub type io_ro_64 = u64;
pub type io_wo_64 = u64;
pub type io_rw_32 = u32;
pub type io_ro_32 = u32;
pub type io_wo_32 = u32;
pub type io_rw_16 = u16;
pub type io_ro_16 = u16;
pub type io_wo_16 = u16;
pub type io_rw_8 = u8;
pub type io_ro_8 = u8;
pub type io_wo_8 = u8;
pub type ioptr = *mut u8;
pub type const_ioptr = ioptr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct accessctrl_hw_t {
    pub lock: io_rw_32,
    pub force_core_ns: io_rw_32,
    pub cfgreset: io_wo_32,
    pub gpio_nsmask: [io_rw_32; 2usize],
    pub rom: io_rw_32,
    pub xip_main: io_rw_32,
    pub sram: [io_rw_32; 10usize],
    pub dma: io_rw_32,
    pub usbctrl: io_rw_32,
    pub pio: [io_rw_32; 3usize],
    pub coresight_trace: io_rw_32,
    pub coresight_periph: io_rw_32,
    pub sysinfo: io_rw_32,
    pub resets: io_rw_32,
    pub io_bank: [io_rw_32; 2usize],
    pub pads_bank0: io_rw_32,
    pub pads_qspi: io_rw_32,
    pub busctrl: io_rw_32,
    pub adc0: io_rw_32,
    pub hstx: io_rw_32,
    pub i2c: [io_rw_32; 2usize],
    pub pwm: io_rw_32,
    pub spi: [io_rw_32; 2usize],
    pub timer: [io_rw_32; 2usize],
    pub uart: [io_rw_32; 2usize],
    pub otp: io_rw_32,
    pub tbman: io_rw_32,
    pub powman: io_rw_32,
    pub trng: io_rw_32,
    pub sha256: io_rw_32,
    pub syscfg: io_rw_32,
    pub clocks: io_rw_32,
    pub xosc: io_rw_32,
    pub rosc: io_rw_32,
    pub pll_sys: io_rw_32,
    pub pll_usb: io_rw_32,
    pub ticks: io_rw_32,
    pub watchdog: io_rw_32,
    pub rsm: io_rw_32,
    pub xip_ctrl: io_rw_32,
    pub xip_qmi: io_rw_32,
    pub xip_aux: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of accessctrl_hw_t"][::core::mem::size_of::<accessctrl_hw_t>() - 236usize];
    ["Alignment of accessctrl_hw_t"][::core::mem::align_of::<accessctrl_hw_t>() - 4usize];
    ["Offset of field: accessctrl_hw_t::lock"]
        [::core::mem::offset_of!(accessctrl_hw_t, lock) - 0usize];
    ["Offset of field: accessctrl_hw_t::force_core_ns"]
        [::core::mem::offset_of!(accessctrl_hw_t, force_core_ns) - 4usize];
    ["Offset of field: accessctrl_hw_t::cfgreset"]
        [::core::mem::offset_of!(accessctrl_hw_t, cfgreset) - 8usize];
    ["Offset of field: accessctrl_hw_t::gpio_nsmask"]
        [::core::mem::offset_of!(accessctrl_hw_t, gpio_nsmask) - 12usize];
    ["Offset of field: accessctrl_hw_t::rom"]
        [::core::mem::offset_of!(accessctrl_hw_t, rom) - 20usize];
    ["Offset of field: accessctrl_hw_t::xip_main"]
        [::core::mem::offset_of!(accessctrl_hw_t, xip_main) - 24usize];
    ["Offset of field: accessctrl_hw_t::sram"]
        [::core::mem::offset_of!(accessctrl_hw_t, sram) - 28usize];
    ["Offset of field: accessctrl_hw_t::dma"]
        [::core::mem::offset_of!(accessctrl_hw_t, dma) - 68usize];
    ["Offset of field: accessctrl_hw_t::usbctrl"]
        [::core::mem::offset_of!(accessctrl_hw_t, usbctrl) - 72usize];
    ["Offset of field: accessctrl_hw_t::pio"]
        [::core::mem::offset_of!(accessctrl_hw_t, pio) - 76usize];
    ["Offset of field: accessctrl_hw_t::coresight_trace"]
        [::core::mem::offset_of!(accessctrl_hw_t, coresight_trace) - 88usize];
    ["Offset of field: accessctrl_hw_t::coresight_periph"]
        [::core::mem::offset_of!(accessctrl_hw_t, coresight_periph) - 92usize];
    ["Offset of field: accessctrl_hw_t::sysinfo"]
        [::core::mem::offset_of!(accessctrl_hw_t, sysinfo) - 96usize];
    ["Offset of field: accessctrl_hw_t::resets"]
        [::core::mem::offset_of!(accessctrl_hw_t, resets) - 100usize];
    ["Offset of field: accessctrl_hw_t::io_bank"]
        [::core::mem::offset_of!(accessctrl_hw_t, io_bank) - 104usize];
    ["Offset of field: accessctrl_hw_t::pads_bank0"]
        [::core::mem::offset_of!(accessctrl_hw_t, pads_bank0) - 112usize];
    ["Offset of field: accessctrl_hw_t::pads_qspi"]
        [::core::mem::offset_of!(accessctrl_hw_t, pads_qspi) - 116usize];
    ["Offset of field: accessctrl_hw_t::busctrl"]
        [::core::mem::offset_of!(accessctrl_hw_t, busctrl) - 120usize];
    ["Offset of field: accessctrl_hw_t::adc0"]
        [::core::mem::offset_of!(accessctrl_hw_t, adc0) - 124usize];
    ["Offset of field: accessctrl_hw_t::hstx"]
        [::core::mem::offset_of!(accessctrl_hw_t, hstx) - 128usize];
    ["Offset of field: accessctrl_hw_t::i2c"]
        [::core::mem::offset_of!(accessctrl_hw_t, i2c) - 132usize];
    ["Offset of field: accessctrl_hw_t::pwm"]
        [::core::mem::offset_of!(accessctrl_hw_t, pwm) - 140usize];
    ["Offset of field: accessctrl_hw_t::spi"]
        [::core::mem::offset_of!(accessctrl_hw_t, spi) - 144usize];
    ["Offset of field: accessctrl_hw_t::timer"]
        [::core::mem::offset_of!(accessctrl_hw_t, timer) - 152usize];
    ["Offset of field: accessctrl_hw_t::uart"]
        [::core::mem::offset_of!(accessctrl_hw_t, uart) - 160usize];
    ["Offset of field: accessctrl_hw_t::otp"]
        [::core::mem::offset_of!(accessctrl_hw_t, otp) - 168usize];
    ["Offset of field: accessctrl_hw_t::tbman"]
        [::core::mem::offset_of!(accessctrl_hw_t, tbman) - 172usize];
    ["Offset of field: accessctrl_hw_t::powman"]
        [::core::mem::offset_of!(accessctrl_hw_t, powman) - 176usize];
    ["Offset of field: accessctrl_hw_t::trng"]
        [::core::mem::offset_of!(accessctrl_hw_t, trng) - 180usize];
    ["Offset of field: accessctrl_hw_t::sha256"]
        [::core::mem::offset_of!(accessctrl_hw_t, sha256) - 184usize];
    ["Offset of field: accessctrl_hw_t::syscfg"]
        [::core::mem::offset_of!(accessctrl_hw_t, syscfg) - 188usize];
    ["Offset of field: accessctrl_hw_t::clocks"]
        [::core::mem::offset_of!(accessctrl_hw_t, clocks) - 192usize];
    ["Offset of field: accessctrl_hw_t::xosc"]
        [::core::mem::offset_of!(accessctrl_hw_t, xosc) - 196usize];
    ["Offset of field: accessctrl_hw_t::rosc"]
        [::core::mem::offset_of!(accessctrl_hw_t, rosc) - 200usize];
    ["Offset of field: accessctrl_hw_t::pll_sys"]
        [::core::mem::offset_of!(accessctrl_hw_t, pll_sys) - 204usize];
    ["Offset of field: accessctrl_hw_t::pll_usb"]
        [::core::mem::offset_of!(accessctrl_hw_t, pll_usb) - 208usize];
    ["Offset of field: accessctrl_hw_t::ticks"]
        [::core::mem::offset_of!(accessctrl_hw_t, ticks) - 212usize];
    ["Offset of field: accessctrl_hw_t::watchdog"]
        [::core::mem::offset_of!(accessctrl_hw_t, watchdog) - 216usize];
    ["Offset of field: accessctrl_hw_t::rsm"]
        [::core::mem::offset_of!(accessctrl_hw_t, rsm) - 220usize];
    ["Offset of field: accessctrl_hw_t::xip_ctrl"]
        [::core::mem::offset_of!(accessctrl_hw_t, xip_ctrl) - 224usize];
    ["Offset of field: accessctrl_hw_t::xip_qmi"]
        [::core::mem::offset_of!(accessctrl_hw_t, xip_qmi) - 228usize];
    ["Offset of field: accessctrl_hw_t::xip_aux"]
        [::core::mem::offset_of!(accessctrl_hw_t, xip_aux) - 232usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timer_hw_t {
    pub timehw: io_wo_32,
    pub timelw: io_wo_32,
    pub timehr: io_ro_32,
    pub timelr: io_ro_32,
    pub alarm: [io_rw_32; 4usize],
    pub armed: io_rw_32,
    pub timerawh: io_ro_32,
    pub timerawl: io_ro_32,
    pub dbgpause: io_rw_32,
    pub pause: io_rw_32,
    pub locked: io_rw_32,
    pub source: io_rw_32,
    pub intr: io_rw_32,
    pub inte: io_rw_32,
    pub intf: io_rw_32,
    pub ints: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timer_hw_t"][::core::mem::size_of::<timer_hw_t>() - 76usize];
    ["Alignment of timer_hw_t"][::core::mem::align_of::<timer_hw_t>() - 4usize];
    ["Offset of field: timer_hw_t::timehw"][::core::mem::offset_of!(timer_hw_t, timehw) - 0usize];
    ["Offset of field: timer_hw_t::timelw"][::core::mem::offset_of!(timer_hw_t, timelw) - 4usize];
    ["Offset of field: timer_hw_t::timehr"][::core::mem::offset_of!(timer_hw_t, timehr) - 8usize];
    ["Offset of field: timer_hw_t::timelr"][::core::mem::offset_of!(timer_hw_t, timelr) - 12usize];
    ["Offset of field: timer_hw_t::alarm"][::core::mem::offset_of!(timer_hw_t, alarm) - 16usize];
    ["Offset of field: timer_hw_t::armed"][::core::mem::offset_of!(timer_hw_t, armed) - 32usize];
    ["Offset of field: timer_hw_t::timerawh"]
        [::core::mem::offset_of!(timer_hw_t, timerawh) - 36usize];
    ["Offset of field: timer_hw_t::timerawl"]
        [::core::mem::offset_of!(timer_hw_t, timerawl) - 40usize];
    ["Offset of field: timer_hw_t::dbgpause"]
        [::core::mem::offset_of!(timer_hw_t, dbgpause) - 44usize];
    ["Offset of field: timer_hw_t::pause"][::core::mem::offset_of!(timer_hw_t, pause) - 48usize];
    ["Offset of field: timer_hw_t::locked"][::core::mem::offset_of!(timer_hw_t, locked) - 52usize];
    ["Offset of field: timer_hw_t::source"][::core::mem::offset_of!(timer_hw_t, source) - 56usize];
    ["Offset of field: timer_hw_t::intr"][::core::mem::offset_of!(timer_hw_t, intr) - 60usize];
    ["Offset of field: timer_hw_t::inte"][::core::mem::offset_of!(timer_hw_t, inte) - 64usize];
    ["Offset of field: timer_hw_t::intf"][::core::mem::offset_of!(timer_hw_t, intf) - 68usize];
    ["Offset of field: timer_hw_t::ints"][::core::mem::offset_of!(timer_hw_t, ints) - 72usize];
};
#[doc = "< Select TIMER0's IRQ 0 output"]
pub const irq_num_rp2350_TIMER0_IRQ_0: irq_num_rp2350 = 0;
#[doc = "< Select TIMER0's IRQ 1 output"]
pub const irq_num_rp2350_TIMER0_IRQ_1: irq_num_rp2350 = 1;
#[doc = "< Select TIMER0's IRQ 2 output"]
pub const irq_num_rp2350_TIMER0_IRQ_2: irq_num_rp2350 = 2;
#[doc = "< Select TIMER0's IRQ 3 output"]
pub const irq_num_rp2350_TIMER0_IRQ_3: irq_num_rp2350 = 3;
#[doc = "< Select TIMER1's IRQ 0 output"]
pub const irq_num_rp2350_TIMER1_IRQ_0: irq_num_rp2350 = 4;
#[doc = "< Select TIMER1's IRQ 1 output"]
pub const irq_num_rp2350_TIMER1_IRQ_1: irq_num_rp2350 = 5;
#[doc = "< Select TIMER1's IRQ 2 output"]
pub const irq_num_rp2350_TIMER1_IRQ_2: irq_num_rp2350 = 6;
#[doc = "< Select TIMER1's IRQ 3 output"]
pub const irq_num_rp2350_TIMER1_IRQ_3: irq_num_rp2350 = 7;
#[doc = "< Select PWM's WRAP_0 IRQ output"]
pub const irq_num_rp2350_PWM_IRQ_WRAP_0: irq_num_rp2350 = 8;
#[doc = "< Select PWM's WRAP_1 IRQ output"]
pub const irq_num_rp2350_PWM_IRQ_WRAP_1: irq_num_rp2350 = 9;
#[doc = "< Select DMA's IRQ 0 output"]
pub const irq_num_rp2350_DMA_IRQ_0: irq_num_rp2350 = 10;
#[doc = "< Select DMA's IRQ 1 output"]
pub const irq_num_rp2350_DMA_IRQ_1: irq_num_rp2350 = 11;
#[doc = "< Select DMA's IRQ 2 output"]
pub const irq_num_rp2350_DMA_IRQ_2: irq_num_rp2350 = 12;
#[doc = "< Select DMA's IRQ 3 output"]
pub const irq_num_rp2350_DMA_IRQ_3: irq_num_rp2350 = 13;
#[doc = "< Select USBCTRL's IRQ output"]
pub const irq_num_rp2350_USBCTRL_IRQ: irq_num_rp2350 = 14;
#[doc = "< Select PIO0's IRQ 0 output"]
pub const irq_num_rp2350_PIO0_IRQ_0: irq_num_rp2350 = 15;
#[doc = "< Select PIO0's IRQ 1 output"]
pub const irq_num_rp2350_PIO0_IRQ_1: irq_num_rp2350 = 16;
#[doc = "< Select PIO1's IRQ 0 output"]
pub const irq_num_rp2350_PIO1_IRQ_0: irq_num_rp2350 = 17;
#[doc = "< Select PIO1's IRQ 1 output"]
pub const irq_num_rp2350_PIO1_IRQ_1: irq_num_rp2350 = 18;
#[doc = "< Select PIO2's IRQ 0 output"]
pub const irq_num_rp2350_PIO2_IRQ_0: irq_num_rp2350 = 19;
#[doc = "< Select PIO2's IRQ 1 output"]
pub const irq_num_rp2350_PIO2_IRQ_1: irq_num_rp2350 = 20;
#[doc = "< Select IO_BANK0's IRQ output"]
pub const irq_num_rp2350_IO_IRQ_BANK0: irq_num_rp2350 = 21;
#[doc = "< Select IO_BANK0_NS's IRQ output"]
pub const irq_num_rp2350_IO_IRQ_BANK0_NS: irq_num_rp2350 = 22;
#[doc = "< Select IO_QSPI's IRQ output"]
pub const irq_num_rp2350_IO_IRQ_QSPI: irq_num_rp2350 = 23;
#[doc = "< Select IO_QSPI_NS's IRQ output"]
pub const irq_num_rp2350_IO_IRQ_QSPI_NS: irq_num_rp2350 = 24;
#[doc = "< Select SIO's FIFO IRQ output"]
pub const irq_num_rp2350_SIO_IRQ_FIFO: irq_num_rp2350 = 25;
#[doc = "< Select SIO's BELL IRQ output"]
pub const irq_num_rp2350_SIO_IRQ_BELL: irq_num_rp2350 = 26;
#[doc = "< Select SIO_NS's FIFO IRQ output"]
pub const irq_num_rp2350_SIO_IRQ_FIFO_NS: irq_num_rp2350 = 27;
#[doc = "< Select SIO_NS's BELL IRQ output"]
pub const irq_num_rp2350_SIO_IRQ_BELL_NS: irq_num_rp2350 = 28;
#[doc = "< Select SIO's MTIMECMP IRQ output"]
pub const irq_num_rp2350_SIO_IRQ_MTIMECMP: irq_num_rp2350 = 29;
#[doc = "< Select CLOCKS's IRQ output"]
pub const irq_num_rp2350_CLOCKS_IRQ: irq_num_rp2350 = 30;
#[doc = "< Select SPI0's IRQ output"]
pub const irq_num_rp2350_SPI0_IRQ: irq_num_rp2350 = 31;
#[doc = "< Select SPI1's IRQ output"]
pub const irq_num_rp2350_SPI1_IRQ: irq_num_rp2350 = 32;
#[doc = "< Select UART0's IRQ output"]
pub const irq_num_rp2350_UART0_IRQ: irq_num_rp2350 = 33;
#[doc = "< Select UART1's IRQ output"]
pub const irq_num_rp2350_UART1_IRQ: irq_num_rp2350 = 34;
#[doc = "< Select ADC's FIFO IRQ output"]
pub const irq_num_rp2350_ADC_IRQ_FIFO: irq_num_rp2350 = 35;
#[doc = "< Select I2C0's IRQ output"]
pub const irq_num_rp2350_I2C0_IRQ: irq_num_rp2350 = 36;
#[doc = "< Select I2C1's IRQ output"]
pub const irq_num_rp2350_I2C1_IRQ: irq_num_rp2350 = 37;
#[doc = "< Select OTP's IRQ output"]
pub const irq_num_rp2350_OTP_IRQ: irq_num_rp2350 = 38;
#[doc = "< Select TRNG's IRQ output"]
pub const irq_num_rp2350_TRNG_IRQ: irq_num_rp2350 = 39;
#[doc = "< Select PROC0's CTI IRQ output"]
pub const irq_num_rp2350_PROC0_IRQ_CTI: irq_num_rp2350 = 40;
#[doc = "< Select PROC1's CTI IRQ output"]
pub const irq_num_rp2350_PROC1_IRQ_CTI: irq_num_rp2350 = 41;
#[doc = "< Select PLL_SYS's IRQ output"]
pub const irq_num_rp2350_PLL_SYS_IRQ: irq_num_rp2350 = 42;
#[doc = "< Select PLL_USB's IRQ output"]
pub const irq_num_rp2350_PLL_USB_IRQ: irq_num_rp2350 = 43;
#[doc = "< Select POWMAN's POW IRQ output"]
pub const irq_num_rp2350_POWMAN_IRQ_POW: irq_num_rp2350 = 44;
#[doc = "< Select POWMAN's TIMER IRQ output"]
pub const irq_num_rp2350_POWMAN_IRQ_TIMER: irq_num_rp2350 = 45;
#[doc = "< Select SPARE IRQ 0"]
pub const irq_num_rp2350_SPARE_IRQ_0: irq_num_rp2350 = 46;
#[doc = "< Select SPARE IRQ 1"]
pub const irq_num_rp2350_SPARE_IRQ_1: irq_num_rp2350 = 47;
#[doc = "< Select SPARE IRQ 2"]
pub const irq_num_rp2350_SPARE_IRQ_2: irq_num_rp2350 = 48;
#[doc = "< Select SPARE IRQ 3"]
pub const irq_num_rp2350_SPARE_IRQ_3: irq_num_rp2350 = 49;
#[doc = "< Select SPARE IRQ 4"]
pub const irq_num_rp2350_SPARE_IRQ_4: irq_num_rp2350 = 50;
#[doc = "< Select SPARE IRQ 5"]
pub const irq_num_rp2350_SPARE_IRQ_5: irq_num_rp2350 = 51;
pub const irq_num_rp2350_IRQ_COUNT: irq_num_rp2350 = 52;
#[doc = " \\brief Interrupt numbers on RP2350 (used as typedef \\ref irq_num_t)\n \\ingroup hardware_irq"]
pub type irq_num_rp2350 = cty::c_uint;
#[doc = " \\brief Interrupt numbers on RP2350 (used as typedef \\ref irq_num_t)\n \\ingroup hardware_irq"]
pub use self::irq_num_rp2350 as irq_num_t;
unsafe extern "C" {
    #[doc = " \\brief Return the current 64 bit timestamp value in microseconds for a given timer instance\n  \\ingroup hardware_timer\n\n Returns the full 64 bits of the hardware timer. The \\ref pico_time and other functions rely on the fact that this\n value monotonically increases from power up. As such it is expected that this value counts upwards and never wraps\n (we apologize for introducing a potential year 5851444 bug).\n\n \\param timer the timer instance\n \\return the 64 bit timestamp\n \\sa time_us_64"]
    pub fn timer_time_us_64(timer: *mut timer_hw_t) -> u64;
}
unsafe extern "C" {
    #[doc = " \\brief Return the current 64 bit timestamp value in microseconds for the default timer instance\n  \\ingroup hardware_timer\n\n Returns the full 64 bits of the hardware timer. The \\ref pico_time and other functions rely on the fact that this\n value monotonically increases from power up. As such it is expected that this value counts upwards and never wraps\n (we apologize for introducing a potential year 5851444 bug).\n\n \\return the 64 bit timestamp\n \\sa timer_time_us_64"]
    pub fn time_us_64() -> u64;
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (32 bit) number of microseconds using the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param delay_us delay amount in microseconds\n \\sa busy_wait_us_32"]
    pub fn timer_busy_wait_us_32(timer: *mut timer_hw_t, delay_us: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (32 bit) number of microseconds using the default timer instance\n  \\ingroup hardware_timer\n\n \\param delay_us delay amount in microseconds\n \\sa timer_busy_wait_us_32"]
    pub fn busy_wait_us_32(delay_us: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (64 bit) number of microseconds using the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param delay_us delay amount in microseconds\n \\sa busy_wait_us"]
    pub fn timer_busy_wait_us(timer: *mut timer_hw_t, delay_us: u64);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given (64 bit) number of microseconds using the default timer instance\n  \\ingroup hardware_timer\n\n \\param delay_us delay amount in microseconds\n \\sa timer_busy_wait_us"]
    pub fn busy_wait_us(delay_us: u64);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given number of milliseconds using the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param delay_ms delay amount in milliseconds\n \\sa busy_wait_ms"]
    pub fn timer_busy_wait_ms(timer: *mut timer_hw_t, delay_ms: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles for the given number of milliseconds using the default timer instance\n  \\ingroup hardware_timer\n\n \\param delay_ms delay amount in milliseconds\n \\sa timer_busy_wait_ms"]
    pub fn busy_wait_ms(delay_ms: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles until after the specified timestamp using the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param t Absolute time to wait until\n \\sa busy_wait_until"]
    pub fn timer_busy_wait_until(timer: *mut timer_hw_t, t: absolute_time_t);
}
unsafe extern "C" {
    #[doc = " \\brief Busy wait wasting cycles until after the specified timestamp using the default timer instance\n  \\ingroup hardware_timer\n\n \\param t Absolute time to wait until\n \\sa timer_busy_wait_until"]
    pub fn busy_wait_until(t: absolute_time_t);
}
#[doc = " Callback function type for hardware alarms\n  \\ingroup hardware_timer\n\n \\param alarm_num the hardware alarm number\n \\sa hardware_alarm_set_callback()"]
pub type hardware_alarm_callback_t = ::core::option::Option<unsafe extern "C" fn(alarm_num: uint)>;
unsafe extern "C" {
    #[doc = " \\brief cooperatively claim the use of this hardware alarm_num on the given timer instance\n  \\ingroup hardware_timer\n\n This method hard asserts if the hardware alarm is currently claimed.\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm to claim\n \\sa hardware_alarm_claim\n \\sa hardware_claim"]
    pub fn timer_hardware_alarm_claim(timer: *mut timer_hw_t, alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief cooperatively claim the use of this hardware alarm_num on the default timer instance\n  \\ingroup hardware_timer\n\n This method hard asserts if the hardware alarm is currently claimed.\n\n \\param alarm_num the hardware alarm to claim\n \\sa timer_hardware_alarm_claim\n \\sa hardware_claim"]
    pub fn hardware_alarm_claim(alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief cooperatively claim the use of a hardware alarm_num on the given timer instance\n  \\ingroup hardware_timer\n\n This method attempts to claim an unused hardware alarm\n\n \\param timer the timer instance\n \\param required if true the function will panic if none are available\n \\return alarm_num the hardware alarm claimed or -1 if required was false, and none are available\n \\sa hardware_alarm_claim_unused\n \\sa hardware_claim"]
    pub fn timer_hardware_alarm_claim_unused(timer: *mut timer_hw_t, required: bool) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief cooperatively claim the use of a hardware alarm_num on the default timer instance\n  \\ingroup hardware_timer\n\n This method attempts to claim an unused hardware alarm\n\n \\param required if true the function will panic if none are available\n \\return alarm_num the hardware alarm claimed or -1 if required was false, and none are available\n \\sa timer_hardware_alarm_claim_unused\n \\sa hardware_claim"]
    pub fn hardware_alarm_claim_unused(required: bool) -> cty::c_int;
}
unsafe extern "C" {
    #[doc = " \\brief cooperatively release the claim on use of this hardware alarm_num on the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm to unclaim\n \\sa hardware_alarm_unclaim\n \\sa hardware_claim"]
    pub fn timer_hardware_alarm_unclaim(timer: *mut timer_hw_t, alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief cooperatively release the claim on use of this hardware alarm_num on the default timer instance\n  \\ingroup hardware_timer\n\n \\param alarm_num the hardware alarm to unclaim\n \\sa timer_hardware_alarm_unclaim\n \\sa hardware_claim"]
    pub fn hardware_alarm_unclaim(alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Determine if a hardware alarm has been claimed on the given timer instance\n  \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm number\n \\return true if claimed, false otherwise\n \\sa hardware_alarm_is_claimed\n \\sa hardware_alarm_claim"]
    pub fn timer_hardware_alarm_is_claimed(timer: *mut timer_hw_t, alarm_num: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Determine if a hardware alarm has been claimed on the default timer instance\n  \\ingroup hardware_timer\n\n \\param alarm_num the hardware alarm number\n \\return true if claimed, false otherwise\n \\sa timer_hardware_alarm_is_claimed\n \\sa hardware_alarm_claim"]
    pub fn hardware_alarm_is_claimed(alarm_num: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Enable/Disable a callback for a hardware alarm for a given timer instance on this core\n  \\ingroup hardware_timer\n\n This method enables/disables the alarm IRQ for the specified hardware alarm on the\n calling core, and set the specified callback to be associated with that alarm.\n\n This callback will be used for the timeout set via hardware_alarm_set_target\n\n \\note This will install the handler on the current core if the IRQ handler isn't already set.\n Therefore the user has the opportunity to call this up from the core of their choice\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm number\n \\param callback the callback to install, or NULL to unset\n\n \\sa hardware_alarm_set_callback\n \\sa timer_hardware_alarm_set_target()"]
    pub fn timer_hardware_alarm_set_callback(
        timer: *mut timer_hw_t,
        alarm_num: uint,
        callback: hardware_alarm_callback_t,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Enable/Disable a callback for a hardware alarm on the default timer instance on this core\n  \\ingroup hardware_timer\n\n This method enables/disables the alarm IRQ for the specified hardware alarm on the\n calling core, and set the specified callback to be associated with that alarm.\n\n This callback will be used for the timeout set via hardware_alarm_set_target\n\n \\note This will install the handler on the current core if the IRQ handler isn't already set.\n Therefore the user has the opportunity to call this up from the core of their choice\n\n \\param alarm_num the hardware alarm number\n \\param callback the callback to install, or NULL to unset\n\n \\sa timer_hardware_alarm_set_callback\n \\sa hardware_alarm_set_target()"]
    pub fn hardware_alarm_set_callback(alarm_num: uint, callback: hardware_alarm_callback_t);
}
unsafe extern "C" {
    #[doc = " \\brief Set the current target for a specific hardware alarm on the given timer instance\n \\ingroup hardware_timer\n\n This will replace any existing target\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm number\n \\param t the target timestamp\n \\return true if the target was \"missed\"; i.e. it was in the past, or occurred before a future hardware timeout could be set\n \\sa hardware_alarm_set_target"]
    pub fn timer_hardware_alarm_set_target(
        timer: *mut timer_hw_t,
        alarm_num: uint,
        t: absolute_time_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Set the current target for the specified hardware alarm on the default timer instance\n \\ingroup hardware_timer\n\n This will replace any existing target\n\n \\param alarm_num the hardware alarm number\n \\param t the target timestamp\n \\return true if the target was \"missed\"; i.e. it was in the past, or occurred before a future hardware timeout could be set\n \\sa timer_hardware_alarm_set_target"]
    pub fn hardware_alarm_set_target(alarm_num: uint, t: absolute_time_t) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Cancel an existing target (if any) for a specific hardware_alarm on the given timer instance\n \\ingroup hardware_timer\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm number\n \\sa hardware_alarm_cancel"]
    pub fn timer_hardware_alarm_cancel(timer: *mut timer_hw_t, alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Cancel an existing target (if any) for the specified hardware_alarm on the default timer instance\n \\ingroup hardware_timer\n\n \\param alarm_num the hardware alarm number\n \\sa timer_hardware_alarm_cancel"]
    pub fn hardware_alarm_cancel(alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Force and IRQ for a specific hardware alarm on the given timer instance\n \\ingroup hardware_timer\n\n This method will forcibly make sure the current alarm callback (if present) for the hardware\n alarm is called from an IRQ context after this call. If an actual callback is due at the same\n time then the callback may only be called once.\n\n Calling this method does not otherwise interfere with regular callback operations.\n\n \\param timer the timer instance\n \\param alarm_num the hardware alarm number\n \\sa hardware_alarm_force_irq"]
    pub fn timer_hardware_alarm_force_irq(timer: *mut timer_hw_t, alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Force and IRQ for a specific hardware alarm on the default timer instance\n \\ingroup hardware_timer\n\n This method will forcibly make sure the current alarm callback (if present) for the hardware\n alarm is called from an IRQ context after this call. If an actual callback is due at the same\n time then the callback may only be called once.\n\n Calling this method does not otherwise interfere with regular callback operations.\n\n \\param alarm_num the hardware alarm number\n \\sa timer_hardware_alarm_force_irq"]
    pub fn hardware_alarm_force_irq(alarm_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief The timestamp representing the end of time; this is actually not the maximum possible\n timestamp, but is set to 0x7fffffff_ffffffff microseconds to avoid sign overflows with time\n arithmetic. This is almost 300,000 years, so should be sufficient.\n \\ingroup timestamp"]
    pub static at_the_end_of_time: absolute_time_t;
}
unsafe extern "C" {
    #[doc = " \\brief The timestamp representing a null timestamp\n \\ingroup timestamp"]
    pub static nil_time: absolute_time_t;
}
unsafe extern "C" {
    #[doc = " \\brief Wait until after the given timestamp to return\n \\ingroup sleep\n\n \\note  This method attempts to perform a lower power (WFE) sleep\n\n \\param target the time after which to return\n \\sa sleep_us()\n \\sa busy_wait_until()"]
    pub fn sleep_until(target: absolute_time_t);
}
unsafe extern "C" {
    #[doc = " \\brief Wait for the given number of microseconds before returning\n \\ingroup sleep\n\n \\note This method attempts to perform a lower power (WFE) sleep\n\n \\param us the number of microseconds to sleep\n \\sa busy_wait_us()"]
    pub fn sleep_us(us: u64);
}
unsafe extern "C" {
    #[doc = " \\brief Wait for the given number of milliseconds before returning\n \\ingroup sleep\n\n \\note This method attempts to perform a lower power sleep (using WFE) as much as possible.\n\n \\param ms the number of milliseconds to sleep"]
    pub fn sleep_ms(ms: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Helper method for blocking on a timeout\n \\ingroup sleep\n\n This method will return in response to an event (as per __wfe) or\n when the target time is reached, or at any point before.\n\n This method can be used to implement a lower power polling loop waiting on\n some condition signalled by an event (__sev()).\n\n This is called \\a best_effort because under certain circumstances (notably the default timer pool\n being disabled or full) the best effort is simply to return immediately without a __wfe, thus turning the calling\n code into a busy wait.\n\n Example usage:\n ```c\n bool my_function_with_timeout_us(uint64_t timeout_us) {\n     absolute_time_t timeout_time = make_timeout_time_us(timeout_us);\n     do {\n         // each time round the loop, we check to see if the condition\n         // we are waiting on has happened\n         if (my_check_done()) {\n             // do something\n             return true;\n         }\n         // will try to sleep until timeout or the next processor event\n     } while (!best_effort_wfe_or_timeout(timeout_time));\n     return false; // timed out\n }\n ```\n NOTE: This method should always be used in a loop associated with checking another \"event\" variable, since\n processor events are a shared resource and can happen for a large number of reasons.\n\n @param timeout_timestamp the timeout time\n @return true if the target time is reached, false otherwise"]
    pub fn best_effort_wfe_or_timeout(timeout_timestamp: absolute_time_t) -> bool;
}
#[doc = " \\brief The identifier for an alarm\n\n \\note this identifier is signed because <0 is used as an error condition when creating alarms\n\n \\note alarm ids may be reused, however for convenience the implementation makes an attempt to defer\n reusing as long as possible. You should certainly expect it to be hundreds of ids before one is\n reused, although in most cases it is more. Nonetheless care must still be taken when cancelling\n alarms or other functionality based on alarms when the alarm may have expired, as eventually\n the alarm id may be reused for another alarm.\n\n \\see pico_error_codes\n \\ingroup alarm"]
pub type alarm_id_t = i32;
#[doc = " \\brief User alarm callback\n \\ingroup alarm\n \\param id the alarm_id as returned when the alarm was added\n \\param user_data the user data passed when the alarm was added\n \\return <0 to reschedule the same alarm this many us from the time the alarm was previously scheduled to fire\n \\return >0 to reschedule the same alarm this many us from the time this method returns\n \\return 0 to not reschedule the alarm"]
pub type alarm_callback_t = ::core::option::Option<
    unsafe extern "C" fn(id: alarm_id_t, user_data: *mut cty::c_void) -> i64,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct alarm_pool {
    _unused: [u8; 0],
}
pub type alarm_pool_t = alarm_pool;
pub type alarm_pool_timer_t = cty::c_void;
unsafe extern "C" {
    #[doc = " \\brief Create the default alarm pool (if not already created or disabled)\n \\ingroup alarm"]
    pub fn alarm_pool_init_default();
}
unsafe extern "C" {
    pub fn runtime_init_default_alarm_pool();
}
unsafe extern "C" {
    #[doc = " \\brief The default alarm pool used when alarms are added without specifying an alarm pool,\n        and also used by the SDK to support lower power sleeps and timeouts.\n\n \\ingroup alarm\n \\sa #PICO_TIME_DEFAULT_ALARM_POOL_HARDWARE_ALARM_NUM"]
    pub fn alarm_pool_get_default() -> *mut alarm_pool_t;
}
unsafe extern "C" {
    pub fn alarm_pool_create_on_timer(
        timer: *mut alarm_pool_timer_t,
        timer_alarm_num: uint,
        max_timers: uint,
    ) -> *mut alarm_pool_t;
}
unsafe extern "C" {
    pub fn alarm_pool_timer_for_timer_num(timer_num: uint) -> *mut alarm_pool_timer_t;
}
unsafe extern "C" {
    pub fn alarm_pool_get_default_timer() -> *mut alarm_pool_timer_t;
}
unsafe extern "C" {
    pub fn alarm_pool_create_on_timer_with_unused_hardware_alarm(
        timer: *mut alarm_pool_timer_t,
        max_timers: uint,
    ) -> *mut alarm_pool_t;
}
unsafe extern "C" {
    #[doc = " \\brief Return the timer alarm used by an alarm pool\n \\ingroup alarm\n \\param pool the pool\n \\return the timer_alarm used by the pool"]
    pub fn alarm_pool_timer_alarm_num(pool: *mut alarm_pool_t) -> uint;
}
unsafe extern "C" {
    #[doc = " \\brief Return the core number the alarm pool was initialized on (and hence callbacks are called on)\n \\ingroup alarm\n \\param pool the pool\n \\return the core used by the pool"]
    pub fn alarm_pool_core_num(pool: *mut alarm_pool_t) -> uint;
}
unsafe extern "C" {
    #[doc = " \\brief Destroy the alarm pool, cancelling all alarms and freeing up the underlying timer_alarm\n \\ingroup alarm\n \\param pool the pool"]
    pub fn alarm_pool_destroy(pool: *mut alarm_pool_t);
}
unsafe extern "C" {
    #[doc = " \\brief Add an alarm callback to be called at a specific time\n \\ingroup alarm\n\n Generally the callback is called as soon as possible after the time specified from an IRQ handler\n on the core the alarm pool was created on. If the callback is in the past or happens before\n the alarm setup could be completed, then this method will optionally call the callback itself\n and then return a return code to indicate that the target time has passed.\n\n \\note It is safe to call this method from an IRQ handler (including alarm callbacks), and from either core.\n\n @param pool the alarm pool to use for scheduling the callback (this determines which timer_alarm is used, and which core calls the callback)\n @param time the timestamp when (after which) the callback should fire\n @param callback the callback function\n @param user_data user data to pass to the callback function\n @param fire_if_past if true, and the alarm time falls before or during this call before the alarm can be set,\n                     then the callback should be called during (by) this function instead\n @return >0 the alarm id for an active (at the time of return) alarm\n @return 0 if the alarm time passed before or during the call and fire_if_past was false\n @return <0 if there were no alarm slots available, or other error occurred"]
    pub fn alarm_pool_add_alarm_at(
        pool: *mut alarm_pool_t,
        time: absolute_time_t,
        callback: alarm_callback_t,
        user_data: *mut cty::c_void,
        fire_if_past: bool,
    ) -> alarm_id_t;
}
unsafe extern "C" {
    #[doc = " \\brief Add an alarm callback to be called at or after a specific time\n \\ingroup alarm\n\n The callback is called as soon as possible after the time specified from an IRQ handler\n on the core the alarm pool was created on. Unlike \\ref alarm_pool_add_alarm_at, this method\n guarantees to call the callback from that core even if the time is during this method call or in the past.\n\n \\note It is safe to call this method from an IRQ handler (including alarm callbacks), and from either core.\n\n @param pool the alarm pool to use for scheduling the callback (this determines which timer_alarm is used, and which core calls the callback)\n @param time the timestamp when (after which) the callback should fire\n @param callback the callback function\n @param user_data user data to pass to the callback function\n @return >0 the alarm id for an active (at the time of return) alarm\n @return <0 if there were no alarm slots available, or other error occurred"]
    pub fn alarm_pool_add_alarm_at_force_in_context(
        pool: *mut alarm_pool_t,
        time: absolute_time_t,
        callback: alarm_callback_t,
        user_data: *mut cty::c_void,
    ) -> alarm_id_t;
}
unsafe extern "C" {
    #[doc = " \\brief Return the time remaining before the next trigger of an alarm\n \\ingroup alarm\n\n @param pool the alarm_pool containing the alarm\n @param alarm_id the alarm\n\n @return >=0 the number of microseconds before the next trigger\n @return <0 if either the given alarm is not in progress or it has passed"]
    pub fn alarm_pool_remaining_alarm_time_us(pool: *mut alarm_pool_t, alarm_id: alarm_id_t)
    -> i64;
}
unsafe extern "C" {
    #[doc = " \\brief Return the time remaining before the next trigger of an alarm\n \\ingroup alarm\n\n @param pool the alarm_pool containing the alarm\n @param alarm_id the alarm\n\n @return >=0 the number of milliseconds before the next trigger (INT32_MAX if the number of ms is higher than can be represented0\n @return <0 if either the given alarm is not in progress or it has passed"]
    pub fn alarm_pool_remaining_alarm_time_ms(pool: *mut alarm_pool_t, alarm_id: alarm_id_t)
    -> i32;
}
unsafe extern "C" {
    #[doc = " \\brief Cancel an alarm\n \\ingroup alarm\n \\param pool the alarm_pool containing the alarm\n \\param alarm_id the alarm\n \\return true if the alarm was cancelled, false if it didn't exist\n \\sa alarm_id_t for a note on reuse of IDs"]
    pub fn alarm_pool_cancel_alarm(pool: *mut alarm_pool_t, alarm_id: alarm_id_t) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Return the time remaining before the next trigger of an alarm\n \\ingroup alarm\n\n @param alarm_id the alarm\n\n @return >=0 the number of microseconds before the next trigger\n @return <0 if either the given alarm is not in progress or it has passed"]
    pub fn remaining_alarm_time_us(alarm_id: alarm_id_t) -> i64;
}
unsafe extern "C" {
    #[doc = " \\brief Return the time remaining before the next trigger of an alarm\n \\ingroup alarm\n\n @param alarm_id the alarm\n\n @return >=0 the number of milliseconds before the next trigger (INT32_MAX if the number of ms is higher than can be represented0\n @return <0 if either the given alarm is not in progress or it has passed"]
    pub fn remaining_alarm_time_ms(alarm_id: alarm_id_t) -> i32;
}
#[doc = " \\defgroup repeating_timer repeating_timer\n \\ingroup pico_time\n \\brief Repeating Timer functions for simple scheduling of repeated execution\n\n \\note The regular \\a alarm_ functionality can be used to make repeating alarms (by return non zero from the callback),\n however these methods abstract that further (at the cost of a user structure to store the repeat delay in (which\n the alarm framework does not have space for)."]
pub type repeating_timer_t = repeating_timer;
#[doc = " \\brief Callback for a repeating timer\n \\ingroup repeating_timer\n \\param rt repeating time structure containing information about the repeating time. user_data is of primary important to the user\n \\return true to continue repeating, false to stop."]
pub type repeating_timer_callback_t =
    ::core::option::Option<unsafe extern "C" fn(rt: *mut repeating_timer_t) -> bool>;
#[doc = " \\brief Information about a repeating timer\n \\ingroup repeating_timer\n \\return"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct repeating_timer {
    pub delay_us: i64,
    pub pool: *mut alarm_pool_t,
    pub alarm_id: alarm_id_t,
    pub callback: repeating_timer_callback_t,
    pub user_data: *mut cty::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of repeating_timer"][::core::mem::size_of::<repeating_timer>() - 24usize];
    ["Alignment of repeating_timer"][::core::mem::align_of::<repeating_timer>() - 8usize];
    ["Offset of field: repeating_timer::delay_us"]
        [::core::mem::offset_of!(repeating_timer, delay_us) - 0usize];
    ["Offset of field: repeating_timer::pool"]
        [::core::mem::offset_of!(repeating_timer, pool) - 8usize];
    ["Offset of field: repeating_timer::alarm_id"]
        [::core::mem::offset_of!(repeating_timer, alarm_id) - 12usize];
    ["Offset of field: repeating_timer::callback"]
        [::core::mem::offset_of!(repeating_timer, callback) - 16usize];
    ["Offset of field: repeating_timer::user_data"]
        [::core::mem::offset_of!(repeating_timer, user_data) - 20usize];
};
unsafe extern "C" {
    #[doc = " \\brief Add a repeating timer that is called repeatedly at the specified interval in microseconds\n \\ingroup repeating_timer\n\n Generally the callback is called as soon as possible after the time specified from an IRQ handler\n on the core the alarm pool was created on. If the callback is in the past or happens before\n the alarm setup could be completed, then this method will optionally call the callback itself\n and then return a return code to indicate that the target time has passed.\n\n \\note It is safe to call this method from an IRQ handler (including alarm callbacks), and from either core.\n\n @param pool the alarm pool to use for scheduling the repeating timer (this determines which timer_alarm is used, and which core calls the callback)\n @param delay_us the repeat delay in microseconds; if >0 then this is the delay between one callback ending and the next starting; if <0 then this is the negative of the time between the starts of the callbacks. The value of 0 is treated as 1\n @param callback the repeating timer callback function\n @param user_data user data to pass to store in the repeating_timer structure for use by the callback.\n @param out the pointer to the user owned structure to store the repeating timer info in. BEWARE this storage location must outlive the repeating timer, so be careful of using stack space\n @return false if there were no alarm slots available to create the timer, true otherwise."]
    pub fn alarm_pool_add_repeating_timer_us(
        pool: *mut alarm_pool_t,
        delay_us: i64,
        callback: repeating_timer_callback_t,
        user_data: *mut cty::c_void,
        out: *mut repeating_timer_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Cancel a repeating timer\n \\ingroup repeating_timer\n \\param timer the repeating timer to cancel\n \\return true if the repeating timer was cancelled, false if it didn't exist\n \\sa alarm_id_t for a note on reuse of IDs"]
    pub fn cancel_repeating_timer(timer: *mut repeating_timer_t) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct interp_hw_t {
    pub accum: [io_rw_32; 2usize],
    pub base: [io_rw_32; 3usize],
    pub pop: [io_ro_32; 3usize],
    pub peek: [io_ro_32; 3usize],
    pub ctrl: [io_rw_32; 2usize],
    pub add_raw: [io_rw_32; 2usize],
    pub base01: io_wo_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of interp_hw_t"][::core::mem::size_of::<interp_hw_t>() - 64usize];
    ["Alignment of interp_hw_t"][::core::mem::align_of::<interp_hw_t>() - 4usize];
    ["Offset of field: interp_hw_t::accum"][::core::mem::offset_of!(interp_hw_t, accum) - 0usize];
    ["Offset of field: interp_hw_t::base"][::core::mem::offset_of!(interp_hw_t, base) - 8usize];
    ["Offset of field: interp_hw_t::pop"][::core::mem::offset_of!(interp_hw_t, pop) - 20usize];
    ["Offset of field: interp_hw_t::peek"][::core::mem::offset_of!(interp_hw_t, peek) - 32usize];
    ["Offset of field: interp_hw_t::ctrl"][::core::mem::offset_of!(interp_hw_t, ctrl) - 44usize];
    ["Offset of field: interp_hw_t::add_raw"]
        [::core::mem::offset_of!(interp_hw_t, add_raw) - 52usize];
    ["Offset of field: interp_hw_t::base01"]
        [::core::mem::offset_of!(interp_hw_t, base01) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sio_hw_t {
    pub cpuid: io_ro_32,
    pub gpio_in: io_ro_32,
    pub gpio_hi_in: io_ro_32,
    pub _pad0: u32,
    pub gpio_out: io_rw_32,
    pub gpio_hi_out: io_rw_32,
    pub gpio_set: io_wo_32,
    pub gpio_hi_set: io_wo_32,
    pub gpio_clr: io_wo_32,
    pub gpio_hi_clr: io_wo_32,
    pub gpio_togl: io_wo_32,
    pub gpio_hi_togl: io_wo_32,
    pub gpio_oe: io_rw_32,
    pub gpio_hi_oe: io_rw_32,
    pub gpio_oe_set: io_wo_32,
    pub gpio_hi_oe_set: io_wo_32,
    pub gpio_oe_clr: io_wo_32,
    pub gpio_hi_oe_clr: io_wo_32,
    pub gpio_oe_togl: io_wo_32,
    pub gpio_hi_oe_togl: io_wo_32,
    pub fifo_st: io_rw_32,
    pub fifo_wr: io_wo_32,
    pub fifo_rd: io_ro_32,
    pub spinlock_st: io_ro_32,
    pub _pad1: [u32; 8usize],
    pub interp: [interp_hw_t; 2usize],
    pub spinlock: [io_rw_32; 32usize],
    pub doorbell_out_set: io_rw_32,
    pub doorbell_out_clr: io_rw_32,
    pub doorbell_in_set: io_rw_32,
    pub doorbell_in_clr: io_rw_32,
    pub peri_nonsec: io_rw_32,
    pub _pad2: [u32; 3usize],
    pub riscv_softirq: io_rw_32,
    pub mtime_ctrl: io_rw_32,
    pub _pad3: [u32; 2usize],
    pub mtime: io_rw_32,
    pub mtimeh: io_rw_32,
    pub mtimecmp: io_rw_32,
    pub mtimecmph: io_rw_32,
    pub tmds_ctrl: io_rw_32,
    pub tmds_wdata: io_wo_32,
    pub tmds_peek_single: io_ro_32,
    pub tmds_pop_single: io_ro_32,
    pub tmds_peek_double_l0: io_ro_32,
    pub tmds_pop_double_l0: io_ro_32,
    pub tmds_peek_double_l1: io_ro_32,
    pub tmds_pop_double_l1: io_ro_32,
    pub tmds_peek_double_l2: io_ro_32,
    pub tmds_pop_double_l2: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sio_hw_t"][::core::mem::size_of::<sio_hw_t>() - 488usize];
    ["Alignment of sio_hw_t"][::core::mem::align_of::<sio_hw_t>() - 4usize];
    ["Offset of field: sio_hw_t::cpuid"][::core::mem::offset_of!(sio_hw_t, cpuid) - 0usize];
    ["Offset of field: sio_hw_t::gpio_in"][::core::mem::offset_of!(sio_hw_t, gpio_in) - 4usize];
    ["Offset of field: sio_hw_t::gpio_hi_in"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_in) - 8usize];
    ["Offset of field: sio_hw_t::_pad0"][::core::mem::offset_of!(sio_hw_t, _pad0) - 12usize];
    ["Offset of field: sio_hw_t::gpio_out"][::core::mem::offset_of!(sio_hw_t, gpio_out) - 16usize];
    ["Offset of field: sio_hw_t::gpio_hi_out"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_out) - 20usize];
    ["Offset of field: sio_hw_t::gpio_set"][::core::mem::offset_of!(sio_hw_t, gpio_set) - 24usize];
    ["Offset of field: sio_hw_t::gpio_hi_set"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_set) - 28usize];
    ["Offset of field: sio_hw_t::gpio_clr"][::core::mem::offset_of!(sio_hw_t, gpio_clr) - 32usize];
    ["Offset of field: sio_hw_t::gpio_hi_clr"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_clr) - 36usize];
    ["Offset of field: sio_hw_t::gpio_togl"]
        [::core::mem::offset_of!(sio_hw_t, gpio_togl) - 40usize];
    ["Offset of field: sio_hw_t::gpio_hi_togl"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_togl) - 44usize];
    ["Offset of field: sio_hw_t::gpio_oe"][::core::mem::offset_of!(sio_hw_t, gpio_oe) - 48usize];
    ["Offset of field: sio_hw_t::gpio_hi_oe"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_oe) - 52usize];
    ["Offset of field: sio_hw_t::gpio_oe_set"]
        [::core::mem::offset_of!(sio_hw_t, gpio_oe_set) - 56usize];
    ["Offset of field: sio_hw_t::gpio_hi_oe_set"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_oe_set) - 60usize];
    ["Offset of field: sio_hw_t::gpio_oe_clr"]
        [::core::mem::offset_of!(sio_hw_t, gpio_oe_clr) - 64usize];
    ["Offset of field: sio_hw_t::gpio_hi_oe_clr"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_oe_clr) - 68usize];
    ["Offset of field: sio_hw_t::gpio_oe_togl"]
        [::core::mem::offset_of!(sio_hw_t, gpio_oe_togl) - 72usize];
    ["Offset of field: sio_hw_t::gpio_hi_oe_togl"]
        [::core::mem::offset_of!(sio_hw_t, gpio_hi_oe_togl) - 76usize];
    ["Offset of field: sio_hw_t::fifo_st"][::core::mem::offset_of!(sio_hw_t, fifo_st) - 80usize];
    ["Offset of field: sio_hw_t::fifo_wr"][::core::mem::offset_of!(sio_hw_t, fifo_wr) - 84usize];
    ["Offset of field: sio_hw_t::fifo_rd"][::core::mem::offset_of!(sio_hw_t, fifo_rd) - 88usize];
    ["Offset of field: sio_hw_t::spinlock_st"]
        [::core::mem::offset_of!(sio_hw_t, spinlock_st) - 92usize];
    ["Offset of field: sio_hw_t::_pad1"][::core::mem::offset_of!(sio_hw_t, _pad1) - 96usize];
    ["Offset of field: sio_hw_t::interp"][::core::mem::offset_of!(sio_hw_t, interp) - 128usize];
    ["Offset of field: sio_hw_t::spinlock"][::core::mem::offset_of!(sio_hw_t, spinlock) - 256usize];
    ["Offset of field: sio_hw_t::doorbell_out_set"]
        [::core::mem::offset_of!(sio_hw_t, doorbell_out_set) - 384usize];
    ["Offset of field: sio_hw_t::doorbell_out_clr"]
        [::core::mem::offset_of!(sio_hw_t, doorbell_out_clr) - 388usize];
    ["Offset of field: sio_hw_t::doorbell_in_set"]
        [::core::mem::offset_of!(sio_hw_t, doorbell_in_set) - 392usize];
    ["Offset of field: sio_hw_t::doorbell_in_clr"]
        [::core::mem::offset_of!(sio_hw_t, doorbell_in_clr) - 396usize];
    ["Offset of field: sio_hw_t::peri_nonsec"]
        [::core::mem::offset_of!(sio_hw_t, peri_nonsec) - 400usize];
    ["Offset of field: sio_hw_t::_pad2"][::core::mem::offset_of!(sio_hw_t, _pad2) - 404usize];
    ["Offset of field: sio_hw_t::riscv_softirq"]
        [::core::mem::offset_of!(sio_hw_t, riscv_softirq) - 416usize];
    ["Offset of field: sio_hw_t::mtime_ctrl"]
        [::core::mem::offset_of!(sio_hw_t, mtime_ctrl) - 420usize];
    ["Offset of field: sio_hw_t::_pad3"][::core::mem::offset_of!(sio_hw_t, _pad3) - 424usize];
    ["Offset of field: sio_hw_t::mtime"][::core::mem::offset_of!(sio_hw_t, mtime) - 432usize];
    ["Offset of field: sio_hw_t::mtimeh"][::core::mem::offset_of!(sio_hw_t, mtimeh) - 436usize];
    ["Offset of field: sio_hw_t::mtimecmp"][::core::mem::offset_of!(sio_hw_t, mtimecmp) - 440usize];
    ["Offset of field: sio_hw_t::mtimecmph"]
        [::core::mem::offset_of!(sio_hw_t, mtimecmph) - 444usize];
    ["Offset of field: sio_hw_t::tmds_ctrl"]
        [::core::mem::offset_of!(sio_hw_t, tmds_ctrl) - 448usize];
    ["Offset of field: sio_hw_t::tmds_wdata"]
        [::core::mem::offset_of!(sio_hw_t, tmds_wdata) - 452usize];
    ["Offset of field: sio_hw_t::tmds_peek_single"]
        [::core::mem::offset_of!(sio_hw_t, tmds_peek_single) - 456usize];
    ["Offset of field: sio_hw_t::tmds_pop_single"]
        [::core::mem::offset_of!(sio_hw_t, tmds_pop_single) - 460usize];
    ["Offset of field: sio_hw_t::tmds_peek_double_l0"]
        [::core::mem::offset_of!(sio_hw_t, tmds_peek_double_l0) - 464usize];
    ["Offset of field: sio_hw_t::tmds_pop_double_l0"]
        [::core::mem::offset_of!(sio_hw_t, tmds_pop_double_l0) - 468usize];
    ["Offset of field: sio_hw_t::tmds_peek_double_l1"]
        [::core::mem::offset_of!(sio_hw_t, tmds_peek_double_l1) - 472usize];
    ["Offset of field: sio_hw_t::tmds_pop_double_l1"]
        [::core::mem::offset_of!(sio_hw_t, tmds_pop_double_l1) - 476usize];
    ["Offset of field: sio_hw_t::tmds_peek_double_l2"]
        [::core::mem::offset_of!(sio_hw_t, tmds_peek_double_l2) - 480usize];
    ["Offset of field: sio_hw_t::tmds_pop_double_l2"]
        [::core::mem::offset_of!(sio_hw_t, tmds_pop_double_l2) - 484usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pads_bank0_hw_t {
    pub voltage_select: io_rw_32,
    pub io: [io_rw_32; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pads_bank0_hw_t"][::core::mem::size_of::<pads_bank0_hw_t>() - 196usize];
    ["Alignment of pads_bank0_hw_t"][::core::mem::align_of::<pads_bank0_hw_t>() - 4usize];
    ["Offset of field: pads_bank0_hw_t::voltage_select"]
        [::core::mem::offset_of!(pads_bank0_hw_t, voltage_select) - 0usize];
    ["Offset of field: pads_bank0_hw_t::io"][::core::mem::offset_of!(pads_bank0_hw_t, io) - 4usize];
};
#[doc = "< Select HSTX as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_HSTX: gpio_function_rp2350 = 0;
#[doc = "< Select SPI as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_SPI: gpio_function_rp2350 = 1;
#[doc = "< Select UART as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_UART: gpio_function_rp2350 = 2;
#[doc = "< Select I2C as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_I2C: gpio_function_rp2350 = 3;
#[doc = "< Select PWM as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_PWM: gpio_function_rp2350 = 4;
#[doc = "< Select SIO as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_SIO: gpio_function_rp2350 = 5;
#[doc = "< Select PIO0 as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_PIO0: gpio_function_rp2350 = 6;
#[doc = "< Select PIO1 as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_PIO1: gpio_function_rp2350 = 7;
#[doc = "< Select PIO2 as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_PIO2: gpio_function_rp2350 = 8;
#[doc = "< Select GPCK as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_GPCK: gpio_function_rp2350 = 9;
#[doc = "< Select XIP CS1 as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_XIP_CS1: gpio_function_rp2350 = 9;
#[doc = "< Select CORESIGHT TRACE as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_CORESIGHT_TRACE: gpio_function_rp2350 = 9;
#[doc = "< Select USB as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_USB: gpio_function_rp2350 = 10;
#[doc = "< Select UART_AUX as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_UART_AUX: gpio_function_rp2350 = 11;
#[doc = "< Select NULL as GPIO pin function"]
pub const gpio_function_rp2350_GPIO_FUNC_NULL: gpio_function_rp2350 = 31;
#[doc = " \\brief GPIO pin function selectors on RP2350 (used as typedef \\ref gpio_function_t)\n \\ingroup hardware_gpio"]
pub type gpio_function_rp2350 = cty::c_uint;
#[doc = " \\brief GPIO pin function selectors on RP2350 (used as typedef \\ref gpio_function_t)\n \\ingroup hardware_gpio"]
pub use self::gpio_function_rp2350 as gpio_function_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_bank0_status_ctrl_hw_t {
    pub status: io_ro_32,
    pub ctrl: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_bank0_status_ctrl_hw_t"]
        [::core::mem::size_of::<io_bank0_status_ctrl_hw_t>() - 8usize];
    ["Alignment of io_bank0_status_ctrl_hw_t"]
        [::core::mem::align_of::<io_bank0_status_ctrl_hw_t>() - 4usize];
    ["Offset of field: io_bank0_status_ctrl_hw_t::status"]
        [::core::mem::offset_of!(io_bank0_status_ctrl_hw_t, status) - 0usize];
    ["Offset of field: io_bank0_status_ctrl_hw_t::ctrl"]
        [::core::mem::offset_of!(io_bank0_status_ctrl_hw_t, ctrl) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_bank0_irq_ctrl_hw_t {
    pub inte: [io_rw_32; 6usize],
    pub intf: [io_rw_32; 6usize],
    pub ints: [io_ro_32; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_bank0_irq_ctrl_hw_t"][::core::mem::size_of::<io_bank0_irq_ctrl_hw_t>() - 72usize];
    ["Alignment of io_bank0_irq_ctrl_hw_t"]
        [::core::mem::align_of::<io_bank0_irq_ctrl_hw_t>() - 4usize];
    ["Offset of field: io_bank0_irq_ctrl_hw_t::inte"]
        [::core::mem::offset_of!(io_bank0_irq_ctrl_hw_t, inte) - 0usize];
    ["Offset of field: io_bank0_irq_ctrl_hw_t::intf"]
        [::core::mem::offset_of!(io_bank0_irq_ctrl_hw_t, intf) - 24usize];
    ["Offset of field: io_bank0_irq_ctrl_hw_t::ints"]
        [::core::mem::offset_of!(io_bank0_irq_ctrl_hw_t, ints) - 48usize];
};
#[doc = " \\tag::io_bank0_hw[]"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct io_bank0_hw_t {
    pub io: [io_bank0_status_ctrl_hw_t; 48usize],
    pub _pad0: [u32; 32usize],
    pub irqsummary_proc0_secure: [io_ro_32; 2usize],
    pub irqsummary_proc0_nonsecure: [io_ro_32; 2usize],
    pub irqsummary_proc1_secure: [io_ro_32; 2usize],
    pub irqsummary_proc1_nonsecure: [io_ro_32; 2usize],
    pub irqsummary_dormant_wake_secure: [io_ro_32; 2usize],
    pub irqsummary_dormant_wake_nonsecure: [io_ro_32; 2usize],
    pub intr: [io_rw_32; 6usize],
    pub __bindgen_anon_1: io_bank0_hw_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_bank0_hw_t__bindgen_ty_1 {
    pub __bindgen_anon_1: io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1,
    pub irq_ctrl: [io_bank0_irq_ctrl_hw_t; 3usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1 {
    pub proc0_irq_ctrl: io_bank0_irq_ctrl_hw_t,
    pub proc1_irq_ctrl: io_bank0_irq_ctrl_hw_t,
    pub dormant_wake_irq_ctrl: io_bank0_irq_ctrl_hw_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1>() - 216usize];
    ["Alignment of io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1::proc0_irq_ctrl"][::core::mem::offset_of!(
        io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1,
        proc0_irq_ctrl
    ) - 0usize];
    ["Offset of field: io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1::proc1_irq_ctrl"][::core::mem::offset_of!(
        io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1,
        proc1_irq_ctrl
    ) - 72usize];
    ["Offset of field: io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1::dormant_wake_irq_ctrl"][::core::mem::offset_of!(
        io_bank0_hw_t__bindgen_ty_1__bindgen_ty_1,
        dormant_wake_irq_ctrl
    )
        - 144usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_bank0_hw_t__bindgen_ty_1"]
        [::core::mem::size_of::<io_bank0_hw_t__bindgen_ty_1>() - 216usize];
    ["Alignment of io_bank0_hw_t__bindgen_ty_1"]
        [::core::mem::align_of::<io_bank0_hw_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_bank0_hw_t__bindgen_ty_1::irq_ctrl"]
        [::core::mem::offset_of!(io_bank0_hw_t__bindgen_ty_1, irq_ctrl) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_bank0_hw_t"][::core::mem::size_of::<io_bank0_hw_t>() - 800usize];
    ["Alignment of io_bank0_hw_t"][::core::mem::align_of::<io_bank0_hw_t>() - 4usize];
    ["Offset of field: io_bank0_hw_t::io"][::core::mem::offset_of!(io_bank0_hw_t, io) - 0usize];
    ["Offset of field: io_bank0_hw_t::_pad0"]
        [::core::mem::offset_of!(io_bank0_hw_t, _pad0) - 384usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_proc0_secure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_proc0_secure) - 512usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_proc0_nonsecure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_proc0_nonsecure) - 520usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_proc1_secure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_proc1_secure) - 528usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_proc1_nonsecure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_proc1_nonsecure) - 536usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_dormant_wake_secure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_dormant_wake_secure) - 544usize];
    ["Offset of field: io_bank0_hw_t::irqsummary_dormant_wake_nonsecure"]
        [::core::mem::offset_of!(io_bank0_hw_t, irqsummary_dormant_wake_nonsecure) - 552usize];
    ["Offset of field: io_bank0_hw_t::intr"]
        [::core::mem::offset_of!(io_bank0_hw_t, intr) - 560usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m33_hw_t {
    pub itm_stim: [io_rw_32; 32usize],
    pub _pad0: [u32; 864usize],
    pub itm_ter0: io_rw_32,
    pub _pad1: [u32; 15usize],
    pub itm_tpr: io_rw_32,
    pub _pad2: [u32; 15usize],
    pub itm_tcr: io_rw_32,
    pub _pad3: [u32; 27usize],
    pub int_atready: io_ro_32,
    pub _pad4: u32,
    pub int_atvalid: io_rw_32,
    pub _pad5: u32,
    pub itm_itctrl: io_rw_32,
    pub _pad6: [u32; 46usize],
    pub itm_devarch: io_ro_32,
    pub _pad7: [u32; 3usize],
    pub itm_devtype: io_ro_32,
    pub itm_pidr4: io_ro_32,
    pub itm_pidr5: io_rw_32,
    pub itm_pidr6: io_rw_32,
    pub itm_pidr7: io_rw_32,
    pub itm_pidr0: io_ro_32,
    pub itm_pidr1: io_ro_32,
    pub itm_pidr2: io_ro_32,
    pub itm_pidr3: io_ro_32,
    pub itm_cidr: [io_ro_32; 4usize],
    pub dwt_ctrl: io_rw_32,
    pub dwt_cyccnt: io_rw_32,
    pub _pad8: u32,
    pub dwt_exccnt: io_rw_32,
    pub _pad9: u32,
    pub dwt_lsucnt: io_rw_32,
    pub dwt_foldcnt: io_rw_32,
    pub _pad10: u32,
    pub dwt_comp0: io_rw_32,
    pub _pad11: u32,
    pub dwt_function0: io_rw_32,
    pub _pad12: u32,
    pub dwt_comp1: io_rw_32,
    pub _pad13: u32,
    pub dwt_function1: io_rw_32,
    pub _pad14: u32,
    pub dwt_comp2: io_rw_32,
    pub _pad15: u32,
    pub dwt_function2: io_rw_32,
    pub _pad16: u32,
    pub dwt_comp3: io_rw_32,
    pub _pad17: u32,
    pub dwt_function3: io_rw_32,
    pub _pad18: [u32; 984usize],
    pub dwt_devarch: io_ro_32,
    pub _pad19: [u32; 3usize],
    pub dwt_devtype: io_ro_32,
    pub dwt_pidr4: io_ro_32,
    pub dwt_pidr5: io_rw_32,
    pub dwt_pidr6: io_rw_32,
    pub dwt_pidr7: io_rw_32,
    pub dwt_pidr0: io_ro_32,
    pub dwt_pidr1: io_ro_32,
    pub dwt_pidr2: io_ro_32,
    pub dwt_pidr3: io_ro_32,
    pub dwt_cidr: [io_ro_32; 4usize],
    pub fp_ctrl: io_rw_32,
    pub fp_remap: io_ro_32,
    pub fp_comp: [io_rw_32; 8usize],
    pub _pad20: [u32; 997usize],
    pub fp_devarch: io_ro_32,
    pub _pad21: [u32; 3usize],
    pub fp_devtype: io_ro_32,
    pub fp_pidr4: io_ro_32,
    pub fp_pidr5: io_rw_32,
    pub fp_pidr6: io_rw_32,
    pub fp_pidr7: io_rw_32,
    pub fp_pidr0: io_ro_32,
    pub fp_pidr1: io_ro_32,
    pub fp_pidr2: io_ro_32,
    pub fp_pidr3: io_ro_32,
    pub fp_cidr: [io_ro_32; 4usize],
    pub _pad22: [u32; 11265usize],
    pub ictr: io_ro_32,
    pub actlr: io_rw_32,
    pub _pad23: u32,
    pub syst_csr: io_rw_32,
    pub syst_rvr: io_rw_32,
    pub syst_cvr: io_rw_32,
    pub syst_calib: io_ro_32,
    pub _pad24: [u32; 56usize],
    pub nvic_iser: [io_rw_32; 2usize],
    pub _pad25: [u32; 30usize],
    pub nvic_icer: [io_rw_32; 2usize],
    pub _pad26: [u32; 30usize],
    pub nvic_ispr: [io_rw_32; 2usize],
    pub _pad27: [u32; 30usize],
    pub nvic_icpr: [io_rw_32; 2usize],
    pub _pad28: [u32; 30usize],
    pub nvic_iabr: [io_rw_32; 2usize],
    pub _pad29: [u32; 30usize],
    pub nvic_itns: [io_rw_32; 2usize],
    pub _pad30: [u32; 30usize],
    pub nvic_ipr: [io_rw_32; 16usize],
    pub _pad31: [u32; 560usize],
    pub cpuid: io_ro_32,
    pub icsr: io_rw_32,
    pub vtor: io_rw_32,
    pub aircr: io_rw_32,
    pub scr: io_rw_32,
    pub ccr: io_rw_32,
    pub shpr: [io_rw_32; 3usize],
    pub shcsr: io_rw_32,
    pub cfsr: io_rw_32,
    pub hfsr: io_rw_32,
    pub dfsr: io_rw_32,
    pub mmfar: io_rw_32,
    pub bfar: io_rw_32,
    pub _pad32: u32,
    pub id_pfr: [io_ro_32; 2usize],
    pub id_dfr0: io_ro_32,
    pub id_afr0: io_ro_32,
    pub id_mmfr: [io_ro_32; 4usize],
    pub id_isar: [io_ro_32; 6usize],
    pub _pad33: u32,
    pub ctr: io_ro_32,
    pub _pad34: [u32; 2usize],
    pub cpacr: io_rw_32,
    pub nsacr: io_rw_32,
    pub mpu_type: io_ro_32,
    pub mpu_ctrl: io_rw_32,
    pub mpu_rnr: io_rw_32,
    pub mpu_rbar: io_rw_32,
    pub mpu_rlar: io_rw_32,
    pub mpu_rbar_a1: io_rw_32,
    pub mpu_rlar_a1: io_rw_32,
    pub mpu_rbar_a2: io_rw_32,
    pub mpu_rlar_a2: io_rw_32,
    pub mpu_rbar_a3: io_rw_32,
    pub mpu_rlar_a3: io_rw_32,
    pub _pad35: u32,
    pub mpu_mair: [io_rw_32; 2usize],
    pub _pad36: [u32; 2usize],
    pub sau_ctrl: io_rw_32,
    pub sau_type: io_ro_32,
    pub sau_rnr: io_rw_32,
    pub sau_rbar: io_rw_32,
    pub sau_rlar: io_rw_32,
    pub sfsr: io_rw_32,
    pub sfar: io_rw_32,
    pub _pad37: u32,
    pub dhcsr: io_rw_32,
    pub dcrsr: io_rw_32,
    pub dcrdr: io_rw_32,
    pub demcr: io_rw_32,
    pub _pad38: [u32; 2usize],
    pub dscsr: io_rw_32,
    pub _pad39: [u32; 61usize],
    pub stir: io_rw_32,
    pub _pad40: [u32; 12usize],
    pub fpccr: io_rw_32,
    pub fpcar: io_rw_32,
    pub fpdscr: io_rw_32,
    pub mvfr: [io_ro_32; 3usize],
    pub _pad41: [u32; 28usize],
    pub ddevarch: io_ro_32,
    pub _pad42: [u32; 3usize],
    pub ddevtype: io_ro_32,
    pub dpidr4: io_ro_32,
    pub dpidr5: io_rw_32,
    pub dpidr6: io_rw_32,
    pub dpidr7: io_rw_32,
    pub dpidr0: io_ro_32,
    pub dpidr1: io_ro_32,
    pub dpidr2: io_ro_32,
    pub dpidr3: io_ro_32,
    pub dcidr: [io_ro_32; 4usize],
    pub _pad43: [u32; 51201usize],
    pub trcprgctlr: io_rw_32,
    pub _pad44: u32,
    pub trcstatr: io_ro_32,
    pub trcconfigr: io_rw_32,
    pub _pad45: [u32; 3usize],
    pub trceventctl0r: io_rw_32,
    pub trceventctl1r: io_rw_32,
    pub _pad46: u32,
    pub trcstallctlr: io_rw_32,
    pub trctsctlr: io_rw_32,
    pub trcsyncpr: io_ro_32,
    pub trcccctlr: io_rw_32,
    pub _pad47: [u32; 17usize],
    pub trcvictlr: io_rw_32,
    pub _pad48: [u32; 47usize],
    pub trccntrldvr0: io_rw_32,
    pub _pad49: [u32; 15usize],
    pub trcidr8: io_ro_32,
    pub trcidr9: io_ro_32,
    pub trcidr10: io_ro_32,
    pub trcidr11: io_ro_32,
    pub trcidr12: io_ro_32,
    pub trcidr13: io_ro_32,
    pub _pad50: [u32; 10usize],
    pub trcimspec: io_ro_32,
    pub _pad51: [u32; 7usize],
    pub trcidr0: io_ro_32,
    pub trcidr1: io_ro_32,
    pub trcidr2: io_ro_32,
    pub trcidr3: io_ro_32,
    pub trcidr4: io_ro_32,
    pub trcidr5: io_ro_32,
    pub trcidr6: io_rw_32,
    pub trcidr7: io_rw_32,
    pub _pad52: [u32; 2usize],
    pub trcrsctlr: [io_rw_32; 2usize],
    pub _pad53: [u32; 36usize],
    pub trcsscsr: io_rw_32,
    pub _pad54: [u32; 7usize],
    pub trcsspcicr: io_rw_32,
    pub _pad55: [u32; 19usize],
    pub trcpdcr: io_rw_32,
    pub trcpdsr: io_ro_32,
    pub _pad56: [u32; 755usize],
    pub trcitatbidr: io_rw_32,
    pub _pad57: [u32; 3usize],
    pub trcitiatbinr: io_rw_32,
    pub _pad58: u32,
    pub trcitiatboutr: io_rw_32,
    pub _pad59: [u32; 40usize],
    pub trcclaimset: io_rw_32,
    pub trcclaimclr: io_rw_32,
    pub _pad60: [u32; 4usize],
    pub trcauthstatus: io_ro_32,
    pub trcdevarch: io_ro_32,
    pub _pad61: [u32; 2usize],
    pub trcdevid: io_rw_32,
    pub trcdevtype: io_ro_32,
    pub trcpidr4: io_ro_32,
    pub trcpidr5: io_rw_32,
    pub trcpidr6: io_rw_32,
    pub trcpidr7: io_rw_32,
    pub trcpidr0: io_ro_32,
    pub trcpidr1: io_ro_32,
    pub trcpidr2: io_ro_32,
    pub trcpidr3: io_ro_32,
    pub trccidr: [io_ro_32; 4usize],
    pub cticontrol: io_rw_32,
    pub _pad62: [u32; 3usize],
    pub ctiintack: io_rw_32,
    pub ctiappset: io_rw_32,
    pub ctiappclear: io_rw_32,
    pub ctiapppulse: io_rw_32,
    pub ctiinen: [io_rw_32; 8usize],
    pub _pad63: [u32; 24usize],
    pub ctiouten: [io_rw_32; 8usize],
    pub _pad64: [u32; 28usize],
    pub ctitriginstatus: io_ro_32,
    pub ctitrigoutstatus: io_ro_32,
    pub ctichinstatus: io_ro_32,
    pub _pad65: u32,
    pub ctigate: io_rw_32,
    pub asicctl: io_rw_32,
    pub _pad66: [u32; 871usize],
    pub itchout: io_rw_32,
    pub ittrigout: io_rw_32,
    pub _pad67: [u32; 2usize],
    pub itchin: io_ro_32,
    pub _pad68: [u32; 2usize],
    pub itctrl: io_rw_32,
    pub _pad69: [u32; 46usize],
    pub devarch: io_ro_32,
    pub _pad70: [u32; 2usize],
    pub devid: io_ro_32,
    pub devtype: io_ro_32,
    pub pidr4: io_ro_32,
    pub pidr5: io_rw_32,
    pub pidr6: io_rw_32,
    pub pidr7: io_rw_32,
    pub pidr0: io_ro_32,
    pub pidr1: io_ro_32,
    pub pidr2: io_ro_32,
    pub pidr3: io_ro_32,
    pub cidr: [io_ro_32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of m33_hw_t"][::core::mem::size_of::<m33_hw_t>() - 274432usize];
    ["Alignment of m33_hw_t"][::core::mem::align_of::<m33_hw_t>() - 4usize];
    ["Offset of field: m33_hw_t::itm_stim"][::core::mem::offset_of!(m33_hw_t, itm_stim) - 0usize];
    ["Offset of field: m33_hw_t::_pad0"][::core::mem::offset_of!(m33_hw_t, _pad0) - 128usize];
    ["Offset of field: m33_hw_t::itm_ter0"]
        [::core::mem::offset_of!(m33_hw_t, itm_ter0) - 3584usize];
    ["Offset of field: m33_hw_t::_pad1"][::core::mem::offset_of!(m33_hw_t, _pad1) - 3588usize];
    ["Offset of field: m33_hw_t::itm_tpr"][::core::mem::offset_of!(m33_hw_t, itm_tpr) - 3648usize];
    ["Offset of field: m33_hw_t::_pad2"][::core::mem::offset_of!(m33_hw_t, _pad2) - 3652usize];
    ["Offset of field: m33_hw_t::itm_tcr"][::core::mem::offset_of!(m33_hw_t, itm_tcr) - 3712usize];
    ["Offset of field: m33_hw_t::_pad3"][::core::mem::offset_of!(m33_hw_t, _pad3) - 3716usize];
    ["Offset of field: m33_hw_t::int_atready"]
        [::core::mem::offset_of!(m33_hw_t, int_atready) - 3824usize];
    ["Offset of field: m33_hw_t::_pad4"][::core::mem::offset_of!(m33_hw_t, _pad4) - 3828usize];
    ["Offset of field: m33_hw_t::int_atvalid"]
        [::core::mem::offset_of!(m33_hw_t, int_atvalid) - 3832usize];
    ["Offset of field: m33_hw_t::_pad5"][::core::mem::offset_of!(m33_hw_t, _pad5) - 3836usize];
    ["Offset of field: m33_hw_t::itm_itctrl"]
        [::core::mem::offset_of!(m33_hw_t, itm_itctrl) - 3840usize];
    ["Offset of field: m33_hw_t::_pad6"][::core::mem::offset_of!(m33_hw_t, _pad6) - 3844usize];
    ["Offset of field: m33_hw_t::itm_devarch"]
        [::core::mem::offset_of!(m33_hw_t, itm_devarch) - 4028usize];
    ["Offset of field: m33_hw_t::_pad7"][::core::mem::offset_of!(m33_hw_t, _pad7) - 4032usize];
    ["Offset of field: m33_hw_t::itm_devtype"]
        [::core::mem::offset_of!(m33_hw_t, itm_devtype) - 4044usize];
    ["Offset of field: m33_hw_t::itm_pidr4"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr4) - 4048usize];
    ["Offset of field: m33_hw_t::itm_pidr5"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr5) - 4052usize];
    ["Offset of field: m33_hw_t::itm_pidr6"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr6) - 4056usize];
    ["Offset of field: m33_hw_t::itm_pidr7"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr7) - 4060usize];
    ["Offset of field: m33_hw_t::itm_pidr0"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr0) - 4064usize];
    ["Offset of field: m33_hw_t::itm_pidr1"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr1) - 4068usize];
    ["Offset of field: m33_hw_t::itm_pidr2"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr2) - 4072usize];
    ["Offset of field: m33_hw_t::itm_pidr3"]
        [::core::mem::offset_of!(m33_hw_t, itm_pidr3) - 4076usize];
    ["Offset of field: m33_hw_t::itm_cidr"]
        [::core::mem::offset_of!(m33_hw_t, itm_cidr) - 4080usize];
    ["Offset of field: m33_hw_t::dwt_ctrl"]
        [::core::mem::offset_of!(m33_hw_t, dwt_ctrl) - 4096usize];
    ["Offset of field: m33_hw_t::dwt_cyccnt"]
        [::core::mem::offset_of!(m33_hw_t, dwt_cyccnt) - 4100usize];
    ["Offset of field: m33_hw_t::_pad8"][::core::mem::offset_of!(m33_hw_t, _pad8) - 4104usize];
    ["Offset of field: m33_hw_t::dwt_exccnt"]
        [::core::mem::offset_of!(m33_hw_t, dwt_exccnt) - 4108usize];
    ["Offset of field: m33_hw_t::_pad9"][::core::mem::offset_of!(m33_hw_t, _pad9) - 4112usize];
    ["Offset of field: m33_hw_t::dwt_lsucnt"]
        [::core::mem::offset_of!(m33_hw_t, dwt_lsucnt) - 4116usize];
    ["Offset of field: m33_hw_t::dwt_foldcnt"]
        [::core::mem::offset_of!(m33_hw_t, dwt_foldcnt) - 4120usize];
    ["Offset of field: m33_hw_t::_pad10"][::core::mem::offset_of!(m33_hw_t, _pad10) - 4124usize];
    ["Offset of field: m33_hw_t::dwt_comp0"]
        [::core::mem::offset_of!(m33_hw_t, dwt_comp0) - 4128usize];
    ["Offset of field: m33_hw_t::_pad11"][::core::mem::offset_of!(m33_hw_t, _pad11) - 4132usize];
    ["Offset of field: m33_hw_t::dwt_function0"]
        [::core::mem::offset_of!(m33_hw_t, dwt_function0) - 4136usize];
    ["Offset of field: m33_hw_t::_pad12"][::core::mem::offset_of!(m33_hw_t, _pad12) - 4140usize];
    ["Offset of field: m33_hw_t::dwt_comp1"]
        [::core::mem::offset_of!(m33_hw_t, dwt_comp1) - 4144usize];
    ["Offset of field: m33_hw_t::_pad13"][::core::mem::offset_of!(m33_hw_t, _pad13) - 4148usize];
    ["Offset of field: m33_hw_t::dwt_function1"]
        [::core::mem::offset_of!(m33_hw_t, dwt_function1) - 4152usize];
    ["Offset of field: m33_hw_t::_pad14"][::core::mem::offset_of!(m33_hw_t, _pad14) - 4156usize];
    ["Offset of field: m33_hw_t::dwt_comp2"]
        [::core::mem::offset_of!(m33_hw_t, dwt_comp2) - 4160usize];
    ["Offset of field: m33_hw_t::_pad15"][::core::mem::offset_of!(m33_hw_t, _pad15) - 4164usize];
    ["Offset of field: m33_hw_t::dwt_function2"]
        [::core::mem::offset_of!(m33_hw_t, dwt_function2) - 4168usize];
    ["Offset of field: m33_hw_t::_pad16"][::core::mem::offset_of!(m33_hw_t, _pad16) - 4172usize];
    ["Offset of field: m33_hw_t::dwt_comp3"]
        [::core::mem::offset_of!(m33_hw_t, dwt_comp3) - 4176usize];
    ["Offset of field: m33_hw_t::_pad17"][::core::mem::offset_of!(m33_hw_t, _pad17) - 4180usize];
    ["Offset of field: m33_hw_t::dwt_function3"]
        [::core::mem::offset_of!(m33_hw_t, dwt_function3) - 4184usize];
    ["Offset of field: m33_hw_t::_pad18"][::core::mem::offset_of!(m33_hw_t, _pad18) - 4188usize];
    ["Offset of field: m33_hw_t::dwt_devarch"]
        [::core::mem::offset_of!(m33_hw_t, dwt_devarch) - 8124usize];
    ["Offset of field: m33_hw_t::_pad19"][::core::mem::offset_of!(m33_hw_t, _pad19) - 8128usize];
    ["Offset of field: m33_hw_t::dwt_devtype"]
        [::core::mem::offset_of!(m33_hw_t, dwt_devtype) - 8140usize];
    ["Offset of field: m33_hw_t::dwt_pidr4"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr4) - 8144usize];
    ["Offset of field: m33_hw_t::dwt_pidr5"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr5) - 8148usize];
    ["Offset of field: m33_hw_t::dwt_pidr6"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr6) - 8152usize];
    ["Offset of field: m33_hw_t::dwt_pidr7"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr7) - 8156usize];
    ["Offset of field: m33_hw_t::dwt_pidr0"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr0) - 8160usize];
    ["Offset of field: m33_hw_t::dwt_pidr1"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr1) - 8164usize];
    ["Offset of field: m33_hw_t::dwt_pidr2"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr2) - 8168usize];
    ["Offset of field: m33_hw_t::dwt_pidr3"]
        [::core::mem::offset_of!(m33_hw_t, dwt_pidr3) - 8172usize];
    ["Offset of field: m33_hw_t::dwt_cidr"]
        [::core::mem::offset_of!(m33_hw_t, dwt_cidr) - 8176usize];
    ["Offset of field: m33_hw_t::fp_ctrl"][::core::mem::offset_of!(m33_hw_t, fp_ctrl) - 8192usize];
    ["Offset of field: m33_hw_t::fp_remap"]
        [::core::mem::offset_of!(m33_hw_t, fp_remap) - 8196usize];
    ["Offset of field: m33_hw_t::fp_comp"][::core::mem::offset_of!(m33_hw_t, fp_comp) - 8200usize];
    ["Offset of field: m33_hw_t::_pad20"][::core::mem::offset_of!(m33_hw_t, _pad20) - 8232usize];
    ["Offset of field: m33_hw_t::fp_devarch"]
        [::core::mem::offset_of!(m33_hw_t, fp_devarch) - 12220usize];
    ["Offset of field: m33_hw_t::_pad21"][::core::mem::offset_of!(m33_hw_t, _pad21) - 12224usize];
    ["Offset of field: m33_hw_t::fp_devtype"]
        [::core::mem::offset_of!(m33_hw_t, fp_devtype) - 12236usize];
    ["Offset of field: m33_hw_t::fp_pidr4"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr4) - 12240usize];
    ["Offset of field: m33_hw_t::fp_pidr5"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr5) - 12244usize];
    ["Offset of field: m33_hw_t::fp_pidr6"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr6) - 12248usize];
    ["Offset of field: m33_hw_t::fp_pidr7"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr7) - 12252usize];
    ["Offset of field: m33_hw_t::fp_pidr0"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr0) - 12256usize];
    ["Offset of field: m33_hw_t::fp_pidr1"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr1) - 12260usize];
    ["Offset of field: m33_hw_t::fp_pidr2"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr2) - 12264usize];
    ["Offset of field: m33_hw_t::fp_pidr3"]
        [::core::mem::offset_of!(m33_hw_t, fp_pidr3) - 12268usize];
    ["Offset of field: m33_hw_t::fp_cidr"][::core::mem::offset_of!(m33_hw_t, fp_cidr) - 12272usize];
    ["Offset of field: m33_hw_t::_pad22"][::core::mem::offset_of!(m33_hw_t, _pad22) - 12288usize];
    ["Offset of field: m33_hw_t::ictr"][::core::mem::offset_of!(m33_hw_t, ictr) - 57348usize];
    ["Offset of field: m33_hw_t::actlr"][::core::mem::offset_of!(m33_hw_t, actlr) - 57352usize];
    ["Offset of field: m33_hw_t::_pad23"][::core::mem::offset_of!(m33_hw_t, _pad23) - 57356usize];
    ["Offset of field: m33_hw_t::syst_csr"]
        [::core::mem::offset_of!(m33_hw_t, syst_csr) - 57360usize];
    ["Offset of field: m33_hw_t::syst_rvr"]
        [::core::mem::offset_of!(m33_hw_t, syst_rvr) - 57364usize];
    ["Offset of field: m33_hw_t::syst_cvr"]
        [::core::mem::offset_of!(m33_hw_t, syst_cvr) - 57368usize];
    ["Offset of field: m33_hw_t::syst_calib"]
        [::core::mem::offset_of!(m33_hw_t, syst_calib) - 57372usize];
    ["Offset of field: m33_hw_t::_pad24"][::core::mem::offset_of!(m33_hw_t, _pad24) - 57376usize];
    ["Offset of field: m33_hw_t::nvic_iser"]
        [::core::mem::offset_of!(m33_hw_t, nvic_iser) - 57600usize];
    ["Offset of field: m33_hw_t::_pad25"][::core::mem::offset_of!(m33_hw_t, _pad25) - 57608usize];
    ["Offset of field: m33_hw_t::nvic_icer"]
        [::core::mem::offset_of!(m33_hw_t, nvic_icer) - 57728usize];
    ["Offset of field: m33_hw_t::_pad26"][::core::mem::offset_of!(m33_hw_t, _pad26) - 57736usize];
    ["Offset of field: m33_hw_t::nvic_ispr"]
        [::core::mem::offset_of!(m33_hw_t, nvic_ispr) - 57856usize];
    ["Offset of field: m33_hw_t::_pad27"][::core::mem::offset_of!(m33_hw_t, _pad27) - 57864usize];
    ["Offset of field: m33_hw_t::nvic_icpr"]
        [::core::mem::offset_of!(m33_hw_t, nvic_icpr) - 57984usize];
    ["Offset of field: m33_hw_t::_pad28"][::core::mem::offset_of!(m33_hw_t, _pad28) - 57992usize];
    ["Offset of field: m33_hw_t::nvic_iabr"]
        [::core::mem::offset_of!(m33_hw_t, nvic_iabr) - 58112usize];
    ["Offset of field: m33_hw_t::_pad29"][::core::mem::offset_of!(m33_hw_t, _pad29) - 58120usize];
    ["Offset of field: m33_hw_t::nvic_itns"]
        [::core::mem::offset_of!(m33_hw_t, nvic_itns) - 58240usize];
    ["Offset of field: m33_hw_t::_pad30"][::core::mem::offset_of!(m33_hw_t, _pad30) - 58248usize];
    ["Offset of field: m33_hw_t::nvic_ipr"]
        [::core::mem::offset_of!(m33_hw_t, nvic_ipr) - 58368usize];
    ["Offset of field: m33_hw_t::_pad31"][::core::mem::offset_of!(m33_hw_t, _pad31) - 58432usize];
    ["Offset of field: m33_hw_t::cpuid"][::core::mem::offset_of!(m33_hw_t, cpuid) - 60672usize];
    ["Offset of field: m33_hw_t::icsr"][::core::mem::offset_of!(m33_hw_t, icsr) - 60676usize];
    ["Offset of field: m33_hw_t::vtor"][::core::mem::offset_of!(m33_hw_t, vtor) - 60680usize];
    ["Offset of field: m33_hw_t::aircr"][::core::mem::offset_of!(m33_hw_t, aircr) - 60684usize];
    ["Offset of field: m33_hw_t::scr"][::core::mem::offset_of!(m33_hw_t, scr) - 60688usize];
    ["Offset of field: m33_hw_t::ccr"][::core::mem::offset_of!(m33_hw_t, ccr) - 60692usize];
    ["Offset of field: m33_hw_t::shpr"][::core::mem::offset_of!(m33_hw_t, shpr) - 60696usize];
    ["Offset of field: m33_hw_t::shcsr"][::core::mem::offset_of!(m33_hw_t, shcsr) - 60708usize];
    ["Offset of field: m33_hw_t::cfsr"][::core::mem::offset_of!(m33_hw_t, cfsr) - 60712usize];
    ["Offset of field: m33_hw_t::hfsr"][::core::mem::offset_of!(m33_hw_t, hfsr) - 60716usize];
    ["Offset of field: m33_hw_t::dfsr"][::core::mem::offset_of!(m33_hw_t, dfsr) - 60720usize];
    ["Offset of field: m33_hw_t::mmfar"][::core::mem::offset_of!(m33_hw_t, mmfar) - 60724usize];
    ["Offset of field: m33_hw_t::bfar"][::core::mem::offset_of!(m33_hw_t, bfar) - 60728usize];
    ["Offset of field: m33_hw_t::_pad32"][::core::mem::offset_of!(m33_hw_t, _pad32) - 60732usize];
    ["Offset of field: m33_hw_t::id_pfr"][::core::mem::offset_of!(m33_hw_t, id_pfr) - 60736usize];
    ["Offset of field: m33_hw_t::id_dfr0"][::core::mem::offset_of!(m33_hw_t, id_dfr0) - 60744usize];
    ["Offset of field: m33_hw_t::id_afr0"][::core::mem::offset_of!(m33_hw_t, id_afr0) - 60748usize];
    ["Offset of field: m33_hw_t::id_mmfr"][::core::mem::offset_of!(m33_hw_t, id_mmfr) - 60752usize];
    ["Offset of field: m33_hw_t::id_isar"][::core::mem::offset_of!(m33_hw_t, id_isar) - 60768usize];
    ["Offset of field: m33_hw_t::_pad33"][::core::mem::offset_of!(m33_hw_t, _pad33) - 60792usize];
    ["Offset of field: m33_hw_t::ctr"][::core::mem::offset_of!(m33_hw_t, ctr) - 60796usize];
    ["Offset of field: m33_hw_t::_pad34"][::core::mem::offset_of!(m33_hw_t, _pad34) - 60800usize];
    ["Offset of field: m33_hw_t::cpacr"][::core::mem::offset_of!(m33_hw_t, cpacr) - 60808usize];
    ["Offset of field: m33_hw_t::nsacr"][::core::mem::offset_of!(m33_hw_t, nsacr) - 60812usize];
    ["Offset of field: m33_hw_t::mpu_type"]
        [::core::mem::offset_of!(m33_hw_t, mpu_type) - 60816usize];
    ["Offset of field: m33_hw_t::mpu_ctrl"]
        [::core::mem::offset_of!(m33_hw_t, mpu_ctrl) - 60820usize];
    ["Offset of field: m33_hw_t::mpu_rnr"][::core::mem::offset_of!(m33_hw_t, mpu_rnr) - 60824usize];
    ["Offset of field: m33_hw_t::mpu_rbar"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rbar) - 60828usize];
    ["Offset of field: m33_hw_t::mpu_rlar"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rlar) - 60832usize];
    ["Offset of field: m33_hw_t::mpu_rbar_a1"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rbar_a1) - 60836usize];
    ["Offset of field: m33_hw_t::mpu_rlar_a1"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rlar_a1) - 60840usize];
    ["Offset of field: m33_hw_t::mpu_rbar_a2"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rbar_a2) - 60844usize];
    ["Offset of field: m33_hw_t::mpu_rlar_a2"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rlar_a2) - 60848usize];
    ["Offset of field: m33_hw_t::mpu_rbar_a3"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rbar_a3) - 60852usize];
    ["Offset of field: m33_hw_t::mpu_rlar_a3"]
        [::core::mem::offset_of!(m33_hw_t, mpu_rlar_a3) - 60856usize];
    ["Offset of field: m33_hw_t::_pad35"][::core::mem::offset_of!(m33_hw_t, _pad35) - 60860usize];
    ["Offset of field: m33_hw_t::mpu_mair"]
        [::core::mem::offset_of!(m33_hw_t, mpu_mair) - 60864usize];
    ["Offset of field: m33_hw_t::_pad36"][::core::mem::offset_of!(m33_hw_t, _pad36) - 60872usize];
    ["Offset of field: m33_hw_t::sau_ctrl"]
        [::core::mem::offset_of!(m33_hw_t, sau_ctrl) - 60880usize];
    ["Offset of field: m33_hw_t::sau_type"]
        [::core::mem::offset_of!(m33_hw_t, sau_type) - 60884usize];
    ["Offset of field: m33_hw_t::sau_rnr"][::core::mem::offset_of!(m33_hw_t, sau_rnr) - 60888usize];
    ["Offset of field: m33_hw_t::sau_rbar"]
        [::core::mem::offset_of!(m33_hw_t, sau_rbar) - 60892usize];
    ["Offset of field: m33_hw_t::sau_rlar"]
        [::core::mem::offset_of!(m33_hw_t, sau_rlar) - 60896usize];
    ["Offset of field: m33_hw_t::sfsr"][::core::mem::offset_of!(m33_hw_t, sfsr) - 60900usize];
    ["Offset of field: m33_hw_t::sfar"][::core::mem::offset_of!(m33_hw_t, sfar) - 60904usize];
    ["Offset of field: m33_hw_t::_pad37"][::core::mem::offset_of!(m33_hw_t, _pad37) - 60908usize];
    ["Offset of field: m33_hw_t::dhcsr"][::core::mem::offset_of!(m33_hw_t, dhcsr) - 60912usize];
    ["Offset of field: m33_hw_t::dcrsr"][::core::mem::offset_of!(m33_hw_t, dcrsr) - 60916usize];
    ["Offset of field: m33_hw_t::dcrdr"][::core::mem::offset_of!(m33_hw_t, dcrdr) - 60920usize];
    ["Offset of field: m33_hw_t::demcr"][::core::mem::offset_of!(m33_hw_t, demcr) - 60924usize];
    ["Offset of field: m33_hw_t::_pad38"][::core::mem::offset_of!(m33_hw_t, _pad38) - 60928usize];
    ["Offset of field: m33_hw_t::dscsr"][::core::mem::offset_of!(m33_hw_t, dscsr) - 60936usize];
    ["Offset of field: m33_hw_t::_pad39"][::core::mem::offset_of!(m33_hw_t, _pad39) - 60940usize];
    ["Offset of field: m33_hw_t::stir"][::core::mem::offset_of!(m33_hw_t, stir) - 61184usize];
    ["Offset of field: m33_hw_t::_pad40"][::core::mem::offset_of!(m33_hw_t, _pad40) - 61188usize];
    ["Offset of field: m33_hw_t::fpccr"][::core::mem::offset_of!(m33_hw_t, fpccr) - 61236usize];
    ["Offset of field: m33_hw_t::fpcar"][::core::mem::offset_of!(m33_hw_t, fpcar) - 61240usize];
    ["Offset of field: m33_hw_t::fpdscr"][::core::mem::offset_of!(m33_hw_t, fpdscr) - 61244usize];
    ["Offset of field: m33_hw_t::mvfr"][::core::mem::offset_of!(m33_hw_t, mvfr) - 61248usize];
    ["Offset of field: m33_hw_t::_pad41"][::core::mem::offset_of!(m33_hw_t, _pad41) - 61260usize];
    ["Offset of field: m33_hw_t::ddevarch"]
        [::core::mem::offset_of!(m33_hw_t, ddevarch) - 61372usize];
    ["Offset of field: m33_hw_t::_pad42"][::core::mem::offset_of!(m33_hw_t, _pad42) - 61376usize];
    ["Offset of field: m33_hw_t::ddevtype"]
        [::core::mem::offset_of!(m33_hw_t, ddevtype) - 61388usize];
    ["Offset of field: m33_hw_t::dpidr4"][::core::mem::offset_of!(m33_hw_t, dpidr4) - 61392usize];
    ["Offset of field: m33_hw_t::dpidr5"][::core::mem::offset_of!(m33_hw_t, dpidr5) - 61396usize];
    ["Offset of field: m33_hw_t::dpidr6"][::core::mem::offset_of!(m33_hw_t, dpidr6) - 61400usize];
    ["Offset of field: m33_hw_t::dpidr7"][::core::mem::offset_of!(m33_hw_t, dpidr7) - 61404usize];
    ["Offset of field: m33_hw_t::dpidr0"][::core::mem::offset_of!(m33_hw_t, dpidr0) - 61408usize];
    ["Offset of field: m33_hw_t::dpidr1"][::core::mem::offset_of!(m33_hw_t, dpidr1) - 61412usize];
    ["Offset of field: m33_hw_t::dpidr2"][::core::mem::offset_of!(m33_hw_t, dpidr2) - 61416usize];
    ["Offset of field: m33_hw_t::dpidr3"][::core::mem::offset_of!(m33_hw_t, dpidr3) - 61420usize];
    ["Offset of field: m33_hw_t::dcidr"][::core::mem::offset_of!(m33_hw_t, dcidr) - 61424usize];
    ["Offset of field: m33_hw_t::_pad43"][::core::mem::offset_of!(m33_hw_t, _pad43) - 61440usize];
    ["Offset of field: m33_hw_t::trcprgctlr"]
        [::core::mem::offset_of!(m33_hw_t, trcprgctlr) - 266244usize];
    ["Offset of field: m33_hw_t::_pad44"][::core::mem::offset_of!(m33_hw_t, _pad44) - 266248usize];
    ["Offset of field: m33_hw_t::trcstatr"]
        [::core::mem::offset_of!(m33_hw_t, trcstatr) - 266252usize];
    ["Offset of field: m33_hw_t::trcconfigr"]
        [::core::mem::offset_of!(m33_hw_t, trcconfigr) - 266256usize];
    ["Offset of field: m33_hw_t::_pad45"][::core::mem::offset_of!(m33_hw_t, _pad45) - 266260usize];
    ["Offset of field: m33_hw_t::trceventctl0r"]
        [::core::mem::offset_of!(m33_hw_t, trceventctl0r) - 266272usize];
    ["Offset of field: m33_hw_t::trceventctl1r"]
        [::core::mem::offset_of!(m33_hw_t, trceventctl1r) - 266276usize];
    ["Offset of field: m33_hw_t::_pad46"][::core::mem::offset_of!(m33_hw_t, _pad46) - 266280usize];
    ["Offset of field: m33_hw_t::trcstallctlr"]
        [::core::mem::offset_of!(m33_hw_t, trcstallctlr) - 266284usize];
    ["Offset of field: m33_hw_t::trctsctlr"]
        [::core::mem::offset_of!(m33_hw_t, trctsctlr) - 266288usize];
    ["Offset of field: m33_hw_t::trcsyncpr"]
        [::core::mem::offset_of!(m33_hw_t, trcsyncpr) - 266292usize];
    ["Offset of field: m33_hw_t::trcccctlr"]
        [::core::mem::offset_of!(m33_hw_t, trcccctlr) - 266296usize];
    ["Offset of field: m33_hw_t::_pad47"][::core::mem::offset_of!(m33_hw_t, _pad47) - 266300usize];
    ["Offset of field: m33_hw_t::trcvictlr"]
        [::core::mem::offset_of!(m33_hw_t, trcvictlr) - 266368usize];
    ["Offset of field: m33_hw_t::_pad48"][::core::mem::offset_of!(m33_hw_t, _pad48) - 266372usize];
    ["Offset of field: m33_hw_t::trccntrldvr0"]
        [::core::mem::offset_of!(m33_hw_t, trccntrldvr0) - 266560usize];
    ["Offset of field: m33_hw_t::_pad49"][::core::mem::offset_of!(m33_hw_t, _pad49) - 266564usize];
    ["Offset of field: m33_hw_t::trcidr8"]
        [::core::mem::offset_of!(m33_hw_t, trcidr8) - 266624usize];
    ["Offset of field: m33_hw_t::trcidr9"]
        [::core::mem::offset_of!(m33_hw_t, trcidr9) - 266628usize];
    ["Offset of field: m33_hw_t::trcidr10"]
        [::core::mem::offset_of!(m33_hw_t, trcidr10) - 266632usize];
    ["Offset of field: m33_hw_t::trcidr11"]
        [::core::mem::offset_of!(m33_hw_t, trcidr11) - 266636usize];
    ["Offset of field: m33_hw_t::trcidr12"]
        [::core::mem::offset_of!(m33_hw_t, trcidr12) - 266640usize];
    ["Offset of field: m33_hw_t::trcidr13"]
        [::core::mem::offset_of!(m33_hw_t, trcidr13) - 266644usize];
    ["Offset of field: m33_hw_t::_pad50"][::core::mem::offset_of!(m33_hw_t, _pad50) - 266648usize];
    ["Offset of field: m33_hw_t::trcimspec"]
        [::core::mem::offset_of!(m33_hw_t, trcimspec) - 266688usize];
    ["Offset of field: m33_hw_t::_pad51"][::core::mem::offset_of!(m33_hw_t, _pad51) - 266692usize];
    ["Offset of field: m33_hw_t::trcidr0"]
        [::core::mem::offset_of!(m33_hw_t, trcidr0) - 266720usize];
    ["Offset of field: m33_hw_t::trcidr1"]
        [::core::mem::offset_of!(m33_hw_t, trcidr1) - 266724usize];
    ["Offset of field: m33_hw_t::trcidr2"]
        [::core::mem::offset_of!(m33_hw_t, trcidr2) - 266728usize];
    ["Offset of field: m33_hw_t::trcidr3"]
        [::core::mem::offset_of!(m33_hw_t, trcidr3) - 266732usize];
    ["Offset of field: m33_hw_t::trcidr4"]
        [::core::mem::offset_of!(m33_hw_t, trcidr4) - 266736usize];
    ["Offset of field: m33_hw_t::trcidr5"]
        [::core::mem::offset_of!(m33_hw_t, trcidr5) - 266740usize];
    ["Offset of field: m33_hw_t::trcidr6"]
        [::core::mem::offset_of!(m33_hw_t, trcidr6) - 266744usize];
    ["Offset of field: m33_hw_t::trcidr7"]
        [::core::mem::offset_of!(m33_hw_t, trcidr7) - 266748usize];
    ["Offset of field: m33_hw_t::_pad52"][::core::mem::offset_of!(m33_hw_t, _pad52) - 266752usize];
    ["Offset of field: m33_hw_t::trcrsctlr"]
        [::core::mem::offset_of!(m33_hw_t, trcrsctlr) - 266760usize];
    ["Offset of field: m33_hw_t::_pad53"][::core::mem::offset_of!(m33_hw_t, _pad53) - 266768usize];
    ["Offset of field: m33_hw_t::trcsscsr"]
        [::core::mem::offset_of!(m33_hw_t, trcsscsr) - 266912usize];
    ["Offset of field: m33_hw_t::_pad54"][::core::mem::offset_of!(m33_hw_t, _pad54) - 266916usize];
    ["Offset of field: m33_hw_t::trcsspcicr"]
        [::core::mem::offset_of!(m33_hw_t, trcsspcicr) - 266944usize];
    ["Offset of field: m33_hw_t::_pad55"][::core::mem::offset_of!(m33_hw_t, _pad55) - 266948usize];
    ["Offset of field: m33_hw_t::trcpdcr"]
        [::core::mem::offset_of!(m33_hw_t, trcpdcr) - 267024usize];
    ["Offset of field: m33_hw_t::trcpdsr"]
        [::core::mem::offset_of!(m33_hw_t, trcpdsr) - 267028usize];
    ["Offset of field: m33_hw_t::_pad56"][::core::mem::offset_of!(m33_hw_t, _pad56) - 267032usize];
    ["Offset of field: m33_hw_t::trcitatbidr"]
        [::core::mem::offset_of!(m33_hw_t, trcitatbidr) - 270052usize];
    ["Offset of field: m33_hw_t::_pad57"][::core::mem::offset_of!(m33_hw_t, _pad57) - 270056usize];
    ["Offset of field: m33_hw_t::trcitiatbinr"]
        [::core::mem::offset_of!(m33_hw_t, trcitiatbinr) - 270068usize];
    ["Offset of field: m33_hw_t::_pad58"][::core::mem::offset_of!(m33_hw_t, _pad58) - 270072usize];
    ["Offset of field: m33_hw_t::trcitiatboutr"]
        [::core::mem::offset_of!(m33_hw_t, trcitiatboutr) - 270076usize];
    ["Offset of field: m33_hw_t::_pad59"][::core::mem::offset_of!(m33_hw_t, _pad59) - 270080usize];
    ["Offset of field: m33_hw_t::trcclaimset"]
        [::core::mem::offset_of!(m33_hw_t, trcclaimset) - 270240usize];
    ["Offset of field: m33_hw_t::trcclaimclr"]
        [::core::mem::offset_of!(m33_hw_t, trcclaimclr) - 270244usize];
    ["Offset of field: m33_hw_t::_pad60"][::core::mem::offset_of!(m33_hw_t, _pad60) - 270248usize];
    ["Offset of field: m33_hw_t::trcauthstatus"]
        [::core::mem::offset_of!(m33_hw_t, trcauthstatus) - 270264usize];
    ["Offset of field: m33_hw_t::trcdevarch"]
        [::core::mem::offset_of!(m33_hw_t, trcdevarch) - 270268usize];
    ["Offset of field: m33_hw_t::_pad61"][::core::mem::offset_of!(m33_hw_t, _pad61) - 270272usize];
    ["Offset of field: m33_hw_t::trcdevid"]
        [::core::mem::offset_of!(m33_hw_t, trcdevid) - 270280usize];
    ["Offset of field: m33_hw_t::trcdevtype"]
        [::core::mem::offset_of!(m33_hw_t, trcdevtype) - 270284usize];
    ["Offset of field: m33_hw_t::trcpidr4"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr4) - 270288usize];
    ["Offset of field: m33_hw_t::trcpidr5"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr5) - 270292usize];
    ["Offset of field: m33_hw_t::trcpidr6"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr6) - 270296usize];
    ["Offset of field: m33_hw_t::trcpidr7"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr7) - 270300usize];
    ["Offset of field: m33_hw_t::trcpidr0"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr0) - 270304usize];
    ["Offset of field: m33_hw_t::trcpidr1"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr1) - 270308usize];
    ["Offset of field: m33_hw_t::trcpidr2"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr2) - 270312usize];
    ["Offset of field: m33_hw_t::trcpidr3"]
        [::core::mem::offset_of!(m33_hw_t, trcpidr3) - 270316usize];
    ["Offset of field: m33_hw_t::trccidr"]
        [::core::mem::offset_of!(m33_hw_t, trccidr) - 270320usize];
    ["Offset of field: m33_hw_t::cticontrol"]
        [::core::mem::offset_of!(m33_hw_t, cticontrol) - 270336usize];
    ["Offset of field: m33_hw_t::_pad62"][::core::mem::offset_of!(m33_hw_t, _pad62) - 270340usize];
    ["Offset of field: m33_hw_t::ctiintack"]
        [::core::mem::offset_of!(m33_hw_t, ctiintack) - 270352usize];
    ["Offset of field: m33_hw_t::ctiappset"]
        [::core::mem::offset_of!(m33_hw_t, ctiappset) - 270356usize];
    ["Offset of field: m33_hw_t::ctiappclear"]
        [::core::mem::offset_of!(m33_hw_t, ctiappclear) - 270360usize];
    ["Offset of field: m33_hw_t::ctiapppulse"]
        [::core::mem::offset_of!(m33_hw_t, ctiapppulse) - 270364usize];
    ["Offset of field: m33_hw_t::ctiinen"]
        [::core::mem::offset_of!(m33_hw_t, ctiinen) - 270368usize];
    ["Offset of field: m33_hw_t::_pad63"][::core::mem::offset_of!(m33_hw_t, _pad63) - 270400usize];
    ["Offset of field: m33_hw_t::ctiouten"]
        [::core::mem::offset_of!(m33_hw_t, ctiouten) - 270496usize];
    ["Offset of field: m33_hw_t::_pad64"][::core::mem::offset_of!(m33_hw_t, _pad64) - 270528usize];
    ["Offset of field: m33_hw_t::ctitriginstatus"]
        [::core::mem::offset_of!(m33_hw_t, ctitriginstatus) - 270640usize];
    ["Offset of field: m33_hw_t::ctitrigoutstatus"]
        [::core::mem::offset_of!(m33_hw_t, ctitrigoutstatus) - 270644usize];
    ["Offset of field: m33_hw_t::ctichinstatus"]
        [::core::mem::offset_of!(m33_hw_t, ctichinstatus) - 270648usize];
    ["Offset of field: m33_hw_t::_pad65"][::core::mem::offset_of!(m33_hw_t, _pad65) - 270652usize];
    ["Offset of field: m33_hw_t::ctigate"]
        [::core::mem::offset_of!(m33_hw_t, ctigate) - 270656usize];
    ["Offset of field: m33_hw_t::asicctl"]
        [::core::mem::offset_of!(m33_hw_t, asicctl) - 270660usize];
    ["Offset of field: m33_hw_t::_pad66"][::core::mem::offset_of!(m33_hw_t, _pad66) - 270664usize];
    ["Offset of field: m33_hw_t::itchout"]
        [::core::mem::offset_of!(m33_hw_t, itchout) - 274148usize];
    ["Offset of field: m33_hw_t::ittrigout"]
        [::core::mem::offset_of!(m33_hw_t, ittrigout) - 274152usize];
    ["Offset of field: m33_hw_t::_pad67"][::core::mem::offset_of!(m33_hw_t, _pad67) - 274156usize];
    ["Offset of field: m33_hw_t::itchin"][::core::mem::offset_of!(m33_hw_t, itchin) - 274164usize];
    ["Offset of field: m33_hw_t::_pad68"][::core::mem::offset_of!(m33_hw_t, _pad68) - 274168usize];
    ["Offset of field: m33_hw_t::itctrl"][::core::mem::offset_of!(m33_hw_t, itctrl) - 274176usize];
    ["Offset of field: m33_hw_t::_pad69"][::core::mem::offset_of!(m33_hw_t, _pad69) - 274180usize];
    ["Offset of field: m33_hw_t::devarch"]
        [::core::mem::offset_of!(m33_hw_t, devarch) - 274364usize];
    ["Offset of field: m33_hw_t::_pad70"][::core::mem::offset_of!(m33_hw_t, _pad70) - 274368usize];
    ["Offset of field: m33_hw_t::devid"][::core::mem::offset_of!(m33_hw_t, devid) - 274376usize];
    ["Offset of field: m33_hw_t::devtype"]
        [::core::mem::offset_of!(m33_hw_t, devtype) - 274380usize];
    ["Offset of field: m33_hw_t::pidr4"][::core::mem::offset_of!(m33_hw_t, pidr4) - 274384usize];
    ["Offset of field: m33_hw_t::pidr5"][::core::mem::offset_of!(m33_hw_t, pidr5) - 274388usize];
    ["Offset of field: m33_hw_t::pidr6"][::core::mem::offset_of!(m33_hw_t, pidr6) - 274392usize];
    ["Offset of field: m33_hw_t::pidr7"][::core::mem::offset_of!(m33_hw_t, pidr7) - 274396usize];
    ["Offset of field: m33_hw_t::pidr0"][::core::mem::offset_of!(m33_hw_t, pidr0) - 274400usize];
    ["Offset of field: m33_hw_t::pidr1"][::core::mem::offset_of!(m33_hw_t, pidr1) - 274404usize];
    ["Offset of field: m33_hw_t::pidr2"][::core::mem::offset_of!(m33_hw_t, pidr2) - 274408usize];
    ["Offset of field: m33_hw_t::pidr3"][::core::mem::offset_of!(m33_hw_t, pidr3) - 274412usize];
    ["Offset of field: m33_hw_t::cidr"][::core::mem::offset_of!(m33_hw_t, cidr) - 274416usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvic_hw_t {
    pub iser: [io_rw_32; 2usize],
    pub _pad0: [u32; 30usize],
    pub icer: [io_rw_32; 2usize],
    pub _pad1: [u32; 30usize],
    pub ispr: [io_rw_32; 2usize],
    pub _pad2: [u32; 30usize],
    pub icpr: [io_rw_32; 2usize],
    pub _pad3: [u32; 30usize],
    pub iabr: [io_rw_32; 2usize],
    pub _pad4: [u32; 30usize],
    pub itns: [io_rw_32; 2usize],
    pub _pad5: [u32; 30usize],
    pub ipr: [io_rw_32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvic_hw_t"][::core::mem::size_of::<nvic_hw_t>() - 832usize];
    ["Alignment of nvic_hw_t"][::core::mem::align_of::<nvic_hw_t>() - 4usize];
    ["Offset of field: nvic_hw_t::iser"][::core::mem::offset_of!(nvic_hw_t, iser) - 0usize];
    ["Offset of field: nvic_hw_t::_pad0"][::core::mem::offset_of!(nvic_hw_t, _pad0) - 8usize];
    ["Offset of field: nvic_hw_t::icer"][::core::mem::offset_of!(nvic_hw_t, icer) - 128usize];
    ["Offset of field: nvic_hw_t::_pad1"][::core::mem::offset_of!(nvic_hw_t, _pad1) - 136usize];
    ["Offset of field: nvic_hw_t::ispr"][::core::mem::offset_of!(nvic_hw_t, ispr) - 256usize];
    ["Offset of field: nvic_hw_t::_pad2"][::core::mem::offset_of!(nvic_hw_t, _pad2) - 264usize];
    ["Offset of field: nvic_hw_t::icpr"][::core::mem::offset_of!(nvic_hw_t, icpr) - 384usize];
    ["Offset of field: nvic_hw_t::_pad3"][::core::mem::offset_of!(nvic_hw_t, _pad3) - 392usize];
    ["Offset of field: nvic_hw_t::iabr"][::core::mem::offset_of!(nvic_hw_t, iabr) - 512usize];
    ["Offset of field: nvic_hw_t::_pad4"][::core::mem::offset_of!(nvic_hw_t, _pad4) - 520usize];
    ["Offset of field: nvic_hw_t::itns"][::core::mem::offset_of!(nvic_hw_t, itns) - 640usize];
    ["Offset of field: nvic_hw_t::_pad5"][::core::mem::offset_of!(nvic_hw_t, _pad5) - 648usize];
    ["Offset of field: nvic_hw_t::ipr"][::core::mem::offset_of!(nvic_hw_t, ipr) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct armv8m_scb_hw_t {
    pub cpuid: io_ro_32,
    pub icsr: io_rw_32,
    pub vtor: io_rw_32,
    pub aircr: io_rw_32,
    pub scr: io_rw_32,
    pub ccr: io_rw_32,
    pub shpr: [io_rw_32; 3usize],
    pub shcsr: io_rw_32,
    pub cfsr: io_rw_32,
    pub hfsr: io_rw_32,
    pub dfsr: io_rw_32,
    pub mmfar: io_rw_32,
    pub bfar: io_rw_32,
    pub _pad0: u32,
    pub id_pfr: [io_ro_32; 2usize],
    pub id_dfr0: io_ro_32,
    pub id_afr0: io_ro_32,
    pub id_mmfr: [io_ro_32; 4usize],
    pub id_isar: [io_ro_32; 6usize],
    pub _pad1: u32,
    pub ctr: io_ro_32,
    pub _pad2: [u32; 2usize],
    pub cpacr: io_rw_32,
    pub nsacr: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of armv8m_scb_hw_t"][::core::mem::size_of::<armv8m_scb_hw_t>() - 144usize];
    ["Alignment of armv8m_scb_hw_t"][::core::mem::align_of::<armv8m_scb_hw_t>() - 4usize];
    ["Offset of field: armv8m_scb_hw_t::cpuid"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, cpuid) - 0usize];
    ["Offset of field: armv8m_scb_hw_t::icsr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, icsr) - 4usize];
    ["Offset of field: armv8m_scb_hw_t::vtor"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, vtor) - 8usize];
    ["Offset of field: armv8m_scb_hw_t::aircr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, aircr) - 12usize];
    ["Offset of field: armv8m_scb_hw_t::scr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, scr) - 16usize];
    ["Offset of field: armv8m_scb_hw_t::ccr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, ccr) - 20usize];
    ["Offset of field: armv8m_scb_hw_t::shpr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, shpr) - 24usize];
    ["Offset of field: armv8m_scb_hw_t::shcsr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, shcsr) - 36usize];
    ["Offset of field: armv8m_scb_hw_t::cfsr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, cfsr) - 40usize];
    ["Offset of field: armv8m_scb_hw_t::hfsr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, hfsr) - 44usize];
    ["Offset of field: armv8m_scb_hw_t::dfsr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, dfsr) - 48usize];
    ["Offset of field: armv8m_scb_hw_t::mmfar"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, mmfar) - 52usize];
    ["Offset of field: armv8m_scb_hw_t::bfar"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, bfar) - 56usize];
    ["Offset of field: armv8m_scb_hw_t::_pad0"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, _pad0) - 60usize];
    ["Offset of field: armv8m_scb_hw_t::id_pfr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, id_pfr) - 64usize];
    ["Offset of field: armv8m_scb_hw_t::id_dfr0"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, id_dfr0) - 72usize];
    ["Offset of field: armv8m_scb_hw_t::id_afr0"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, id_afr0) - 76usize];
    ["Offset of field: armv8m_scb_hw_t::id_mmfr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, id_mmfr) - 80usize];
    ["Offset of field: armv8m_scb_hw_t::id_isar"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, id_isar) - 96usize];
    ["Offset of field: armv8m_scb_hw_t::_pad1"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, _pad1) - 120usize];
    ["Offset of field: armv8m_scb_hw_t::ctr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, ctr) - 124usize];
    ["Offset of field: armv8m_scb_hw_t::_pad2"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, _pad2) - 128usize];
    ["Offset of field: armv8m_scb_hw_t::cpacr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, cpacr) - 136usize];
    ["Offset of field: armv8m_scb_hw_t::nsacr"]
        [::core::mem::offset_of!(armv8m_scb_hw_t, nsacr) - 140usize];
};
#[doc = " \\brief Interrupt handler function type\n  \\ingroup hardware_irq\n\n All interrupts handlers should be of this type, and follow normal ARM EABI register saving conventions"]
pub type irq_handler_t = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    #[doc = " \\brief Set specified interrupt's priority\n  \\ingroup hardware_irq\n\n \\param num Interrupt number \\ref interrupt_nums\n \\param hardware_priority Priority to set.\n Numerically-lower values indicate a higher priority. Hardware priorities\n range from 0 (highest priority) to 255 (lowest priority). To make it easier to specify\n higher or lower priorities than the default, all IRQ priorities are\n initialized to PICO_DEFAULT_IRQ_PRIORITY by the SDK runtime at startup.\n PICO_DEFAULT_IRQ_PRIORITY defaults to 0x80\n\n \\if rp2040_specific\n Only the top 2 bits are significant on ARM Cortex-M0+ on RP2040.\n \\endif\n\n \\if rp2350_specific\n Only the top 4 bits are significant on ARM Cortex-M33 or Hazard3 (RISC-V) on RP2350.\n Note that this API uses the same (inverted) ordering as ARM on RISC-V\n \\endif"]
    pub fn irq_set_priority(num: uint, hardware_priority: u8);
}
unsafe extern "C" {
    #[doc = " \\brief Get specified interrupt's priority\n  \\ingroup hardware_irq\n\n Numerically-lower values indicate a higher priority. Hardware priorities\n range from 0 (highest priority) to 255 (lowest priority). To make it easier to specify\n higher or lower priorities than the default, all IRQ priorities are\n initialized to PICO_DEFAULT_IRQ_PRIORITY by the SDK runtime at startup.\n PICO_DEFAULT_IRQ_PRIORITY defaults to 0x80\n\n \\if rp2040_specific\n Only the top 2 bits are significant on ARM Cortex-M0+ on RP2040.\n \\endif\n\n \\if rp2350_specific\n Only the top 4 bits are significant on ARM Cortex-M33 or Hazard3 (RISC-V) on RP2350.\n Note that this API uses the same (inverted) ordering as ARM on RISC-V\n \\endif\n\n \\param num Interrupt number \\ref interrupt_nums\n \\return the IRQ priority"]
    pub fn irq_get_priority(num: uint) -> uint;
}
unsafe extern "C" {
    #[doc = " \\brief Enable or disable a specific interrupt on the executing core\n  \\ingroup hardware_irq\n\n \\param num Interrupt number \\ref interrupt_nums\n \\param enabled true to enable the interrupt, false to disable"]
    pub fn irq_set_enabled(num: uint, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Determine if a specific interrupt is enabled on the executing core\n  \\ingroup hardware_irq\n\n \\param num Interrupt number \\ref interrupt_nums\n \\return true if the interrupt is enabled"]
    pub fn irq_is_enabled(num: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Enable/disable multiple interrupts on the executing core\n  \\ingroup hardware_irq\n\n \\param mask 32-bit mask with one bits set for the interrupts to enable/disable \\ref interrupt_nums\n \\param enabled true to enable the interrupts, false to disable them."]
    pub fn irq_set_mask_enabled(mask: u32, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Enable/disable multiple interrupts on the executing core\n  \\ingroup hardware_irq\n\n \\param n the index of the mask to update. n == 0 means 0->31, n == 1 mean 32->63 etc.\n \\param mask 32-bit mask with one bits set for the interrupts to enable/disable \\ref interrupt_nums\n \\param enabled true to enable the interrupts, false to disable them."]
    pub fn irq_set_mask_n_enabled(n: uint, mask: u32, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief  Set an exclusive interrupt handler for an interrupt on the executing core.\n  \\ingroup hardware_irq\n\n Use this method to set a handler for single IRQ source interrupts, or when\n your code, use case or performance requirements dictate that there should be\n no other handlers for the interrupt.\n\n This method will assert if there is already any sort of interrupt handler installed\n for the specified irq number.\n\n NOTE: By default, the SDK uses a single shared vector table for both cores, and the currently installed\n IRQ handlers are effectively a linked list starting a vector table entry for a particular IRQ number.\n Therefore, this method (when using the same vector table for both cores) sets the same interrupt handler\n for both cores.\n\n On RP2040 this was never really a cause of any confusion, because it rarely made sense to enable\n the same interrupt number in the NVIC on both cores (see \\ref irq_set_enabled()), because the interrupt\n would then fire on both cores, and the interrupt handlers would race.\n\n The problem *does* exist however when dealing with interrupts which are independent on the two cores.\n\n This includes:\n\n * the core local \"spare\" IRQs\n * on RP2350 the SIO FIFO IRQ which is now the same irq number for both cores (vs RP2040 where it was two)\n\n In the cases where you want to enable the same IRQ on both cores, and both cores are sharing the same vector\n table, you should install the IRQ handler once - it will be used on both cores - and check the core\n number (via \\ref get_core_num()) on each core.\n\n NOTE: It is not thread safe to add/remove/handle IRQs for the same irq number in the same vector table\n from both cores concurrently.\n\n NOTE: The SDK has a PICO_VTABLE_PER_CORE define indicating whether the two vector tables are separate,\n however as of version 2.1.1 the user cannot set this value, and expect the vector table duplication to be handled\n for them. This functionality will be added in a future SDK version\n\n \\param num Interrupt number \\ref interrupt_nums\n \\param handler The handler to set. See \\ref irq_handler_t\n \\see irq_add_shared_handler()"]
    pub fn irq_set_exclusive_handler(num: uint, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief  Get the exclusive interrupt handler for an interrupt on the executing core.\n  \\ingroup hardware_irq\n\n This method will return an exclusive IRQ handler set on this core\n by irq_set_exclusive_handler if there is one.\n\n \\param num Interrupt number \\ref interrupt_nums\n \\see irq_set_exclusive_handler()\n \\return handler The handler if an exclusive handler is set for the IRQ,\n                 NULL if no handler is set or shared/shareable handlers are installed"]
    pub fn irq_get_exclusive_handler(num: uint) -> irq_handler_t;
}
unsafe extern "C" {
    #[doc = " \\brief Add a shared interrupt handler for an interrupt on the executing core\n  \\ingroup hardware_irq\n\n Use this method to add a handler on an irq number shared between multiple distinct hardware sources (e.g. GPIO, DMA or PIO IRQs).\n Handlers added by this method will all be called in sequence from highest order_priority to lowest. The\n irq_set_exclusive_handler() method should be used instead if you know there will or should only ever be one handler for the interrupt.\n\n This method will assert if there is an exclusive interrupt handler set for this irq number on this core, or if\n the (total across all IRQs on both cores) maximum (configurable via PICO_MAX_SHARED_IRQ_HANDLERS) number of shared handlers\n would be exceeded.\n\n NOTE: By default, the SDK uses a single shared vector table for both cores, and the currently installed\n IRQ handlers are effectively a linked list starting a vector table entry for a particular IRQ number.\n Therefore, this method (when using the same vector table for both cores) add the same interrupt handler\n for both cores.\n\n On RP2040 this was never really a cause of any confusion, because it rarely made sense to enable\n the same interrupt number in the NVIC on both cores (see \\ref irq_set_enabled()), because the interrupt\n would then fire on both cores, and the interrupt handlers would race.\n\n The problem *does* exist however when dealing with interrupts which are independent on the two cores.\n\n This includes:\n\n * the core local \"spare\" IRQs\n * on RP2350 the SIO FIFO IRQ which is now the same irq number for both cores (vs RP2040 where it was two)\n\n In the cases where you want to enable the same IRQ on both cores, and both cores are sharing the same vector\n table, you should install the IRQ handler once - it will be used on both cores - and check the core\n number (via \\ref get_core_num()) on each core.\n\n NOTE: It is not thread safe to add/remove/handle IRQs for the same irq number in the same vector table\n from both cores concurrently.\n\n NOTE: The SDK has a PICO_VTABLE_PER_CORE define indicating whether the two vector tables are separate,\n however as of version 2.1.1 the user cannot set this value, and expect the vector table duplication to be handled\n for them. This functionality will be added in a future SDK version\n\n \\param num Interrupt number \\ref interrupt_nums\n \\param handler The handler to set. See \\ref irq_handler_t\n \\param order_priority The order priority controls the order that handlers for the same IRQ number on the core are called.\n The shared irq handlers for an interrupt are all called when an IRQ fires, however the order of the calls is based\n on the order_priority (higher priorities are called first, identical priorities are called in undefined order). A good\n rule of thumb is to use PICO_SHARED_IRQ_HANDLER_DEFAULT_ORDER_PRIORITY if you don't much care, as it is in the middle of\n the priority range by default.\n\n \\note The order_priority uses \\em higher values for higher priorities which is the \\em opposite of the CPU interrupt priorities passed\n to irq_set_priority() which use lower values for higher priorities.\n\n \\see irq_set_exclusive_handler()"]
    pub fn irq_add_shared_handler(num: uint, handler: irq_handler_t, order_priority: u8);
}
unsafe extern "C" {
    #[doc = " \\brief Remove a specific interrupt handler for the given irq number on the executing core\n  \\ingroup hardware_irq\n\n This method may be used to remove an irq set via either irq_set_exclusive_handler() or\n irq_add_shared_handler(), and will assert if the handler is not currently installed for the given\n IRQ number\n\n \\note This method may *only* be called from user (non IRQ code) or from within the handler\n itself (i.e. an IRQ handler may remove itself as part of handling the IRQ). Attempts to call\n from another IRQ will cause an assertion.\n\n \\param num Interrupt number \\ref interrupt_nums\n \\param handler The handler to removed.\n \\see irq_set_exclusive_handler()\n \\see irq_add_shared_handler()"]
    pub fn irq_remove_handler(num: uint, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief Determine if there is an installed IRQ handler for the given interrupt number\n  \\ingroup hardware_irq\n\n See \\ref irq_set_exclusive_handler() for discussion on the scope of handlers\n when using both cores.\n\n \\param num Interrupt number \\ref interrupt_nums\n \\return true if the specified IRQ has a handler"]
    pub fn irq_has_handler(num: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Determine if the current IRQ andler for the given interrupt number is shared\n  \\ingroup hardware_irq\n\n See \\ref irq_set_exclusive_handler() for discussion on the scope of handlers\n when using both cores.\n\n \\param num Interrupt number \\ref interrupt_nums\n \\return true if the specified IRQ has a shared handler"]
    pub fn irq_has_shared_handler(num: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Get the current IRQ handler for the specified IRQ from the currently installed hardware vector table (VTOR)\n of the execution core\n  \\ingroup hardware_irq\n\n \\param num Interrupt number \\ref interrupt_nums\n \\return the address stored in the VTABLE for the given irq number"]
    pub fn irq_get_vtable_handler(num: uint) -> irq_handler_t;
}
unsafe extern "C" {
    #[doc = " \\brief Force an interrupt to be pending on the executing core\n  \\ingroup hardware_irq\n\n This should generally not be used for IRQs connected to hardware.\n\n \\param num Interrupt number \\ref interrupt_nums"]
    pub fn irq_set_pending(num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Perform IRQ priority initialization for the current core\n\n \\note This is an internal method and user should generally not call it."]
    pub fn runtime_init_per_core_irq_priorities();
}
unsafe extern "C" {
    #[doc = " \\brief Claim ownership of a user IRQ on the calling core\n  \\ingroup hardware_irq\n\n User IRQs starting from FIRST_USER_IRQ are not connected to any hardware, but can be triggered by \\ref irq_set_pending.\n\n \\note User IRQs are a core local feature; they cannot be used to communicate between cores. Therefore all functions\n dealing with Uer IRQs affect only the calling core\n\n This method explicitly claims ownership of a user IRQ, so other code can know it is being used.\n\n \\param irq_num the user IRQ to claim"]
    pub fn user_irq_claim(irq_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Mark a user IRQ as no longer used on the calling core\n  \\ingroup hardware_irq\n\n User IRQs starting from FIRST_USER_IRQ are not connected to any hardware, but can be triggered by \\ref irq_set_pending.\n\n \\note User IRQs are a core local feature; they cannot be used to communicate between cores. Therefore all functions\n dealing with Uer IRQs affect only the calling core\n\n This method explicitly releases ownership of a user IRQ, so other code can know it is free to use.\n\n \\note it is customary to have disabled the irq and removed the handler prior to calling this method.\n\n \\param irq_num the irq irq_num to unclaim"]
    pub fn user_irq_unclaim(irq_num: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Claim ownership of a free user IRQ on the calling core\n  \\ingroup hardware_irq\n\n User IRQs starting from FIRST_USER_IRQ are not connected to any hardware, but can be triggered by \\ref irq_set_pending.\n\n \\note User IRQs are a core local feature; they cannot be used to communicate between cores. Therefore all functions\n dealing with Uer IRQs affect only the calling core\n\n This method explicitly claims ownership of an unused user IRQ if there is one, so other code can know it is being used.\n\n \\param required if true the function will panic if none are available\n \\return the user IRQ number or -1 if required was false, and none were free"]
    pub fn user_irq_claim_unused(required: bool) -> cty::c_int;
}
unsafe extern "C" {
    pub fn user_irq_is_claimed(irq_num: uint) -> bool;
}
unsafe extern "C" {
    pub fn __unhandled_user_irq();
}
#[doc = "< set GPIO to output"]
pub const gpio_dir_GPIO_OUT: gpio_dir = 1;
#[doc = "< set GPIO to input"]
pub const gpio_dir_GPIO_IN: gpio_dir = 0;
#[doc = " \\file gpio.h\n  \\defgroup hardware_gpio hardware_gpio\n\n \\brief General Purpose Input/Output (GPIO) API\n\n RP-series microcontrollers have two banks of General Purpose Input / Output (GPIO) pins, which are assigned as follows:\n\n \\if rp2040_specific\n RP2040 has 30 user GPIO pins in bank 0, and 6 QSPI pins in the QSPI bank 1 (QSPI_SS, QSPI_SCLK and QSPI_SD0 to QSPI_SD3). The QSPI\n pins are used to execute code from an external flash device, leaving the User bank (GPIO0 to GPIO29) for the programmer to use.\n \\endif\n\n \\if rp2350_specific\n The number of GPIO pins available depends on the package. There are 30 user GPIOs in bank 0 in the QFN-60 package (RP2350A), or 48 user GPIOs\n in the QFN-80 package. Bank 1 contains the 6 QSPI pins and the USB DP/DM pins.\n \\endif\n\n All GPIOs support digital input and output, but a subset can also be used as inputs to the chip’s Analogue to Digital\n Converter (ADC). The allocation of GPIO pins to the ADC depends on the packaging.\n\n RP2040 and RP2350 QFN-60 GPIO, ADC pins are 26-29.\n RP2350 QFN-80, ADC pins are 40-47.\n\n Each GPIO can be controlled directly by software running on the processors, or by a number of other functional blocks.\n\n The function allocated to each GPIO is selected by calling the \\ref gpio_set_function function. \\note Not all functions\n are available on all pins.\n\n Each GPIO can have one function selected at a time. Likewise, each peripheral input (e.g. UART0 RX) should only be selected on\n one _GPIO_ at a time. If the same peripheral input is connected to multiple GPIOs, the peripheral sees the logical OR of these\n GPIO inputs. Please refer to the datasheet for more information on GPIO function select.\n\n ### Function Select Table\n\n \\if rp2040_specific\n On RP2040 the function selects are:\n\n | GPIO   | F1       | F2        | F3       | F4     | F5  | F6   | F7   | F8            | F9            |\n |--------|----------|-----------|----------|--------|-----|------|------|---------------|---------------|\n | 0      | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 1      | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 2      | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 3      | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 4      | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 5      | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM2 B | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 6      | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM3 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 7      | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM3 B | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 8      | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM4 A | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 9      | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM4 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 10     | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM5 A | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 11     | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 12     | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 13     | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 14     | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM7 A | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 15     | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM7 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 16     | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 17     | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 18     | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 19     | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 20     | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 | CLOCK GPIN0   | USB VBUS EN   |\n | 21     | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM2 B | SIO | PIO0 | PIO1 | CLOCK GPOUT0  | USB OVCUR DET |\n | 22     | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM3 A | SIO | PIO0 | PIO1 | CLOCK GPIN1   | USB VBUS DET  |\n | 23     | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM3 B | SIO | PIO0 | PIO1 | CLOCK GPOUT1  | USB VBUS EN   |\n | 24     | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM4 A | SIO | PIO0 | PIO1 | CLOCK GPOUT2  | USB OVCUR DET |\n | 25     | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM4 B | SIO | PIO0 | PIO1 | CLOCK GPOUT3  | USB VBUS DET  |\n | 26     | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM5 A | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n | 27     | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET |\n | 28     | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 |               | USB VBUS DET  |\n | 29     | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 |               | USB VBUS EN   |\n \\endif\n \\if rp2350_specific\n On RP2350 the function selects are:\n\n | GPIO  | F0   | F1       | F2        | F3       | F4     | F5  | F6   | F7   | F8   | F9           | F10           | F11      |\n |-------|------|----------|-----------|----------|--------|-----|------|------|------|--------------|---------------|----------|\n | 0     |      | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 | PIO2 | XIP_CS1n     | USB OVCUR DET |          |\n | 1     |      | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 | PIO2 | TRACECLK     | USB VBUS DET  |          |\n | 2     |      | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 | PIO2 | TRACEDATA0   | USB VBUS EN   | UART0 TX |\n | 3     |      | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 | PIO2 | TRACEDATA1   | USB OVCUR DET | UART0 RX |\n | 4     |      | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 | PIO2 | TRACEDATA2   | USB VBUS DET  |          |\n | 5     |      | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM2 B | SIO | PIO0 | PIO1 | PIO2 | TRACEDATA3   | USB VBUS EN   |          |\n | 6     |      | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM3 A | SIO | PIO0 | PIO1 | PIO2 |              | USB OVCUR DET | UART1 TX |\n | 7     |      | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM3 B | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS DET  | UART1 RX |\n | 8     |      | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM4 A | SIO | PIO0 | PIO1 | PIO2 | XIP_CS1n     | USB VBUS EN   |          |\n | 9     |      | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM4 B | SIO | PIO0 | PIO1 | PIO2 |              | USB OVCUR DET |          |\n | 10    |      | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM5 A | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS DET  | UART1 TX |\n | 11    |      | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS EN   | UART1 RX |\n | 12    | HSTX | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPIN0  | USB OVCUR DET |          |\n | 13    | HSTX | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT0 | USB VBUS DET  |          |\n | 14    | HSTX | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM7 A | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPIN1  | USB VBUS EN   | UART0 TX |\n | 15    | HSTX | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM7 B | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT1 | USB OVCUR DET | UART0 RX |\n | 16    | HSTX | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS DET  |          |\n | 17    | HSTX | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS EN   |          |\n | 18    | HSTX | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 | PIO2 |              | USB OVCUR DET | UART0 TX |\n | 19    | HSTX | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 | PIO2 | XIP_CS1n     | USB VBUS DET  | UART0 RX |\n | 20    |      | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPIN0  | USB VBUS EN   |          |\n | 21    |      | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM2 B | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT0 | USB OVCUR DET |          |\n | 22    |      | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM3 A | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPIN1  | USB VBUS DET  | UART1 TX |\n | 23    |      | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM3 B | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT1 | USB VBUS EN   | UART1 RX |\n | 24    |      | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM4 A | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT2 | USB OVCUR DET |          |\n | 25    |      | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM4 B | SIO | PIO0 | PIO1 | PIO2 | CLOCK GPOUT3 | USB VBUS DET  |          |\n | 26    |      | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM5 A | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS EN   | UART1 TX |\n | 27    |      | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 | PIO2 |              | USB OVCUR DET | UART1 RX |\n | 28    |      | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS DET  |          |\n | 29    |      | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 | PIO2 |              | USB VBUS EN   |          |\n\n GPIOs 30 through 47 are QFN-80 only:\n\n | GPIO | F0 | F1       | F2       | F3        | F4      | F5  | F6   | F7   | F8   | F9       | F10           | F11      |\n |------|----|----------|----------|-----------|---------|-----|------|------|------|----------|---------------|----------|\n | 30   |    | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM7 A  | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET | UART0 TX |\n | 31   |    | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM7 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART0 RX |\n | 32   |    | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM8 A  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   |          |\n | 33   |    | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM8 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET |          |\n | 34   |    | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM9 A  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART0 TX |\n | 35   |    | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM9 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   | UART0 RX |\n | 36   |    | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM10 A | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET |          |\n | 37   |    | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM10 B | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  |          |\n | 38   |    | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM11 A | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   | UART1 TX |\n | 39   |    | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM11 B | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET | UART1 RX |\n | 40   |    | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM8 A  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  |          |\n | 41   |    | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM8 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   |          |\n | 42   |    | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM9 A  | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET | UART1 TX |\n | 43   |    | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM9 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART1 RX |\n | 44   |    | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM10 A | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   |          |\n | 45   |    | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM10 B | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET |          |\n | 46   |    | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM11 A | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART0 TX |\n | 47   |    | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM11 B | SIO | PIO0 | PIO1 | PIO2 | XIP_CS1n | USB VBUS EN   | UART0 RX |\n\n \\endif"]
pub type gpio_dir = cty::c_uint;
#[doc = "< IRQ when the GPIO pin is a logical 0"]
pub const gpio_irq_level_GPIO_IRQ_LEVEL_LOW: gpio_irq_level = 1;
#[doc = "< IRQ when the GPIO pin is a logical 1"]
pub const gpio_irq_level_GPIO_IRQ_LEVEL_HIGH: gpio_irq_level = 2;
#[doc = "< IRQ when the GPIO has transitioned from a logical 1 to a logical 0"]
pub const gpio_irq_level_GPIO_IRQ_EDGE_FALL: gpio_irq_level = 4;
#[doc = "< IRQ when the GPIO has transitioned from a logical 0 to a logical 1"]
pub const gpio_irq_level_GPIO_IRQ_EDGE_RISE: gpio_irq_level = 8;
#[doc = " \\brief  GPIO Interrupt level definitions (GPIO events)\n  \\ingroup hardware_gpio\n  \\brief GPIO Interrupt levels\n\n An interrupt can be generated for every GPIO pin in 4 scenarios:\n\n * Level High: the GPIO pin is a logical 1\n * Level Low: the GPIO pin is a logical 0\n * Edge High: the GPIO has transitioned from a logical 0 to a logical 1\n * Edge Low: the GPIO has transitioned from a logical 1 to a logical 0\n\n The level interrupts are not latched. This means that if the pin is a logical 1 and the level high interrupt is active, it will\n become inactive as soon as the pin changes to a logical 0. The edge interrupts are stored in the INTR register and can be\n cleared by writing to the INTR register."]
pub type gpio_irq_level = cty::c_uint;
#[doc = " Callback function type for GPIO events\n  \\ingroup hardware_gpio\n\n \\param gpio Which GPIO caused this interrupt\n \\param event_mask Which events caused this interrupt. See \\ref gpio_irq_level for details.\n \\sa gpio_set_irq_enabled_with_callback()\n \\sa gpio_set_irq_callback()"]
pub type gpio_irq_callback_t =
    ::core::option::Option<unsafe extern "C" fn(gpio: uint, event_mask: u32)>;
#[doc = "< peripheral signal selected via \\ref gpio_set_function"]
pub const gpio_override_GPIO_OVERRIDE_NORMAL: gpio_override = 0;
#[doc = "< invert peripheral signal selected via \\ref gpio_set_function"]
pub const gpio_override_GPIO_OVERRIDE_INVERT: gpio_override = 1;
#[doc = "< drive low/disable output"]
pub const gpio_override_GPIO_OVERRIDE_LOW: gpio_override = 2;
#[doc = "< drive high/enable output"]
pub const gpio_override_GPIO_OVERRIDE_HIGH: gpio_override = 3;
#[doc = " \\brief GPIO override modes\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_irqover, gpio_set_outover, gpio_set_inover, gpio_set_oeover"]
pub type gpio_override = cty::c_uint;
#[doc = "< Slew rate limiting enabled"]
pub const gpio_slew_rate_GPIO_SLEW_RATE_SLOW: gpio_slew_rate = 0;
#[doc = "< Slew rate limiting disabled"]
pub const gpio_slew_rate_GPIO_SLEW_RATE_FAST: gpio_slew_rate = 1;
#[doc = " \\brief Slew rate limiting levels for GPIO outputs\n  \\ingroup hardware_gpio\n\n Slew rate limiting increases the minimum rise/fall time when a GPIO output\n is lightly loaded, which can help to reduce electromagnetic emissions.\n \\sa gpio_set_slew_rate"]
pub type gpio_slew_rate = cty::c_uint;
#[doc = "< 2 mA nominal drive strength"]
pub const gpio_drive_strength_GPIO_DRIVE_STRENGTH_2MA: gpio_drive_strength = 0;
#[doc = "< 4 mA nominal drive strength"]
pub const gpio_drive_strength_GPIO_DRIVE_STRENGTH_4MA: gpio_drive_strength = 1;
#[doc = "< 8 mA nominal drive strength"]
pub const gpio_drive_strength_GPIO_DRIVE_STRENGTH_8MA: gpio_drive_strength = 2;
#[doc = "< 12 mA nominal drive strength"]
pub const gpio_drive_strength_GPIO_DRIVE_STRENGTH_12MA: gpio_drive_strength = 3;
#[doc = " \\brief Drive strength levels for GPIO outputs\n  \\ingroup hardware_gpio\n\n Drive strength levels for GPIO outputs.\n \\sa gpio_set_drive_strength"]
pub type gpio_drive_strength = cty::c_uint;
unsafe extern "C" {
    #[doc = " \\brief Select GPIO function\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param fn Which GPIO function select to use from list \\ref gpio_function_t"]
    pub fn gpio_set_function(gpio: uint, fn_: gpio_function_t);
}
unsafe extern "C" {
    #[doc = " \\brief Select the function for multiple GPIOs\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_function\n \\param gpio_mask Mask with 1 bit per GPIO number to set the function for\n \\param fn Which GPIO function select to use from list \\ref gpio_function_t"]
    pub fn gpio_set_function_masked(gpio_mask: u32, fn_: gpio_function_t);
}
unsafe extern "C" {
    #[doc = " \\brief Select the function for multiple GPIOs\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_function\n \\param gpio_mask Mask with 1 bit per GPIO number to set the function for\n \\param fn Which GPIO function select to use from list \\ref gpio_function_t"]
    pub fn gpio_set_function_masked64(gpio_mask: u64, fn_: gpio_function_t);
}
unsafe extern "C" {
    #[doc = " \\brief Determine current GPIO function\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\return Which GPIO function is currently selected from list \\ref gpio_function_t"]
    pub fn gpio_get_function(gpio: uint) -> gpio_function_t;
}
unsafe extern "C" {
    #[doc = " \\brief Select up and down pulls on specific GPIO\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param up If true set a pull up on the GPIO\n \\param down If true set a pull down on the GPIO\n\n \\note On the RP2040, setting both pulls enables a \"bus keep\" function,\n i.e. a weak pull to whatever is current high/low state of GPIO."]
    pub fn gpio_set_pulls(gpio: uint, up: bool, down: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Set GPIO IRQ override\n  \\ingroup hardware_gpio\n\n Optionally invert a GPIO IRQ signal, or drive it high or low\n\n \\param gpio GPIO number\n \\param value See \\ref gpio_override"]
    pub fn gpio_set_irqover(gpio: uint, value: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Set GPIO output override\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param value See \\ref gpio_override"]
    pub fn gpio_set_outover(gpio: uint, value: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Select GPIO input override\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param value See \\ref gpio_override"]
    pub fn gpio_set_inover(gpio: uint, value: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Select GPIO output enable override\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param value See \\ref gpio_override"]
    pub fn gpio_set_oeover(gpio: uint, value: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Enable GPIO input\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number\n \\param enabled true to enable input on specified GPIO"]
    pub fn gpio_set_input_enabled(gpio: uint, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Enable/disable GPIO input hysteresis (Schmitt trigger)\n  \\ingroup hardware_gpio\n\n Enable or disable the Schmitt trigger hysteresis on a given GPIO. This is\n enabled on all GPIOs by default. Disabling input hysteresis can lead to\n inconsistent readings when the input signal has very long rise or fall\n times, but slightly reduces the GPIO's input delay.\n\n \\sa gpio_is_input_hysteresis_enabled\n \\param gpio GPIO number\n \\param enabled true to enable input hysteresis on specified GPIO"]
    pub fn gpio_set_input_hysteresis_enabled(gpio: uint, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Determine whether input hysteresis is enabled on a specified GPIO\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_input_hysteresis_enabled\n \\param gpio GPIO number"]
    pub fn gpio_is_input_hysteresis_enabled(gpio: uint) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Set slew rate for a specified GPIO\n  \\ingroup hardware_gpio\n\n \\sa gpio_get_slew_rate\n \\param gpio GPIO number\n \\param slew GPIO output slew rate"]
    pub fn gpio_set_slew_rate(gpio: uint, slew: gpio_slew_rate);
}
unsafe extern "C" {
    #[doc = " \\brief Determine current slew rate for a specified GPIO\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_slew_rate\n \\param gpio GPIO number\n \\return Current slew rate of that GPIO"]
    pub fn gpio_get_slew_rate(gpio: uint) -> gpio_slew_rate;
}
unsafe extern "C" {
    #[doc = " \\brief Set drive strength for a specified GPIO\n  \\ingroup hardware_gpio\n\n \\sa gpio_get_drive_strength\n \\param gpio GPIO number\n \\param drive GPIO output drive strength"]
    pub fn gpio_set_drive_strength(gpio: uint, drive: gpio_drive_strength);
}
unsafe extern "C" {
    #[doc = " \\brief Determine current drive strength for a specified GPIO\n  \\ingroup hardware_gpio\n\n \\sa gpio_set_drive_strength\n \\param gpio GPIO number\n \\return Current drive strength of that GPIO"]
    pub fn gpio_get_drive_strength(gpio: uint) -> gpio_drive_strength;
}
unsafe extern "C" {
    #[doc = " \\brief Enable or disable specific interrupt events for specified GPIO\n  \\ingroup hardware_gpio\n\n This function sets which GPIO events cause a GPIO interrupt on the calling core. See\n \\ref gpio_set_irq_callback, \\ref gpio_set_irq_enabled_with_callback and\n \\ref gpio_add_raw_irq_handler to set up a GPIO interrupt handler to handle the events.\n\n \\note The IO IRQs are independent per-processor. This configures the interrupt events for\n the processor that calls the function.\n\n \\param gpio GPIO number\n \\param event_mask Which events will cause an interrupt\n \\param enabled Enable or disable flag\n\n Events is a bitmask of the following \\ref gpio_irq_level values:\n\n bit | constant            | interrupt\n ----|---------------------|------------------------------------\n   0 | GPIO_IRQ_LEVEL_LOW  | Continuously while level is low\n   1 | GPIO_IRQ_LEVEL_HIGH | Continuously while level is high\n   2 | GPIO_IRQ_EDGE_FALL  | On each transition from high to low\n   3 | GPIO_IRQ_EDGE_RISE  | On each transition from low to high\n\n which are specified in \\ref gpio_irq_level"]
    pub fn gpio_set_irq_enabled(gpio: uint, event_mask: u32, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Set the generic callback used for GPIO IRQ events for the current core\n  \\ingroup hardware_gpio\n\n This function sets the callback used for all GPIO IRQs on the current core that are not explicitly\n hooked via \\ref gpio_add_raw_irq_handler or other gpio_add_raw_irq_handler_ functions.\n\n This function is called with the GPIO number and event mask for each of the (not explicitly hooked)\n GPIOs that have events enabled and that are pending (see \\ref gpio_get_irq_event_mask).\n\n \\note The IO IRQs are independent per-processor. This function affects\n the processor that calls the function.\n\n \\param callback default user function to call on GPIO irq. Note only one of these can be set per processor."]
    pub fn gpio_set_irq_callback(callback: gpio_irq_callback_t);
}
unsafe extern "C" {
    #[doc = " \\brief Convenience function which performs multiple GPIO IRQ related initializations\n  \\ingroup hardware_gpio\n\n This method is a slightly eclectic mix of initialization, that:\n\n \\li Updates whether the specified events for the specified GPIO causes an interrupt on the calling core based\n on the enable flag.\n\n \\li Sets the callback handler for the calling core to callback (or clears the handler if the callback is NULL).\n\n \\li Enables GPIO IRQs on the current core if enabled is true.\n\n This method is commonly used to perform a one time setup, and following that any additional IRQs/events are enabled\n via \\ref gpio_set_irq_enabled. All GPIOs/events added in this way on the same core share the same callback; for multiple\n independent handlers for different GPIOs you should use \\ref gpio_add_raw_irq_handler and related functions.\n\n This method is equivalent to:\n\n \\code{.c}\n gpio_set_irq_enabled(gpio, event_mask, enabled);\n gpio_set_irq_callback(callback);\n if (enabled) irq_set_enabled(IO_IRQ_BANK0, true);\n \\endcode\n\n \\note The IO IRQs are independent per-processor. This method affects only the processor that calls the function.\n\n \\param gpio GPIO number\n \\param event_mask Which events will cause an interrupt. See \\ref gpio_irq_level for details.\n \\param enabled Enable or disable flag\n \\param callback user function to call on GPIO irq. if NULL, the callback is removed"]
    pub fn gpio_set_irq_enabled_with_callback(
        gpio: uint,
        event_mask: u32,
        enabled: bool,
        callback: gpio_irq_callback_t,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Enable dormant wake up interrupt for specified GPIO and events\n  \\ingroup hardware_gpio\n\n This configures IRQs to restart the XOSC or ROSC when they are\n disabled in dormant mode\n\n \\param gpio GPIO number\n \\param event_mask Which events will cause an interrupt. See \\ref gpio_irq_level for details.\n \\param enabled Enable/disable flag"]
    pub fn gpio_set_dormant_irq_enabled(gpio: uint, event_mask: u32, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Adds a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default callback. The order\n relative to the default callback can be controlled via the order_priority parameter (the default callback has the priority\n \\ref GPIO_IRQ_CALLBACK_ORDER_PRIORITY which defaults to the lowest priority with the intention of it running last).\n\n This method adds such an explicit GPIO IRQ handler, and disables the \"default\" callback for the specified GPIOs.\n\n \\note Multiple raw handlers should not be added for the same GPIOs, and this method will assert if you attempt to.\n Internally, this function calls \\ref irq_add_shared_handler, which will assert if the maximum number of shared handlers\n (configurable via PICO_MAX_IRQ_SHARED_HANDLERS) would be exceeded.\n\n A raw handler should check for whichever GPIOs and events it handles, and acknowledge them itself; it might look something like:\n\n \\code{.c}\n void my_irq_handler(void) {\n     if (gpio_get_irq_event_mask(my_gpio_num) & my_gpio_event_mask) {\n        gpio_acknowledge_irq(my_gpio_num, my_gpio_event_mask);\n       // handle the IRQ\n     }\n     if (gpio_get_irq_event_mask(my_gpio_num2) & my_gpio_event_mask2) {\n        gpio_acknowledge_irq(my_gpio_num2, my_gpio_event_mask2);\n       // handle the IRQ\n     }\n }\n \\endcode\n\n @param gpio_mask a bit mask of the GPIO numbers that will no longer be passed to the default callback for this core\n @param handler the handler to add to the list of GPIO IRQ handlers for this core\n @param order_priority the priority order to determine the relative position of the handler in the list of GPIO IRQ handlers for this core."]
    pub fn gpio_add_raw_irq_handler_with_order_priority_masked(
        gpio_mask: u32,
        handler: irq_handler_t,
        order_priority: u8,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Adds a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default callback. The order\n relative to the default callback can be controlled via the order_priority parameter (the default callback has the priority\n \\ref GPIO_IRQ_CALLBACK_ORDER_PRIORITY which defaults to the lowest priority with the intention of it running last).\n\n This method adds such an explicit GPIO IRQ handler, and disables the \"default\" callback for the specified GPIOs.\n\n \\note Multiple raw handlers should not be added for the same GPIOs, and this method will assert if you attempt to.\n Internally, this function calls \\ref irq_add_shared_handler, which will assert if the maximum number of shared handlers\n (configurable via PICO_MAX_IRQ_SHARED_HANDLERS) would be exceeded.\n\n A raw handler should check for whichever GPIOs and events it handles, and acknowledge them itself; it might look something like:\n\n \\code{.c}\n void my_irq_handler(void) {\n     if (gpio_get_irq_event_mask(my_gpio_num) & my_gpio_event_mask) {\n        gpio_acknowledge_irq(my_gpio_num, my_gpio_event_mask);\n       // handle the IRQ\n     }\n     if (gpio_get_irq_event_mask(my_gpio_num2) & my_gpio_event_mask2) {\n        gpio_acknowledge_irq(my_gpio_num2, my_gpio_event_mask2);\n       // handle the IRQ\n     }\n }\n \\endcode\n\n @param gpio_mask a bit mask of the GPIO numbers that will no longer be passed to the default callback for this core\n @param handler the handler to add to the list of GPIO IRQ handlers for this core\n @param order_priority the priority order to determine the relative position of the handler in the list of GPIO IRQ handlers for this core."]
    pub fn gpio_add_raw_irq_handler_with_order_priority_masked64(
        gpio_mask: u64,
        handler: irq_handler_t,
        order_priority: u8,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Adds a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default event callback.\n\n This method adds such a callback, and disables the \"default\" callback for the specified GPIOs.\n\n \\note Multiple raw handlers should not be added for the same GPIOs, and this method will assert if you attempt to.\n Internally, this function calls \\ref irq_add_shared_handler, which will assert if the maximum number of shared handlers\n (configurable via PICO_MAX_IRQ_SHARED_HANDLERS) would be exceeded.\n\n A raw handler should check for whichever GPIOs and events it handles, and acknowledge them itself; it might look something like:\n\n \\code{.c}\n void my_irq_handler(void) {\n     if (gpio_get_irq_event_mask(my_gpio_num) & my_gpio_event_mask) {\n        gpio_acknowledge_irq(my_gpio_num, my_gpio_event_mask);\n       // handle the IRQ\n     }\n     if (gpio_get_irq_event_mask(my_gpio_num2) & my_gpio_event_mask2) {\n        gpio_acknowledge_irq(my_gpio_num2, my_gpio_event_mask2);\n       // handle the IRQ\n     }\n }\n \\endcode\n\n @param gpio_mask a bit mask of the GPIO numbers that will no longer be passed to the default callback for this core\n @param handler the handler to add to the list of GPIO IRQ handlers for this core"]
    pub fn gpio_add_raw_irq_handler_masked(gpio_mask: u32, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief Adds a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default event callback.\n\n This method adds such a callback, and disables the \"default\" callback for the specified GPIOs.\n\n \\note Multiple raw handlers should not be added for the same GPIOs, and this method will assert if you attempt to.\n Internally, this function calls \\ref irq_add_shared_handler, which will assert if the maximum number of shared handlers\n (configurable via PICO_MAX_IRQ_SHARED_HANDLERS) would be exceeded.\n\n A raw handler should check for whichever GPIOs and events it handles, and acknowledge them itself; it might look something like:\n\n \\code{.c}\n void my_irq_handler(void) {\n     if (gpio_get_irq_event_mask(my_gpio_num) & my_gpio_event_mask) {\n        gpio_acknowledge_irq(my_gpio_num, my_gpio_event_mask);\n       // handle the IRQ\n     }\n     if (gpio_get_irq_event_mask(my_gpio_num2) & my_gpio_event_mask2) {\n        gpio_acknowledge_irq(my_gpio_num2, my_gpio_event_mask2);\n       // handle the IRQ\n     }\n }\n \\endcode\n\n @param gpio_mask a 64 bit mask of the GPIO numbers that will no longer be passed to the default callback for this core\n @param handler the handler to add to the list of GPIO IRQ handlers for this core"]
    pub fn gpio_add_raw_irq_handler_masked64(gpio_mask: u64, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief Removes a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default event callback.\n\n This method removes such a callback, and enables the \"default\" callback for the specified GPIOs.\n\n \\note You should always use the same gpio_mask as you used when you added the raw IRQ handler.\n\n @param gpio_mask a bit mask of the GPIO numbers that will now be passed to the default callback for this core\n @param handler the handler to remove from the list of GPIO IRQ handlers for this core"]
    pub fn gpio_remove_raw_irq_handler_masked(gpio_mask: u32, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief Removes a raw GPIO IRQ handler for the specified GPIOs on the current core\n  \\ingroup hardware_gpio\n\n In addition to the default mechanism of a single GPIO IRQ event callback per core (see \\ref gpio_set_irq_callback),\n it is possible to add explicit GPIO IRQ handlers which are called independent of the default event callback.\n\n This method removes such a callback, and enables the \"default\" callback for the specified GPIOs.\n\n @param gpio_mask a bit mask of the GPIO numbers that will now be passed to the default callback for this core\n @param handler the handler to remove from the list of GPIO IRQ handlers for this core"]
    pub fn gpio_remove_raw_irq_handler_masked64(gpio_mask: u64, handler: irq_handler_t);
}
unsafe extern "C" {
    #[doc = " \\brief Initialise a GPIO for (enabled I/O and set func to GPIO_FUNC_SIO)\n  \\ingroup hardware_gpio\n\n Clear the output enable (i.e. set to input).\n Clear any output value.\n\n \\param gpio GPIO number"]
    pub fn gpio_init(gpio: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Resets a GPIO back to the NULL function, i.e. disables it.\n  \\ingroup hardware_gpio\n\n \\param gpio GPIO number"]
    pub fn gpio_deinit(gpio: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Initialise multiple GPIOs (enabled I/O and set func to GPIO_FUNC_SIO)\n  \\ingroup hardware_gpio\n\n Clear the output enable (i.e. set to input).\n Clear any output value.\n\n \\param gpio_mask Mask with 1 bit per GPIO number to initialize"]
    pub fn gpio_init_mask(gpio_mask: uint);
}
unsafe extern "C" {
    pub fn gpio_debug_pins_init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uart_hw_t {
    pub dr: io_rw_32,
    pub rsr: io_rw_32,
    pub _pad0: [u32; 4usize],
    pub fr: io_ro_32,
    pub _pad1: u32,
    pub ilpr: io_rw_32,
    pub ibrd: io_rw_32,
    pub fbrd: io_rw_32,
    pub lcr_h: io_rw_32,
    pub cr: io_rw_32,
    pub ifls: io_rw_32,
    pub imsc: io_rw_32,
    pub ris: io_ro_32,
    pub mis: io_ro_32,
    pub icr: io_rw_32,
    pub dmacr: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uart_hw_t"][::core::mem::size_of::<uart_hw_t>() - 76usize];
    ["Alignment of uart_hw_t"][::core::mem::align_of::<uart_hw_t>() - 4usize];
    ["Offset of field: uart_hw_t::dr"][::core::mem::offset_of!(uart_hw_t, dr) - 0usize];
    ["Offset of field: uart_hw_t::rsr"][::core::mem::offset_of!(uart_hw_t, rsr) - 4usize];
    ["Offset of field: uart_hw_t::_pad0"][::core::mem::offset_of!(uart_hw_t, _pad0) - 8usize];
    ["Offset of field: uart_hw_t::fr"][::core::mem::offset_of!(uart_hw_t, fr) - 24usize];
    ["Offset of field: uart_hw_t::_pad1"][::core::mem::offset_of!(uart_hw_t, _pad1) - 28usize];
    ["Offset of field: uart_hw_t::ilpr"][::core::mem::offset_of!(uart_hw_t, ilpr) - 32usize];
    ["Offset of field: uart_hw_t::ibrd"][::core::mem::offset_of!(uart_hw_t, ibrd) - 36usize];
    ["Offset of field: uart_hw_t::fbrd"][::core::mem::offset_of!(uart_hw_t, fbrd) - 40usize];
    ["Offset of field: uart_hw_t::lcr_h"][::core::mem::offset_of!(uart_hw_t, lcr_h) - 44usize];
    ["Offset of field: uart_hw_t::cr"][::core::mem::offset_of!(uart_hw_t, cr) - 48usize];
    ["Offset of field: uart_hw_t::ifls"][::core::mem::offset_of!(uart_hw_t, ifls) - 52usize];
    ["Offset of field: uart_hw_t::imsc"][::core::mem::offset_of!(uart_hw_t, imsc) - 56usize];
    ["Offset of field: uart_hw_t::ris"][::core::mem::offset_of!(uart_hw_t, ris) - 60usize];
    ["Offset of field: uart_hw_t::mis"][::core::mem::offset_of!(uart_hw_t, mis) - 64usize];
    ["Offset of field: uart_hw_t::icr"][::core::mem::offset_of!(uart_hw_t, icr) - 68usize];
    ["Offset of field: uart_hw_t::dmacr"][::core::mem::offset_of!(uart_hw_t, dmacr) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uart_inst {
    _unused: [u8; 0],
}
#[doc = " \\file hardware/uart.h\n  \\defgroup hardware_uart hardware_uart\n\n \\brief Hardware UART API\n\n RP-series microcontrollers have 2 identical instances of a UART peripheral, based on the ARM PL011. Each UART can be connected to a number\n of GPIO pins as defined in the GPIO muxing.\n\n Only the TX, RX, RTS, and CTS signals are\n connected, meaning that the modem mode and IrDA mode of the PL011 are not supported.\n\n \\subsection uart_example Example\n \\addtogroup hardware_uart\n\n  \\code\n  int main() {\n\n     // Set the GPIO pin mux to the UART - pin 0 is TX, 1 is RX; note use of UART_FUNCSEL_NUM for the general\n     // case where the func sel used for UART depends on the pin number\n     // Do this before calling uart_init to avoid losing data\n     gpio_set_function(0, UART_FUNCSEL_NUM(uart0, 0));\n     gpio_set_function(1, UART_FUNCSEL_NUM(uart0, 1));\n\n     // Initialise UART 0\n     uart_init(uart0, 115200);\n\n     uart_puts(uart0, \"Hello world!\");\n }\n \\endcode"]
pub type uart_inst_t = uart_inst;
#[doc = "< Select PIO0's TX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_TX0: dreq_num_rp2350 = 0;
#[doc = "< Select PIO0's TX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_TX1: dreq_num_rp2350 = 1;
#[doc = "< Select PIO0's TX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_TX2: dreq_num_rp2350 = 2;
#[doc = "< Select PIO0's TX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_TX3: dreq_num_rp2350 = 3;
#[doc = "< Select PIO0's RX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_RX0: dreq_num_rp2350 = 4;
#[doc = "< Select PIO0's RX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_RX1: dreq_num_rp2350 = 5;
#[doc = "< Select PIO0's RX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_RX2: dreq_num_rp2350 = 6;
#[doc = "< Select PIO0's RX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO0_RX3: dreq_num_rp2350 = 7;
#[doc = "< Select PIO1's TX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_TX0: dreq_num_rp2350 = 8;
#[doc = "< Select PIO1's TX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_TX1: dreq_num_rp2350 = 9;
#[doc = "< Select PIO1's TX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_TX2: dreq_num_rp2350 = 10;
#[doc = "< Select PIO1's TX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_TX3: dreq_num_rp2350 = 11;
#[doc = "< Select PIO1's RX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_RX0: dreq_num_rp2350 = 12;
#[doc = "< Select PIO1's RX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_RX1: dreq_num_rp2350 = 13;
#[doc = "< Select PIO1's RX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_RX2: dreq_num_rp2350 = 14;
#[doc = "< Select PIO1's RX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO1_RX3: dreq_num_rp2350 = 15;
#[doc = "< Select PIO2's TX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_TX0: dreq_num_rp2350 = 16;
#[doc = "< Select PIO2's TX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_TX1: dreq_num_rp2350 = 17;
#[doc = "< Select PIO2's TX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_TX2: dreq_num_rp2350 = 18;
#[doc = "< Select PIO2's TX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_TX3: dreq_num_rp2350 = 19;
#[doc = "< Select PIO2's RX FIFO 0 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_RX0: dreq_num_rp2350 = 20;
#[doc = "< Select PIO2's RX FIFO 1 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_RX1: dreq_num_rp2350 = 21;
#[doc = "< Select PIO2's RX FIFO 2 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_RX2: dreq_num_rp2350 = 22;
#[doc = "< Select PIO2's RX FIFO 3 as DREQ"]
pub const dreq_num_rp2350_DREQ_PIO2_RX3: dreq_num_rp2350 = 23;
#[doc = "< Select SPI0's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_SPI0_TX: dreq_num_rp2350 = 24;
#[doc = "< Select SPI0's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_SPI0_RX: dreq_num_rp2350 = 25;
#[doc = "< Select SPI1's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_SPI1_TX: dreq_num_rp2350 = 26;
#[doc = "< Select SPI1's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_SPI1_RX: dreq_num_rp2350 = 27;
#[doc = "< Select UART0's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_UART0_TX: dreq_num_rp2350 = 28;
#[doc = "< Select UART0's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_UART0_RX: dreq_num_rp2350 = 29;
#[doc = "< Select UART1's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_UART1_TX: dreq_num_rp2350 = 30;
#[doc = "< Select UART1's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_UART1_RX: dreq_num_rp2350 = 31;
#[doc = "< Select PWM Counter 0's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP0: dreq_num_rp2350 = 32;
#[doc = "< Select PWM Counter 1's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP1: dreq_num_rp2350 = 33;
#[doc = "< Select PWM Counter 2's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP2: dreq_num_rp2350 = 34;
#[doc = "< Select PWM Counter 3's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP3: dreq_num_rp2350 = 35;
#[doc = "< Select PWM Counter 4's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP4: dreq_num_rp2350 = 36;
#[doc = "< Select PWM Counter 5's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP5: dreq_num_rp2350 = 37;
#[doc = "< Select PWM Counter 6's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP6: dreq_num_rp2350 = 38;
#[doc = "< Select PWM Counter 7's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP7: dreq_num_rp2350 = 39;
#[doc = "< Select PWM Counter 8's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP8: dreq_num_rp2350 = 40;
#[doc = "< Select PWM Counter 9's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP9: dreq_num_rp2350 = 41;
#[doc = "< Select PWM Counter 10's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP10: dreq_num_rp2350 = 42;
#[doc = "< Select PWM Counter 11's Wrap Value as DREQ"]
pub const dreq_num_rp2350_DREQ_PWM_WRAP11: dreq_num_rp2350 = 43;
#[doc = "< Select I2C0's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_I2C0_TX: dreq_num_rp2350 = 44;
#[doc = "< Select I2C0's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_I2C0_RX: dreq_num_rp2350 = 45;
#[doc = "< Select I2C1's TX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_I2C1_TX: dreq_num_rp2350 = 46;
#[doc = "< Select I2C1's RX FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_I2C1_RX: dreq_num_rp2350 = 47;
#[doc = "< Select the ADC as DREQ"]
pub const dreq_num_rp2350_DREQ_ADC: dreq_num_rp2350 = 48;
#[doc = "< Select the XIP Streaming FIFO as DREQ"]
pub const dreq_num_rp2350_DREQ_XIP_STREAM: dreq_num_rp2350 = 49;
#[doc = "< Select XIP_QMITX as DREQ"]
pub const dreq_num_rp2350_DREQ_XIP_QMITX: dreq_num_rp2350 = 50;
#[doc = "< Select XIP_QMIRX as DREQ"]
pub const dreq_num_rp2350_DREQ_XIP_QMIRX: dreq_num_rp2350 = 51;
#[doc = "< Select HSTX as DREQ"]
pub const dreq_num_rp2350_DREQ_HSTX: dreq_num_rp2350 = 52;
#[doc = "< Select CORESIGHT as DREQ"]
pub const dreq_num_rp2350_DREQ_CORESIGHT: dreq_num_rp2350 = 53;
#[doc = "< Select SHA256 as DREQ"]
pub const dreq_num_rp2350_DREQ_SHA256: dreq_num_rp2350 = 54;
#[doc = "< Select DMA_TIMER0 as DREQ"]
pub const dreq_num_rp2350_DREQ_DMA_TIMER0: dreq_num_rp2350 = 59;
#[doc = "< Select DMA_TIMER1 as DREQ"]
pub const dreq_num_rp2350_DREQ_DMA_TIMER1: dreq_num_rp2350 = 60;
#[doc = "< Select DMA_TIMER2 as DREQ"]
pub const dreq_num_rp2350_DREQ_DMA_TIMER2: dreq_num_rp2350 = 61;
#[doc = "< Select DMA_TIMER3 as DREQ"]
pub const dreq_num_rp2350_DREQ_DMA_TIMER3: dreq_num_rp2350 = 62;
#[doc = "< Select FORCE as DREQ"]
pub const dreq_num_rp2350_DREQ_FORCE: dreq_num_rp2350 = 63;
pub const dreq_num_rp2350_DREQ_COUNT: dreq_num_rp2350 = 64;
#[doc = " \\brief DREQ numbers for DMA pacing on RP2350 (used as typedef \\ref dreq_num_t)\n \\ingroup hardware_dma"]
pub type dreq_num_rp2350 = cty::c_uint;
#[doc = " \\brief DREQ numbers for DMA pacing on RP2350 (used as typedef \\ref dreq_num_t)\n \\ingroup hardware_dma"]
pub use self::dreq_num_rp2350 as dreq_num_t;
#[doc = "< Select ADC to be reset"]
pub const reset_num_rp2350_RESET_ADC: reset_num_rp2350 = 0;
#[doc = "< Select BUSCTRL to be reset"]
pub const reset_num_rp2350_RESET_BUSCTRL: reset_num_rp2350 = 1;
#[doc = "< Select DMA to be reset"]
pub const reset_num_rp2350_RESET_DMA: reset_num_rp2350 = 2;
#[doc = "< Select HSTX to be reset"]
pub const reset_num_rp2350_RESET_HSTX: reset_num_rp2350 = 3;
#[doc = "< Select I2C0 to be reset"]
pub const reset_num_rp2350_RESET_I2C0: reset_num_rp2350 = 4;
#[doc = "< Select I2C1 to be reset"]
pub const reset_num_rp2350_RESET_I2C1: reset_num_rp2350 = 5;
#[doc = "< Select IO_BANK0 to be reset"]
pub const reset_num_rp2350_RESET_IO_BANK0: reset_num_rp2350 = 6;
#[doc = "< Select IO_QSPI to be reset"]
pub const reset_num_rp2350_RESET_IO_QSPI: reset_num_rp2350 = 7;
#[doc = "< Select JTAG to be reset"]
pub const reset_num_rp2350_RESET_JTAG: reset_num_rp2350 = 8;
#[doc = "< Select PADS_BANK0 to be reset"]
pub const reset_num_rp2350_RESET_PADS_BANK0: reset_num_rp2350 = 9;
#[doc = "< Select PADS_QSPI to be reset"]
pub const reset_num_rp2350_RESET_PADS_QSPI: reset_num_rp2350 = 10;
#[doc = "< Select PIO0 to be reset"]
pub const reset_num_rp2350_RESET_PIO0: reset_num_rp2350 = 11;
#[doc = "< Select PIO1 to be reset"]
pub const reset_num_rp2350_RESET_PIO1: reset_num_rp2350 = 12;
#[doc = "< Select PIO2 to be reset"]
pub const reset_num_rp2350_RESET_PIO2: reset_num_rp2350 = 13;
#[doc = "< Select PLL_SYS to be reset"]
pub const reset_num_rp2350_RESET_PLL_SYS: reset_num_rp2350 = 14;
#[doc = "< Select PLL_USB to be reset"]
pub const reset_num_rp2350_RESET_PLL_USB: reset_num_rp2350 = 15;
#[doc = "< Select PWM to be reset"]
pub const reset_num_rp2350_RESET_PWM: reset_num_rp2350 = 16;
#[doc = "< Select SHA256 to be reset"]
pub const reset_num_rp2350_RESET_SHA256: reset_num_rp2350 = 17;
#[doc = "< Select SPI0 to be reset"]
pub const reset_num_rp2350_RESET_SPI0: reset_num_rp2350 = 18;
#[doc = "< Select SPI1 to be reset"]
pub const reset_num_rp2350_RESET_SPI1: reset_num_rp2350 = 19;
#[doc = "< Select SYSCFG to be reset"]
pub const reset_num_rp2350_RESET_SYSCFG: reset_num_rp2350 = 20;
#[doc = "< Select SYSINFO to be reset"]
pub const reset_num_rp2350_RESET_SYSINFO: reset_num_rp2350 = 21;
#[doc = "< Select TBMAN to be reset"]
pub const reset_num_rp2350_RESET_TBMAN: reset_num_rp2350 = 22;
#[doc = "< Select TIMER0 to be reset"]
pub const reset_num_rp2350_RESET_TIMER0: reset_num_rp2350 = 23;
#[doc = "< Select TIMER1 to be reset"]
pub const reset_num_rp2350_RESET_TIMER1: reset_num_rp2350 = 24;
#[doc = "< Select TRNG to be reset"]
pub const reset_num_rp2350_RESET_TRNG: reset_num_rp2350 = 25;
#[doc = "< Select UART0 to be reset"]
pub const reset_num_rp2350_RESET_UART0: reset_num_rp2350 = 26;
#[doc = "< Select UART1 to be reset"]
pub const reset_num_rp2350_RESET_UART1: reset_num_rp2350 = 27;
#[doc = "< Select USBCTRL to be reset"]
pub const reset_num_rp2350_RESET_USBCTRL: reset_num_rp2350 = 28;
pub const reset_num_rp2350_RESET_COUNT: reset_num_rp2350 = 29;
#[doc = " \\brief Resettable component numbers on RP2350 (used as typedef \\ref reset_num_t)\n  \\ingroup hardware_resets"]
pub type reset_num_rp2350 = cty::c_uint;
#[doc = " \\brief Resettable component numbers on RP2350 (used as typedef \\ref reset_num_t)\n  \\ingroup hardware_resets"]
pub use self::reset_num_rp2350 as reset_num_t;
#[doc = " \\tag::resets_hw[]"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct resets_hw_t {
    pub reset: io_rw_32,
    pub wdsel: io_rw_32,
    pub reset_done: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of resets_hw_t"][::core::mem::size_of::<resets_hw_t>() - 12usize];
    ["Alignment of resets_hw_t"][::core::mem::align_of::<resets_hw_t>() - 4usize];
    ["Offset of field: resets_hw_t::reset"][::core::mem::offset_of!(resets_hw_t, reset) - 0usize];
    ["Offset of field: resets_hw_t::wdsel"][::core::mem::offset_of!(resets_hw_t, wdsel) - 4usize];
    ["Offset of field: resets_hw_t::reset_done"]
        [::core::mem::offset_of!(resets_hw_t, reset_done) - 8usize];
};
pub const uart_parity_t_UART_PARITY_NONE: uart_parity_t = 0;
pub const uart_parity_t_UART_PARITY_EVEN: uart_parity_t = 1;
pub const uart_parity_t_UART_PARITY_ODD: uart_parity_t = 2;
#[doc = " \\brief UART Parity enumeration\n  \\ingroup hardware_uart"]
pub type uart_parity_t = cty::c_uint;
unsafe extern "C" {
    #[doc = " \\brief Initialise a UART\n  \\ingroup hardware_uart\n\n Put the UART into a known state, and enable it. Must be called before other\n functions.\n\n This function always enables the FIFOs, and configures the UART for the\n following default line format:\n\n - 8 data bits\n - No parity bit\n - One stop bit\n\n \\note There is no guarantee that the baudrate requested will be possible, the nearest will be chosen,\n and this function will return the configured baud rate.\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param baudrate Baudrate of UART in Hz\n \\return Actual set baudrate"]
    pub fn uart_init(uart: *mut uart_inst_t, baudrate: uint) -> uint;
}
unsafe extern "C" {
    #[doc = " \\brief DeInitialise a UART\n  \\ingroup hardware_uart\n\n Disable the UART if it is no longer used. Must be reinitialised before\n being used again.\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1"]
    pub fn uart_deinit(uart: *mut uart_inst_t);
}
unsafe extern "C" {
    #[doc = " \\brief Set UART baud rate\n  \\ingroup hardware_uart\n\n Set baud rate as close as possible to requested, and return actual rate selected.\n\n The UART is paused for around two character periods whilst the settings are\n changed. Data received during this time may be dropped by the UART.\n\n Any characters still in the transmit buffer will be sent using the new\n updated baud rate. uart_tx_wait_blocking() can be called before this\n function to ensure all characters at the old baud rate have been sent\n before the rate is changed.\n\n This function should not be called from an interrupt context, and the UART\n interrupt should be disabled before calling this function.\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param baudrate Baudrate in Hz\n \\return Actual set baudrate"]
    pub fn uart_set_baudrate(uart: *mut uart_inst_t, baudrate: uint) -> uint;
}
unsafe extern "C" {
    #[doc = " \\brief Set UART data format\n  \\ingroup hardware_uart\n\n Configure the data format (bits etc) for the UART.\n\n The UART is paused for around two character periods whilst the settings are\n changed. Data received during this time may be dropped by the UART.\n\n Any characters still in the transmit buffer will be sent using the new\n updated data format. uart_tx_wait_blocking() can be called before this\n function to ensure all characters needing the old format have been sent\n before the format is changed.\n\n This function should not be called from an interrupt context, and the UART\n interrupt should be disabled before calling this function.\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param data_bits Number of bits of data. 5..8\n \\param stop_bits Number of stop bits 1..2\n \\param parity Parity option."]
    pub fn uart_set_format(
        uart: *mut uart_inst_t,
        data_bits: uint,
        stop_bits: uint,
        parity: uart_parity_t,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Enable/Disable the FIFOs on specified UART\n  \\ingroup hardware_uart\n\n The UART is paused for around two character periods whilst the settings are\n changed. Data received during this time may be dropped by the UART.\n\n Any characters still in the transmit FIFO will be lost if the FIFO is\n disabled. uart_tx_wait_blocking() can be called before this\n function to avoid this.\n\n This function should not be called from an interrupt context, and the UART\n interrupt should be disabled when calling this function.\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param enabled true to enable FIFO (default), false to disable"]
    pub fn uart_set_fifo_enabled(uart: *mut uart_inst_t, enabled: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Assert a break condition on the UART transmission.\n  \\ingroup hardware_uart\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param en Assert break condition (TX held low) if true. Clear break condition if false."]
    pub fn uart_set_break(uart: *mut uart_inst_t, en: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Set CR/LF conversion on UART\n  \\ingroup hardware_uart\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param translate If true, convert line feeds to carriage return on transmissions"]
    pub fn uart_set_translate_crlf(uart: *mut uart_inst_t, translate: bool);
}
unsafe extern "C" {
    #[doc = " \\brief Wait for up to a certain number of microseconds for the RX FIFO to be non empty\n  \\ingroup hardware_uart\n\n \\param uart UART instance. \\ref uart0 or \\ref uart1\n \\param us the number of microseconds to wait at most (may be 0 for an instantaneous check)\n \\return true if the RX FIFO became non empty before the timeout, false otherwise"]
    pub fn uart_is_readable_within_us(uart: *mut uart_inst_t, us: u32) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Set up the default UART and assign it to the default GPIOs\n  \\ingroup pico_stdlib\n\n By default this will use UART 0, with TX to pin GPIO 0,\n RX to pin GPIO 1, and the baudrate to 115200\n\n Calling this method also initializes stdin/stdout over UART if the\n @ref pico_stdio_uart library is linked.\n\n Defaults can be changed using configuration defines,\n  PICO_DEFAULT_UART_INSTANCE,\n  PICO_DEFAULT_UART_BAUD_RATE\n  PICO_DEFAULT_UART_TX_PIN\n  PICO_DEFAULT_UART_RX_PIN"]
    pub fn setup_default_uart();
}
#[doc = "< Select CLK_GPOUT0 as clock source"]
pub const clock_num_rp2350_clk_gpout0: clock_num_rp2350 = 0;
#[doc = "< Select CLK_GPOUT1 as clock source"]
pub const clock_num_rp2350_clk_gpout1: clock_num_rp2350 = 1;
#[doc = "< Select CLK_GPOUT2 as clock source"]
pub const clock_num_rp2350_clk_gpout2: clock_num_rp2350 = 2;
#[doc = "< Select CLK_GPOUT3 as clock source"]
pub const clock_num_rp2350_clk_gpout3: clock_num_rp2350 = 3;
#[doc = "< Select CLK_REF as clock source"]
pub const clock_num_rp2350_clk_ref: clock_num_rp2350 = 4;
#[doc = "< Select CLK_SYS as clock source"]
pub const clock_num_rp2350_clk_sys: clock_num_rp2350 = 5;
#[doc = "< Select CLK_PERI as clock source"]
pub const clock_num_rp2350_clk_peri: clock_num_rp2350 = 6;
#[doc = "< Select CLK_HSTX as clock source"]
pub const clock_num_rp2350_clk_hstx: clock_num_rp2350 = 7;
#[doc = "< Select CLK_USB as clock source"]
pub const clock_num_rp2350_clk_usb: clock_num_rp2350 = 8;
#[doc = "< Select CLK_ADC as clock source"]
pub const clock_num_rp2350_clk_adc: clock_num_rp2350 = 9;
pub const clock_num_rp2350_CLK_COUNT: clock_num_rp2350 = 10;
#[doc = " \\brief Clock numbers on RP2350 (used as typedef \\ref clock_num_t)\n  \\ingroup hardware_clocks\n/\n/// \\tag::clkenum[]"]
pub type clock_num_rp2350 = cty::c_uint;
#[doc = " \\brief Clock numbers on RP2350 (used as typedef \\ref clock_num_t)\n  \\ingroup hardware_clocks\n/\n/// \\tag::clkenum[]"]
pub use self::clock_num_rp2350 as clock_num_t;
#[doc = "< Select SYS_CLOCKS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_CLOCKS: clock_dest_num_rp2350 = 0;
#[doc = "< Select SYS_ACCESSCTRL as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_ACCESSCTRL: clock_dest_num_rp2350 = 1;
#[doc = "< Select ADC as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_ADC: clock_dest_num_rp2350 = 2;
#[doc = "< Select SYS_ADC as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_ADC: clock_dest_num_rp2350 = 3;
#[doc = "< Select SYS_BOOTRAM as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_BOOTRAM: clock_dest_num_rp2350 = 4;
#[doc = "< Select SYS_BUSCTRL as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_BUSCTRL: clock_dest_num_rp2350 = 5;
#[doc = "< Select SYS_BUSFABRIC as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_BUSFABRIC: clock_dest_num_rp2350 = 6;
#[doc = "< Select SYS_DMA as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_DMA: clock_dest_num_rp2350 = 7;
#[doc = "< Select SYS_GLITCH_DETECTOR as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_GLITCH_DETECTOR: clock_dest_num_rp2350 = 8;
#[doc = "< Select HSTX as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_HSTX: clock_dest_num_rp2350 = 9;
#[doc = "< Select SYS_HSTX as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_HSTX: clock_dest_num_rp2350 = 10;
#[doc = "< Select SYS_I2C0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_I2C0: clock_dest_num_rp2350 = 11;
#[doc = "< Select SYS_I2C1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_I2C1: clock_dest_num_rp2350 = 12;
#[doc = "< Select SYS_IO as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_IO: clock_dest_num_rp2350 = 13;
#[doc = "< Select SYS_JTAG as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_JTAG: clock_dest_num_rp2350 = 14;
#[doc = "< Select REF_OTP as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_REF_OTP: clock_dest_num_rp2350 = 15;
#[doc = "< Select SYS_OTP as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_OTP: clock_dest_num_rp2350 = 16;
#[doc = "< Select SYS_PADS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PADS: clock_dest_num_rp2350 = 17;
#[doc = "< Select SYS_PIO0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PIO0: clock_dest_num_rp2350 = 18;
#[doc = "< Select SYS_PIO1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PIO1: clock_dest_num_rp2350 = 19;
#[doc = "< Select SYS_PIO2 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PIO2: clock_dest_num_rp2350 = 20;
#[doc = "< Select SYS_PLL_SYS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PLL_SYS: clock_dest_num_rp2350 = 21;
#[doc = "< Select SYS_PLL_USB as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PLL_USB: clock_dest_num_rp2350 = 22;
#[doc = "< Select REF_POWMAN as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_REF_POWMAN: clock_dest_num_rp2350 = 23;
#[doc = "< Select SYS_POWMAN as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_POWMAN: clock_dest_num_rp2350 = 24;
#[doc = "< Select SYS_PWM as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PWM: clock_dest_num_rp2350 = 25;
#[doc = "< Select SYS_RESETS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_RESETS: clock_dest_num_rp2350 = 26;
#[doc = "< Select SYS_ROM as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_ROM: clock_dest_num_rp2350 = 27;
#[doc = "< Select SYS_ROSC as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_ROSC: clock_dest_num_rp2350 = 28;
#[doc = "< Select SYS_PSM as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_PSM: clock_dest_num_rp2350 = 29;
#[doc = "< Select SYS_SHA256 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SHA256: clock_dest_num_rp2350 = 30;
#[doc = "< Select SYS_SIO as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SIO: clock_dest_num_rp2350 = 31;
#[doc = "< Select PERI_SPI0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_PERI_SPI0: clock_dest_num_rp2350 = 32;
#[doc = "< Select SYS_SPI0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SPI0: clock_dest_num_rp2350 = 33;
#[doc = "< Select PERI_SPI1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_PERI_SPI1: clock_dest_num_rp2350 = 34;
#[doc = "< Select SYS_SPI1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SPI1: clock_dest_num_rp2350 = 35;
#[doc = "< Select SYS_SRAM0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM0: clock_dest_num_rp2350 = 36;
#[doc = "< Select SYS_SRAM1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM1: clock_dest_num_rp2350 = 37;
#[doc = "< Select SYS_SRAM2 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM2: clock_dest_num_rp2350 = 38;
#[doc = "< Select SYS_SRAM3 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM3: clock_dest_num_rp2350 = 39;
#[doc = "< Select SYS_SRAM4 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM4: clock_dest_num_rp2350 = 40;
#[doc = "< Select SYS_SRAM5 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM5: clock_dest_num_rp2350 = 41;
#[doc = "< Select SYS_SRAM6 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM6: clock_dest_num_rp2350 = 42;
#[doc = "< Select SYS_SRAM7 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM7: clock_dest_num_rp2350 = 43;
#[doc = "< Select SYS_SRAM8 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM8: clock_dest_num_rp2350 = 44;
#[doc = "< Select SYS_SRAM9 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SRAM9: clock_dest_num_rp2350 = 45;
#[doc = "< Select SYS_SYSCFG as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SYSCFG: clock_dest_num_rp2350 = 46;
#[doc = "< Select SYS_SYSINFO as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_SYSINFO: clock_dest_num_rp2350 = 47;
#[doc = "< Select SYS_TBMAN as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_TBMAN: clock_dest_num_rp2350 = 48;
#[doc = "< Select REF_TICKS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_REF_TICKS: clock_dest_num_rp2350 = 49;
#[doc = "< Select SYS_TICKS as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_TICKS: clock_dest_num_rp2350 = 50;
#[doc = "< Select SYS_TIMER0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_TIMER0: clock_dest_num_rp2350 = 51;
#[doc = "< Select SYS_TIMER1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_TIMER1: clock_dest_num_rp2350 = 52;
#[doc = "< Select SYS_TRNG as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_TRNG: clock_dest_num_rp2350 = 53;
#[doc = "< Select PERI_UART0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_PERI_UART0: clock_dest_num_rp2350 = 54;
#[doc = "< Select SYS_UART0 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_UART0: clock_dest_num_rp2350 = 55;
#[doc = "< Select PERI_UART1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_PERI_UART1: clock_dest_num_rp2350 = 56;
#[doc = "< Select SYS_UART1 as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_UART1: clock_dest_num_rp2350 = 57;
#[doc = "< Select SYS_USBCTRL as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_USBCTRL: clock_dest_num_rp2350 = 58;
#[doc = "< Select USB as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_USB: clock_dest_num_rp2350 = 59;
#[doc = "< Select SYS_WATCHDOG as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_WATCHDOG: clock_dest_num_rp2350 = 60;
#[doc = "< Select SYS_XIP as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_XIP: clock_dest_num_rp2350 = 61;
#[doc = "< Select SYS_XOSC as clock destination"]
pub const clock_dest_num_rp2350_CLK_DEST_SYS_XOSC: clock_dest_num_rp2350 = 62;
pub const clock_dest_num_rp2350_NUM_CLOCK_DESTINATIONS: clock_dest_num_rp2350 = 63;
#[doc = " \\brief  Clock destination numbers on RP2350 (used as typedef \\ref clock_dest_num_t)\n  \\ingroup hardware_clocks"]
pub type clock_dest_num_rp2350 = cty::c_uint;
#[doc = " \\brief  Clock destination numbers on RP2350 (used as typedef \\ref clock_dest_num_t)\n  \\ingroup hardware_clocks"]
pub use self::clock_dest_num_rp2350 as clock_dest_num_t;
#[doc = " \\tag::clock_hw[]"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clock_hw_t {
    pub ctrl: io_rw_32,
    pub div: io_rw_32,
    pub selected: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clock_hw_t"][::core::mem::size_of::<clock_hw_t>() - 12usize];
    ["Alignment of clock_hw_t"][::core::mem::align_of::<clock_hw_t>() - 4usize];
    ["Offset of field: clock_hw_t::ctrl"][::core::mem::offset_of!(clock_hw_t, ctrl) - 0usize];
    ["Offset of field: clock_hw_t::div"][::core::mem::offset_of!(clock_hw_t, div) - 4usize];
    ["Offset of field: clock_hw_t::selected"]
        [::core::mem::offset_of!(clock_hw_t, selected) - 8usize];
};
#[doc = " \\end::clock_hw[]"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clock_resus_hw_t {
    pub ctrl: io_rw_32,
    pub status: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clock_resus_hw_t"][::core::mem::size_of::<clock_resus_hw_t>() - 8usize];
    ["Alignment of clock_resus_hw_t"][::core::mem::align_of::<clock_resus_hw_t>() - 4usize];
    ["Offset of field: clock_resus_hw_t::ctrl"]
        [::core::mem::offset_of!(clock_resus_hw_t, ctrl) - 0usize];
    ["Offset of field: clock_resus_hw_t::status"]
        [::core::mem::offset_of!(clock_resus_hw_t, status) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fc_hw_t {
    pub ref_khz: io_rw_32,
    pub min_khz: io_rw_32,
    pub max_khz: io_rw_32,
    pub delay: io_rw_32,
    pub interval: io_rw_32,
    pub src: io_rw_32,
    pub status: io_ro_32,
    pub result: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fc_hw_t"][::core::mem::size_of::<fc_hw_t>() - 32usize];
    ["Alignment of fc_hw_t"][::core::mem::align_of::<fc_hw_t>() - 4usize];
    ["Offset of field: fc_hw_t::ref_khz"][::core::mem::offset_of!(fc_hw_t, ref_khz) - 0usize];
    ["Offset of field: fc_hw_t::min_khz"][::core::mem::offset_of!(fc_hw_t, min_khz) - 4usize];
    ["Offset of field: fc_hw_t::max_khz"][::core::mem::offset_of!(fc_hw_t, max_khz) - 8usize];
    ["Offset of field: fc_hw_t::delay"][::core::mem::offset_of!(fc_hw_t, delay) - 12usize];
    ["Offset of field: fc_hw_t::interval"][::core::mem::offset_of!(fc_hw_t, interval) - 16usize];
    ["Offset of field: fc_hw_t::src"][::core::mem::offset_of!(fc_hw_t, src) - 20usize];
    ["Offset of field: fc_hw_t::status"][::core::mem::offset_of!(fc_hw_t, status) - 24usize];
    ["Offset of field: fc_hw_t::result"][::core::mem::offset_of!(fc_hw_t, result) - 28usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct clocks_hw_t {
    pub clk: [clock_hw_t; 10usize],
    pub dftclk_xosc_ctrl: io_rw_32,
    pub dftclk_rosc_ctrl: io_rw_32,
    pub dftclk_lposc_ctrl: io_rw_32,
    pub resus: clock_resus_hw_t,
    pub fc0: fc_hw_t,
    pub __bindgen_anon_1: clocks_hw_t__bindgen_ty_1,
    pub __bindgen_anon_2: clocks_hw_t__bindgen_ty_2,
    pub __bindgen_anon_3: clocks_hw_t__bindgen_ty_3,
    pub intr: io_ro_32,
    pub inte: io_rw_32,
    pub intf: io_rw_32,
    pub ints: io_ro_32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union clocks_hw_t__bindgen_ty_1 {
    pub __bindgen_anon_1: clocks_hw_t__bindgen_ty_1__bindgen_ty_1,
    pub wake_en: [io_rw_32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clocks_hw_t__bindgen_ty_1__bindgen_ty_1 {
    pub wake_en0: io_rw_32,
    pub wake_en1: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_1__bindgen_ty_1::wake_en0"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_1__bindgen_ty_1, wake_en0) - 0usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_1__bindgen_ty_1::wake_en1"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_1__bindgen_ty_1, wake_en1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_1"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_1>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_1"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_1::wake_en"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_1, wake_en) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union clocks_hw_t__bindgen_ty_2 {
    pub __bindgen_anon_1: clocks_hw_t__bindgen_ty_2__bindgen_ty_1,
    pub sleep_en: [io_rw_32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clocks_hw_t__bindgen_ty_2__bindgen_ty_1 {
    pub sleep_en0: io_rw_32,
    pub sleep_en1: io_rw_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_2__bindgen_ty_1::sleep_en0"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_2__bindgen_ty_1, sleep_en0) - 0usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_2__bindgen_ty_1::sleep_en1"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_2__bindgen_ty_1, sleep_en1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_2"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_2>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_2"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_2>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_2::sleep_en"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_2, sleep_en) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union clocks_hw_t__bindgen_ty_3 {
    pub __bindgen_anon_1: clocks_hw_t__bindgen_ty_3__bindgen_ty_1,
    pub enabled: [io_ro_32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clocks_hw_t__bindgen_ty_3__bindgen_ty_1 {
    pub enabled0: io_ro_32,
    pub enabled1: io_ro_32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_3__bindgen_ty_1>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_3__bindgen_ty_1>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_3__bindgen_ty_1::enabled0"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_3__bindgen_ty_1, enabled0) - 0usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_3__bindgen_ty_1::enabled1"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_3__bindgen_ty_1, enabled1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t__bindgen_ty_3"]
        [::core::mem::size_of::<clocks_hw_t__bindgen_ty_3>() - 8usize];
    ["Alignment of clocks_hw_t__bindgen_ty_3"]
        [::core::mem::align_of::<clocks_hw_t__bindgen_ty_3>() - 4usize];
    ["Offset of field: clocks_hw_t__bindgen_ty_3::enabled"]
        [::core::mem::offset_of!(clocks_hw_t__bindgen_ty_3, enabled) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clocks_hw_t"][::core::mem::size_of::<clocks_hw_t>() - 212usize];
    ["Alignment of clocks_hw_t"][::core::mem::align_of::<clocks_hw_t>() - 4usize];
    ["Offset of field: clocks_hw_t::clk"][::core::mem::offset_of!(clocks_hw_t, clk) - 0usize];
    ["Offset of field: clocks_hw_t::dftclk_xosc_ctrl"]
        [::core::mem::offset_of!(clocks_hw_t, dftclk_xosc_ctrl) - 120usize];
    ["Offset of field: clocks_hw_t::dftclk_rosc_ctrl"]
        [::core::mem::offset_of!(clocks_hw_t, dftclk_rosc_ctrl) - 124usize];
    ["Offset of field: clocks_hw_t::dftclk_lposc_ctrl"]
        [::core::mem::offset_of!(clocks_hw_t, dftclk_lposc_ctrl) - 128usize];
    ["Offset of field: clocks_hw_t::resus"][::core::mem::offset_of!(clocks_hw_t, resus) - 132usize];
    ["Offset of field: clocks_hw_t::fc0"][::core::mem::offset_of!(clocks_hw_t, fc0) - 140usize];
    ["Offset of field: clocks_hw_t::intr"][::core::mem::offset_of!(clocks_hw_t, intr) - 196usize];
    ["Offset of field: clocks_hw_t::inte"][::core::mem::offset_of!(clocks_hw_t, inte) - 200usize];
    ["Offset of field: clocks_hw_t::intf"][::core::mem::offset_of!(clocks_hw_t, intf) - 204usize];
    ["Offset of field: clocks_hw_t::ints"][::core::mem::offset_of!(clocks_hw_t, ints) - 208usize];
};
#[doc = " \\brief Clock numbers on RP2350 (used as typedef \\ref clock_num_t)\n  \\ingroup hardware_clocks\n/\n/// \\tag::clkenum[]"]
pub use self::clock_num_t as clock_handle_t;
unsafe extern "C" {
    #[doc = " \\brief Configure the specified clock with automatic clock divisor setup\n  \\ingroup hardware_clocks\n\n This method allows both the src_frequency of the input clock source AND the desired\n frequency to be specified, and will set the clock divider to achieve the exact or higher frequency\n achievable, with the maximum being the src_freq.\n\n \\if rp2350_specific\n Note: The RP2350 clock hardware supports divisors from 1.0->65536.0 in steps of 1/65536\n\n \\endif\n \\if rp2040_specific\n Note: The RP2040 clock hardware only supports divisors of exactly 1.0 or 2.0->16777216.0 in steps of 1/256\n \\endif\n\n See the tables in the description for details on the possible values for clock sources.\n\n \\param clock The clock to configure\n \\param src The main clock source, can be 0.\n \\param auxsrc The auxiliary clock source, which depends on which clock is being set. Can be 0\n \\param src_freq Frequency of the input clock source\n \\param freq Requested frequency\n \\return true if the clock is updated, false if freq > src_freq"]
    pub fn clock_configure(
        clock: clock_handle_t,
        src: u32,
        auxsrc: u32,
        src_freq: u32,
        freq: u32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Configure the specified clock to use the undivided input source\n  \\ingroup hardware_clocks\n\n See the tables in the description for details on the possible values for clock sources.\n\n \\param clock The clock to configure\n \\param src The main clock source, can be 0.\n \\param auxsrc The auxiliary clock source, which depends on which clock is being set. Can be 0\n \\param src_freq Frequency of the input clock source"]
    pub fn clock_configure_undivided(clock: clock_handle_t, src: u32, auxsrc: u32, src_freq: u32);
}
unsafe extern "C" {
    #[doc = " \\brief Configure the specified clock to use the undivided input source\n  \\ingroup hardware_clocks\n\n See the tables in the description for details on the possible values for clock sources.\n\n \\param clock The clock to configure\n \\param src The main clock source, can be 0.\n \\param auxsrc The auxiliary clock source, which depends on which clock is being set. Can be 0\n \\param src_freq Frequency of the input clock source\n \\param int_divider an integer divider"]
    pub fn clock_configure_int_divider(
        clock: clock_handle_t,
        src: u32,
        auxsrc: u32,
        src_freq: u32,
        int_divider: u32,
    );
}
unsafe extern "C" {
    #[doc = " \\brief Stop the specified clock\n  \\ingroup hardware_clocks\n\n \\param clock The clock to stop"]
    pub fn clock_stop(clock: clock_handle_t);
}
unsafe extern "C" {
    #[doc = " \\brief Get the current frequency of the specified clock\n  \\ingroup hardware_clocks\n\n \\param clock Clock\n \\return Clock frequency in Hz"]
    pub fn clock_get_hz(clock: clock_handle_t) -> u32;
}
unsafe extern "C" {
    #[doc = " \\brief Measure a clocks frequency using the Frequency counter.\n  \\ingroup hardware_clocks\n\n Uses the inbuilt frequency counter to measure the specified clocks frequency.\n Currently, this function is accurate to +-1KHz. See the datasheet for more details."]
    pub fn frequency_count_khz(src: uint) -> u32;
}
unsafe extern "C" {
    #[doc = " \\brief Set the \"current frequency\" of the clock as reported by clock_get_hz without actually changing the clock\n  \\ingroup hardware_clocks\n\n \\see clock_get_hz()"]
    pub fn clock_set_reported_hz(clock: clock_handle_t, hz: uint);
}
#[doc = " \\brief Resus callback function type.\n  \\ingroup hardware_clocks\n\n User provided callback for a resus event (when clk_sys is stopped by the programmer and is restarted for them)."]
pub type resus_callback_t = ::core::option::Option<unsafe extern "C" fn()>;
unsafe extern "C" {
    #[doc = " \\brief Enable the resus function. Restarts clk_sys if it is accidentally stopped.\n  \\ingroup hardware_clocks\n\n The resuscitate function will restart the system clock if it falls below a certain speed (or stops). This\n could happen if the clock source the system clock is running from stops. For example if a PLL is stopped.\n\n \\param resus_callback a function pointer provided by the user to call if a resus event happens."]
    pub fn clocks_enable_resus(resus_callback: resus_callback_t);
}
unsafe extern "C" {
    #[doc = " \\brief Output an optionally divided clock to the specified gpio pin.\n  \\ingroup hardware_clocks\n\n \\if rp2040_specific\n On RP2040 valid GPIOs are 21, 23, 24, 25.\n These GPIOs are connected to the GPOUT0-3 clock generators.\n \\endif\n \\if rp2350_specific\n On RP2350 valid GPIOs are 13, 15, 21, 23, 24, 25.\n GPIOs 13 and 21 are connected to the GPOUT0 clock generator.\n GPIOs 15 and 23 are connected to the GPOUT1 clock generator.\n GPIOs 24 and 25 are connected to the GPOUT2-3 clock generators.\n \\endif\n\n \\param gpio The GPIO pin to output the clock to.\n \\param src  The source clock. See the register field CLOCKS_CLK_GPOUT0_CTRL_AUXSRC for a full list. The list is the same for each GPOUT clock generator.\n \\param div_int  The integer part of the value to divide the source clock by. This is useful to not overwhelm the GPIO pin with a fast clock. This is in range of 1..2^24-1 on RP2040\n                 and 1..2^16-1 on RP2350\n \\param div_frac16 The fractional part of the value to divide the source clock by. This is in range of 0..65535 (/65536)."]
    pub fn clock_gpio_init_int_frac16(gpio: uint, src: uint, div_int: u32, div_frac16: u16);
}
unsafe extern "C" {
    #[doc = " \\brief Configure a clock to come from a gpio input\n  \\ingroup hardware_clocks\n\n \\param clock The clock to configure\n \\param gpio The GPIO pin to run the clock from. Valid GPIOs are: 20 and 22.\n \\param src_freq Frequency of the input clock source\n \\param freq Requested frequency"]
    pub fn clock_configure_gpin(
        clock: clock_handle_t,
        gpio: uint,
        src_freq: u32,
        freq: u32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Initialise the system clock to 48MHz\n  \\ingroup hardware_clocks\n\n  Set the system clock to 48MHz, and set the peripheral clock to match."]
    pub fn set_sys_clock_48mhz();
}
unsafe extern "C" {
    #[doc = " \\brief Initialise the system clock\n  \\ingroup hardware_clocks\n\n \\param vco_freq The voltage controller oscillator frequency to be used by the SYS PLL\n \\param post_div1 The first post divider for the SYS PLL\n \\param post_div2 The second post divider for the SYS PLL.\n\n See the PLL documentation in the datasheet for details of driving the PLLs."]
    pub fn set_sys_clock_pll(vco_freq: u32, post_div1: uint, post_div2: uint);
}
unsafe extern "C" {
    #[doc = " \\brief Check if a given system clock frequency is valid/attainable\n  \\ingroup hardware_clocks\n\n \\param freq_hz Requested frequency\n \\param vco_freq_out On success, the voltage controlled oscillator frequency to be used by the SYS PLL\n \\param post_div1_out On success, The first post divider for the SYS PLL\n \\param post_div2_out On success, The second post divider for the SYS PLL.\n @return true if the frequency is possible and the output parameters have been written."]
    pub fn check_sys_clock_hz(
        freq_hz: u32,
        vco_freq_out: *mut uint,
        post_div1_out: *mut uint,
        post_div2_out: *mut uint,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " \\brief Check if a given system clock frequency is valid/attainable\n  \\ingroup hardware_clocks\n\n \\param freq_khz Requested frequency\n \\param vco_freq_out On success, the voltage controlled oscillator frequency to be used by the SYS PLL\n \\param post_div1_out On success, The first post divider for the SYS PLL\n \\param post_div2_out On success, The second post divider for the SYS PLL.\n @return true if the frequency is possible and the output parameters have been written."]
    pub fn check_sys_clock_khz(
        freq_khz: u32,
        vco_freq_out: *mut uint,
        post_div1_out: *mut uint,
        post_div2_out: *mut uint,
    ) -> bool;
}
#[doc = "      DEFINES"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _silence_gcc_warning {
    _unused: [u8; 0],
}
pub const LV_RES_INV: _bindgen_ty_1 = 0;
pub const LV_RES_OK: _bindgen_ty_1 = 1;
#[doc = " LVGL error codes."]
pub type _bindgen_ty_1 = cty::c_uint;
pub type lv_res_t = u8;
pub type lv_uintptr_t = usize;
pub type lv_log_level_t = i8;
unsafe extern "C" {
    #[doc = " You have to call this function periodically\n @param tick_period the call period of this function in milliseconds"]
    pub fn lv_tick_inc(tick_period: u32);
}
unsafe extern "C" {
    #[doc = " Get the elapsed milliseconds since start up\n @return the elapsed milliseconds"]
    pub fn lv_tick_get() -> u32;
}
unsafe extern "C" {
    #[doc = " Get the elapsed milliseconds since a previous time stamp\n @param prev_tick a previous time stamp (return value of lv_tick_get() )\n @return the elapsed milliseconds since 'prev_tick'"]
    pub fn lv_tick_elaps(prev_tick: u32) -> u32;
}
#[doc = " Timers execute this type of functions."]
pub type lv_timer_cb_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_timer_t)>;
#[doc = "      TYPEDEFS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lv_timer_t {
    #[doc = "< How often the timer should run"]
    pub period: u32,
    #[doc = "< Last time the timer ran"]
    pub last_run: u32,
    #[doc = "< Timer function"]
    pub timer_cb: lv_timer_cb_t,
    #[doc = "< Custom user data"]
    pub user_data: *mut cty::c_void,
    #[doc = "< 1: One time;  -1 : infinity;  n>0: residual times"]
    pub repeat_count: i32,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lv_timer_t"][::core::mem::size_of::<_lv_timer_t>() - 24usize];
    ["Alignment of _lv_timer_t"][::core::mem::align_of::<_lv_timer_t>() - 4usize];
    ["Offset of field: _lv_timer_t::period"][::core::mem::offset_of!(_lv_timer_t, period) - 0usize];
    ["Offset of field: _lv_timer_t::last_run"]
        [::core::mem::offset_of!(_lv_timer_t, last_run) - 4usize];
    ["Offset of field: _lv_timer_t::timer_cb"]
        [::core::mem::offset_of!(_lv_timer_t, timer_cb) - 8usize];
    ["Offset of field: _lv_timer_t::user_data"]
        [::core::mem::offset_of!(_lv_timer_t, user_data) - 12usize];
    ["Offset of field: _lv_timer_t::repeat_count"]
        [::core::mem::offset_of!(_lv_timer_t, repeat_count) - 16usize];
};
impl _lv_timer_t {
    #[inline]
    pub fn paused(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_paused(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn paused_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_paused_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(paused: u32) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let paused: u32 = unsafe { ::core::mem::transmute(paused) };
            paused as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Descriptor of a lv_timer"]
pub type lv_timer_t = _lv_timer_t;
unsafe extern "C" {
    #[doc = " Init the lv_timer module"]
    pub fn _lv_timer_core_init();
}
unsafe extern "C" {
    #[doc = " Call it periodically to handle lv_timers.\n @return time till it needs to be run next (in ms)"]
    pub fn lv_timer_handler() -> u32;
}
unsafe extern "C" {
    #[doc = " Create an \"empty\" timer. It needs to initialized with at least\n `lv_timer_set_cb` and `lv_timer_set_period`\n @return pointer to the created timer"]
    pub fn lv_timer_create_basic() -> *mut lv_timer_t;
}
unsafe extern "C" {
    #[doc = " Create a new lv_timer\n @param timer_xcb a callback to call periodically.\n                 (the 'x' in the argument name indicates that it's not a fully generic function because it not follows\n                  the `func_name(object, callback, ...)` convention)\n @param period call period in ms unit\n @param user_data custom parameter\n @return pointer to the new timer"]
    pub fn lv_timer_create(
        timer_xcb: lv_timer_cb_t,
        period: u32,
        user_data: *mut cty::c_void,
    ) -> *mut lv_timer_t;
}
unsafe extern "C" {
    #[doc = " Delete a lv_timer\n @param timer pointer to an lv_timer"]
    pub fn lv_timer_del(timer: *mut lv_timer_t);
}
unsafe extern "C" {
    #[doc = " Pause/resume a timer.\n @param timer pointer to an lv_timer"]
    pub fn lv_timer_pause(timer: *mut lv_timer_t);
}
unsafe extern "C" {
    pub fn lv_timer_resume(timer: *mut lv_timer_t);
}
unsafe extern "C" {
    #[doc = " Set the callback the timer (the function to call periodically)\n @param timer pointer to a timer\n @param timer_cb the function to call periodically"]
    pub fn lv_timer_set_cb(timer: *mut lv_timer_t, timer_cb: lv_timer_cb_t);
}
unsafe extern "C" {
    #[doc = " Set new period for a lv_timer\n @param timer pointer to a lv_timer\n @param period the new period"]
    pub fn lv_timer_set_period(timer: *mut lv_timer_t, period: u32);
}
unsafe extern "C" {
    #[doc = " Make a lv_timer ready. It will not wait its period.\n @param timer pointer to a lv_timer."]
    pub fn lv_timer_ready(timer: *mut lv_timer_t);
}
unsafe extern "C" {
    #[doc = " Set the number of times a timer will repeat.\n @param timer pointer to a lv_timer.\n @param repeat_count -1 : infinity;  0 : stop ;  n>0: residual times"]
    pub fn lv_timer_set_repeat_count(timer: *mut lv_timer_t, repeat_count: i32);
}
unsafe extern "C" {
    #[doc = " Reset a lv_timer.\n It will be called the previously set period milliseconds later.\n @param timer pointer to a lv_timer."]
    pub fn lv_timer_reset(timer: *mut lv_timer_t);
}
unsafe extern "C" {
    #[doc = " Enable or disable the whole lv_timer handling\n @param en true: lv_timer handling is running, false: lv_timer handling is suspended"]
    pub fn lv_timer_enable(en: bool);
}
unsafe extern "C" {
    #[doc = " Get idle percentage\n @return the lv_timer idle in percentage"]
    pub fn lv_timer_get_idle() -> u8;
}
unsafe extern "C" {
    #[doc = " Iterate through the timers\n @param timer NULL to start iteration or the previous return value to get the next timer\n @return the next timer or NULL if there is no more timer"]
    pub fn lv_timer_get_next(timer: *mut lv_timer_t) -> *mut lv_timer_t;
}
#[doc = "      TYPEDEFS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_sqrt_res_t {
    pub i: u16,
    pub f: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_sqrt_res_t"][::core::mem::size_of::<lv_sqrt_res_t>() - 4usize];
    ["Alignment of lv_sqrt_res_t"][::core::mem::align_of::<lv_sqrt_res_t>() - 2usize];
    ["Offset of field: lv_sqrt_res_t::i"][::core::mem::offset_of!(lv_sqrt_res_t, i) - 0usize];
    ["Offset of field: lv_sqrt_res_t::f"][::core::mem::offset_of!(lv_sqrt_res_t, f) - 2usize];
};
unsafe extern "C" {
    #[doc = "! @cond Doxygen_Suppress\n**\n* Return with sinus of an angle\n* @param angle\n* @return sinus of 'angle'. sin(-90) = -32767, sin(90) = 32767\n*/"]
    pub fn lv_trigo_sin(angle: i16) -> i16;
}
unsafe extern "C" {
    #[doc = " Calculate a value of a Cubic Bezier function.\n @param t time in range of [0..LV_BEZIER_VAL_MAX]\n @param u0 start values in range of [0..LV_BEZIER_VAL_MAX]\n @param u1 control value 1 values in range of [0..LV_BEZIER_VAL_MAX]\n @param u2 control value 2 in range of [0..LV_BEZIER_VAL_MAX]\n @param u3 end values in range of [0..LV_BEZIER_VAL_MAX]\n @return the value calculated from the given parameters in range of [0..LV_BEZIER_VAL_MAX]"]
    pub fn lv_bezier3(t: u32, u0: u32, u1: u32, u2: u32, u3: u32) -> u32;
}
unsafe extern "C" {
    #[doc = " Calculate the atan2 of a vector.\n @param x\n @param y\n @return the angle in degree calculated from the given parameters in range of [0..360]"]
    pub fn lv_atan2(x: cty::c_int, y: cty::c_int) -> u16;
}
unsafe extern "C" {
    #[doc = " Get the square root of a number\n @param x integer which square root should be calculated\n @param q store the result here. q->i: integer part, q->f: fractional part in 1/256 unit\n @param mask optional to skip some iterations if the magnitude of the root is known.\n Set to 0x8000 by default.\n If root < 16: mask = 0x80\n If root < 256: mask = 0x800\n Else: mask = 0x8000"]
    pub fn lv_sqrt(x: u32, q: *mut lv_sqrt_res_t, mask: u32);
}
unsafe extern "C" {
    #[doc = " Calculate the integer exponents.\n @param base\n @param power\n @return base raised to the power exponent"]
    pub fn lv_pow(base: i64, exp: i8) -> i64;
}
unsafe extern "C" {
    #[doc = " Get the mapped of a number given an input and output range\n @param x integer which mapped value should be calculated\n @param min_in min input range\n @param max_in max input range\n @param min_out max output range\n @param max_out max output range\n @return the mapped number"]
    pub fn lv_map(x: i32, min_in: i32, max_in: i32, min_out: i32, max_out: i32) -> i32;
}
unsafe extern "C" {
    #[doc = " Get a pseudo random number in the given range\n @param min   the minimum value\n @param max   the maximum value\n @return return the random number. min <= return_value <= max"]
    pub fn lv_rand(min: u32, max: u32) -> u32;
}
pub type wint_t = cty::c_int;
pub type __blkcnt_t = cty::c_long;
pub type __blksize_t = cty::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = cty::c_long;
pub type __pid_t = cty::c_int;
pub type __dev_t = cty::c_short;
pub type __uid_t = cty::c_ushort;
pub type __gid_t = cty::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = cty::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = cty::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = cty::c_long;
pub type _fpos_t = cty::c_long;
pub type __size_t = cty::c_uint;
pub type _ssize_t = cty::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: cty::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [cty::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t__bindgen_ty_1"]
        [::core::mem::size_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _mbstate_t__bindgen_ty_1"]
        [::core::mem::align_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wch"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wchb"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t"][::core::mem::size_of::<_mbstate_t>() - 8usize];
    ["Alignment of _mbstate_t"][::core::mem::align_of::<_mbstate_t>() - 4usize];
    ["Offset of field: _mbstate_t::__count"][::core::mem::offset_of!(_mbstate_t, __count) - 0usize];
    ["Offset of field: _mbstate_t::__value"][::core::mem::offset_of!(_mbstate_t, __value) - 4usize];
};
pub type _iconv_t = *mut cty::c_void;
pub type __clock_t = cty::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = cty::c_ulong;
pub type __daddr_t = cty::c_long;
pub type __timer_t = cty::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = cty::c_int;
pub type __nlink_t = cty::c_ushort;
pub type __suseconds_t = cty::c_long;
pub type __useconds_t = cty::c_ulong;
pub type __va_list = u32;
pub type __ULong = cty::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock {
    _unused: [u8; 0],
}
pub type _LOCK_T = *mut __lock;
unsafe extern "C" {
    pub fn __retarget_lock_init(lock: *mut _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_init_recursive(lock: *mut _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_close(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_close_recursive(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_acquire(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_acquire_recursive(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_try_acquire(lock: _LOCK_T) -> cty::c_int;
}
unsafe extern "C" {
    pub fn __retarget_lock_try_acquire_recursive(lock: _LOCK_T) -> cty::c_int;
}
unsafe extern "C" {
    pub fn __retarget_lock_release(lock: _LOCK_T);
}
unsafe extern "C" {
    pub fn __retarget_lock_release_recursive(lock: _LOCK_T);
}
pub type _flock_t = _LOCK_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: cty::c_int,
    pub _maxwds: cty::c_int,
    pub _sign: cty::c_int,
    pub _wds: cty::c_int,
    pub _x: [__ULong; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Bigint"][::core::mem::size_of::<_Bigint>() - 24usize];
    ["Alignment of _Bigint"][::core::mem::align_of::<_Bigint>() - 4usize];
    ["Offset of field: _Bigint::_next"][::core::mem::offset_of!(_Bigint, _next) - 0usize];
    ["Offset of field: _Bigint::_k"][::core::mem::offset_of!(_Bigint, _k) - 4usize];
    ["Offset of field: _Bigint::_maxwds"][::core::mem::offset_of!(_Bigint, _maxwds) - 8usize];
    ["Offset of field: _Bigint::_sign"][::core::mem::offset_of!(_Bigint, _sign) - 12usize];
    ["Offset of field: _Bigint::_wds"][::core::mem::offset_of!(_Bigint, _wds) - 16usize];
    ["Offset of field: _Bigint::_x"][::core::mem::offset_of!(_Bigint, _x) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: cty::c_int,
    pub __tm_min: cty::c_int,
    pub __tm_hour: cty::c_int,
    pub __tm_mday: cty::c_int,
    pub __tm_mon: cty::c_int,
    pub __tm_year: cty::c_int,
    pub __tm_wday: cty::c_int,
    pub __tm_yday: cty::c_int,
    pub __tm_isdst: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __tm"][::core::mem::size_of::<__tm>() - 36usize];
    ["Alignment of __tm"][::core::mem::align_of::<__tm>() - 4usize];
    ["Offset of field: __tm::__tm_sec"][::core::mem::offset_of!(__tm, __tm_sec) - 0usize];
    ["Offset of field: __tm::__tm_min"][::core::mem::offset_of!(__tm, __tm_min) - 4usize];
    ["Offset of field: __tm::__tm_hour"][::core::mem::offset_of!(__tm, __tm_hour) - 8usize];
    ["Offset of field: __tm::__tm_mday"][::core::mem::offset_of!(__tm, __tm_mday) - 12usize];
    ["Offset of field: __tm::__tm_mon"][::core::mem::offset_of!(__tm, __tm_mon) - 16usize];
    ["Offset of field: __tm::__tm_year"][::core::mem::offset_of!(__tm, __tm_year) - 20usize];
    ["Offset of field: __tm::__tm_wday"][::core::mem::offset_of!(__tm, __tm_wday) - 24usize];
    ["Offset of field: __tm::__tm_yday"][::core::mem::offset_of!(__tm, __tm_yday) - 28usize];
    ["Offset of field: __tm::__tm_isdst"][::core::mem::offset_of!(__tm, __tm_isdst) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut cty::c_void; 32usize],
    pub _dso_handle: [*mut cty::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _on_exit_args"][::core::mem::size_of::<_on_exit_args>() - 264usize];
    ["Alignment of _on_exit_args"][::core::mem::align_of::<_on_exit_args>() - 4usize];
    ["Offset of field: _on_exit_args::_fnargs"]
        [::core::mem::offset_of!(_on_exit_args, _fnargs) - 0usize];
    ["Offset of field: _on_exit_args::_dso_handle"]
        [::core::mem::offset_of!(_on_exit_args, _dso_handle) - 128usize];
    ["Offset of field: _on_exit_args::_fntypes"]
        [::core::mem::offset_of!(_on_exit_args, _fntypes) - 256usize];
    ["Offset of field: _on_exit_args::_is_cxa"]
        [::core::mem::offset_of!(_on_exit_args, _is_cxa) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: cty::c_int,
    pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _atexit"][::core::mem::size_of::<_atexit>() - 400usize];
    ["Alignment of _atexit"][::core::mem::align_of::<_atexit>() - 4usize];
    ["Offset of field: _atexit::_next"][::core::mem::offset_of!(_atexit, _next) - 0usize];
    ["Offset of field: _atexit::_ind"][::core::mem::offset_of!(_atexit, _ind) - 4usize];
    ["Offset of field: _atexit::_fns"][::core::mem::offset_of!(_atexit, _fns) - 8usize];
    ["Offset of field: _atexit::_on_exit_args"]
        [::core::mem::offset_of!(_atexit, _on_exit_args) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut cty::c_uchar,
    pub _size: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 8usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 4usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut cty::c_uchar,
    pub _r: cty::c_int,
    pub _w: cty::c_int,
    pub _flags: cty::c_short,
    pub _file: cty::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: cty::c_int,
    pub _cookie: *mut cty::c_void,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: *mut cty::c_char,
            arg4: cty::c_int,
        ) -> cty::c_int,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: *const cty::c_char,
            arg4: cty::c_int,
        ) -> cty::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut cty::c_void,
            arg3: _fpos_t,
            arg4: cty::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut cty::c_void) -> cty::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut cty::c_uchar,
    pub _ur: cty::c_int,
    pub _ubuf: [cty::c_uchar; 3usize],
    pub _nbuf: [cty::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: cty::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: cty::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 104usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 4usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 4usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 8usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 12usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 14usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 16usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 24usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 28usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 32usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 36usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 40usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 44usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 48usize];
    ["Offset of field: __sFILE::_up"][::core::mem::offset_of!(__sFILE, _up) - 56usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 60usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 64usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 67usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 68usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 76usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 80usize];
    ["Offset of field: __sFILE::_data"][::core::mem::offset_of!(__sFILE, _data) - 84usize];
    ["Offset of field: __sFILE::_lock"][::core::mem::offset_of!(__sFILE, _lock) - 88usize];
    ["Offset of field: __sFILE::_mbstate"][::core::mem::offset_of!(__sFILE, _mbstate) - 92usize];
    ["Offset of field: __sFILE::_flags2"][::core::mem::offset_of!(__sFILE, _flags2) - 100usize];
};
pub type __FILE = __sFILE;
unsafe extern "C" {
    pub static mut __sf: [__FILE; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: cty::c_int,
    pub _iobs: *mut __FILE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _glue"][::core::mem::size_of::<_glue>() - 12usize];
    ["Alignment of _glue"][::core::mem::align_of::<_glue>() - 4usize];
    ["Offset of field: _glue::_next"][::core::mem::offset_of!(_glue, _next) - 0usize];
    ["Offset of field: _glue::_niobs"][::core::mem::offset_of!(_glue, _niobs) - 4usize];
    ["Offset of field: _glue::_iobs"][::core::mem::offset_of!(_glue, _iobs) - 8usize];
};
unsafe extern "C" {
    pub static mut __sglue: _glue;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [cty::c_ushort; 3usize],
    pub _mult: [cty::c_ushort; 3usize],
    pub _add: cty::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _rand48"][::core::mem::size_of::<_rand48>() - 14usize];
    ["Alignment of _rand48"][::core::mem::align_of::<_rand48>() - 2usize];
    ["Offset of field: _rand48::_seed"][::core::mem::offset_of!(_rand48, _seed) - 0usize];
    ["Offset of field: _rand48::_mult"][::core::mem::offset_of!(_rand48, _mult) - 6usize];
    ["Offset of field: _rand48::_add"][::core::mem::offset_of!(_rand48, _add) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: cty::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: cty::c_int,
    pub _emergency: [cty::c_char; 25usize],
    pub _locale: *mut __locale_t,
    pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: cty::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: cty::c_int,
    pub _cvtbuf: *mut cty::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: cty::c_int)>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _strtok_last: *mut cty::c_char,
    pub _asctime_buf: [cty::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: cty::c_int,
    pub _rand_next: cty::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [cty::c_char; 8usize],
    pub _signal_buf: [cty::c_char; 24usize],
    pub _getdate_err: cty::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: cty::c_int,
    pub _getlocalename_l_buf: [cty::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 232usize];
    ["Alignment of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_strtok_last"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _strtok_last) - 0usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_asctime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _asctime_buf) - 4usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_localtime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _localtime_buf) - 32usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_gamma_signgam"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _gamma_signgam) - 68usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_rand_next"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _rand_next) - 72usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_r48"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _r48) - 80usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mblen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mblen_state) - 96usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbtowc_state) - 104usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wctomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wctomb_state) - 112usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_l64a_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _l64a_buf) - 120usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_signal_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _signal_buf) - 128usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_getdate_err"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _getdate_err) - 152usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrlen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrlen_state) - 156usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrtowc_state) - 164usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbsrtowcs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbsrtowcs_state) - 172usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcrtomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcrtomb_state) - 180usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcsrtombs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcsrtombs_state) - 188usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_h_errno"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _h_errno) - 196usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_getlocalename_l_buf"][::core::mem::offset_of!(
        _reent__bindgen_ty_1__bindgen_ty_1,
        _getlocalename_l_buf
    ) - 200usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1"][::core::mem::size_of::<_reent__bindgen_ty_1>() - 232usize];
    ["Alignment of _reent__bindgen_ty_1"][::core::mem::align_of::<_reent__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1::_reent"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1, _reent) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent"][::core::mem::size_of::<_reent>() - 320usize];
    ["Alignment of _reent"][::core::mem::align_of::<_reent>() - 8usize];
    ["Offset of field: _reent::_errno"][::core::mem::offset_of!(_reent, _errno) - 0usize];
    ["Offset of field: _reent::_stdin"][::core::mem::offset_of!(_reent, _stdin) - 4usize];
    ["Offset of field: _reent::_stdout"][::core::mem::offset_of!(_reent, _stdout) - 8usize];
    ["Offset of field: _reent::_stderr"][::core::mem::offset_of!(_reent, _stderr) - 12usize];
    ["Offset of field: _reent::_inc"][::core::mem::offset_of!(_reent, _inc) - 16usize];
    ["Offset of field: _reent::_emergency"][::core::mem::offset_of!(_reent, _emergency) - 20usize];
    ["Offset of field: _reent::_locale"][::core::mem::offset_of!(_reent, _locale) - 48usize];
    ["Offset of field: _reent::__cleanup"][::core::mem::offset_of!(_reent, __cleanup) - 52usize];
    ["Offset of field: _reent::_result"][::core::mem::offset_of!(_reent, _result) - 56usize];
    ["Offset of field: _reent::_result_k"][::core::mem::offset_of!(_reent, _result_k) - 60usize];
    ["Offset of field: _reent::_p5s"][::core::mem::offset_of!(_reent, _p5s) - 64usize];
    ["Offset of field: _reent::_freelist"][::core::mem::offset_of!(_reent, _freelist) - 68usize];
    ["Offset of field: _reent::_cvtlen"][::core::mem::offset_of!(_reent, _cvtlen) - 72usize];
    ["Offset of field: _reent::_cvtbuf"][::core::mem::offset_of!(_reent, _cvtbuf) - 76usize];
    ["Offset of field: _reent::_new"][::core::mem::offset_of!(_reent, _new) - 80usize];
    ["Offset of field: _reent::_sig_func"][::core::mem::offset_of!(_reent, _sig_func) - 312usize];
};
unsafe extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
unsafe extern "C" {
    pub static mut _impure_data: _reent;
}
unsafe extern "C" {
    pub static mut __atexit: *mut _atexit;
}
unsafe extern "C" {
    pub static mut __atexit0: _atexit;
}
unsafe extern "C" {
    pub static mut __stdio_exit_handler: ::core::option::Option<unsafe extern "C" fn()>;
}
unsafe extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
unsafe extern "C" {
    pub fn _fwalk_sglue(
        arg1: *mut _reent,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut __FILE) -> cty::c_int,
        >,
        arg3: *mut _glue,
    ) -> cty::c_int;
}
pub type locale_t = *mut __locale_t;
unsafe extern "C" {
    pub fn bcmp(arg1: *const cty::c_void, arg2: *const cty::c_void, arg3: usize) -> cty::c_int;
}
unsafe extern "C" {
    pub fn bcopy(arg1: *const cty::c_void, arg2: *mut cty::c_void, arg3: usize);
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut cty::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn explicit_bzero(arg1: *mut cty::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn ffs(arg1: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn ffsl(arg1: cty::c_long) -> cty::c_int;
}
unsafe extern "C" {
    pub fn ffsll(arg1: cty::c_longlong) -> cty::c_int;
}
unsafe extern "C" {
    pub fn fls(arg1: cty::c_int) -> cty::c_int;
}
unsafe extern "C" {
    pub fn flsl(arg1: cty::c_long) -> cty::c_int;
}
unsafe extern "C" {
    pub fn flsll(arg1: cty::c_longlong) -> cty::c_int;
}
unsafe extern "C" {
    pub fn index(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn rindex(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcasecmp(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: locale_t,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn memchr(arg1: *const cty::c_void, arg2: cty::c_int, arg3: usize) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memcmp(arg1: *const cty::c_void, arg2: *const cty::c_void, arg3: usize) -> cty::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn memset(arg1: *mut cty::c_void, arg2: cty::c_int, arg3: usize) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn strcat(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strchr(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcmp(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strcoll(arg1: *const cty::c_char, arg2: *const cty::c_char) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strcpy(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strcspn(arg1: *const cty::c_char, arg2: *const cty::c_char) -> usize;
}
unsafe extern "C" {
    pub fn strerror(arg1: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlen(arg1: *const cty::c_char) -> usize;
}
unsafe extern "C" {
    pub fn strncat(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strncmp(arg1: *const cty::c_char, arg2: *const cty::c_char, arg3: usize) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(arg1: *const cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strrchr(arg1: *const cty::c_char, arg2: cty::c_int) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strspn(arg1: *const cty::c_char, arg2: *const cty::c_char) -> usize;
}
unsafe extern "C" {
    pub fn strstr(arg1: *const cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strtok(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(arg1: *mut cty::c_char, arg2: *const cty::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn strcoll_l(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: locale_t,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(arg1: cty::c_int, arg2: locale_t) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strtok_r(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: *mut *mut cty::c_char,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const cty::c_void,
        arg2: *const cty::c_void,
        arg3: usize,
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn memccpy(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: cty::c_int,
        arg4: usize,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    pub fn stpcpy(arg1: *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        arg1: *mut cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strdup(arg1: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn _strdup_r(arg1: *mut _reent, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strndup(arg1: *const cty::c_char, arg2: usize) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn _strndup_r(arg1: *mut _reent, arg2: *const cty::c_char, arg3: usize)
    -> *mut cty::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(arg1: cty::c_int, arg2: *mut cty::c_char, arg3: usize) -> cty::c_int;
}
unsafe extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: cty::c_int,
        arg3: cty::c_int,
        arg4: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlcat(arg1: *mut cty::c_char, arg2: *const cty::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn strlcpy(arg1: *mut cty::c_char, arg2: *const cty::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn strnlen(arg1: *const cty::c_char, arg2: usize) -> usize;
}
unsafe extern "C" {
    pub fn strsep(arg1: *mut *mut cty::c_char, arg2: *const cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strnstr(
        arg1: *const cty::c_char,
        arg2: *const cty::c_char,
        arg3: usize,
    ) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strlwr(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strupr(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__signo: cty::c_int) -> *mut cty::c_char;
}
#[doc = " Heap information structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_mem_monitor_t {
    #[doc = "< Total heap size"]
    pub total_size: u32,
    pub free_cnt: u32,
    #[doc = "< Size of available memory"]
    pub free_size: u32,
    pub free_biggest_size: u32,
    pub used_cnt: u32,
    #[doc = "< Max size of Heap memory used"]
    pub max_used: u32,
    #[doc = "< Percentage used"]
    pub used_pct: u8,
    #[doc = "< Amount of fragmentation"]
    pub frag_pct: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_mem_monitor_t"][::core::mem::size_of::<lv_mem_monitor_t>() - 28usize];
    ["Alignment of lv_mem_monitor_t"][::core::mem::align_of::<lv_mem_monitor_t>() - 4usize];
    ["Offset of field: lv_mem_monitor_t::total_size"]
        [::core::mem::offset_of!(lv_mem_monitor_t, total_size) - 0usize];
    ["Offset of field: lv_mem_monitor_t::free_cnt"]
        [::core::mem::offset_of!(lv_mem_monitor_t, free_cnt) - 4usize];
    ["Offset of field: lv_mem_monitor_t::free_size"]
        [::core::mem::offset_of!(lv_mem_monitor_t, free_size) - 8usize];
    ["Offset of field: lv_mem_monitor_t::free_biggest_size"]
        [::core::mem::offset_of!(lv_mem_monitor_t, free_biggest_size) - 12usize];
    ["Offset of field: lv_mem_monitor_t::used_cnt"]
        [::core::mem::offset_of!(lv_mem_monitor_t, used_cnt) - 16usize];
    ["Offset of field: lv_mem_monitor_t::max_used"]
        [::core::mem::offset_of!(lv_mem_monitor_t, max_used) - 20usize];
    ["Offset of field: lv_mem_monitor_t::used_pct"]
        [::core::mem::offset_of!(lv_mem_monitor_t, used_pct) - 24usize];
    ["Offset of field: lv_mem_monitor_t::frag_pct"]
        [::core::mem::offset_of!(lv_mem_monitor_t, frag_pct) - 25usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_mem_buf_t {
    pub p: *mut cty::c_void,
    pub size: u16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_mem_buf_t"][::core::mem::size_of::<lv_mem_buf_t>() - 8usize];
    ["Alignment of lv_mem_buf_t"][::core::mem::align_of::<lv_mem_buf_t>() - 4usize];
    ["Offset of field: lv_mem_buf_t::p"][::core::mem::offset_of!(lv_mem_buf_t, p) - 0usize];
    ["Offset of field: lv_mem_buf_t::size"][::core::mem::offset_of!(lv_mem_buf_t, size) - 4usize];
};
impl lv_mem_buf_t {
    #[inline]
    pub fn used(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_used(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn used_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_used_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(used: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let used: u8 = unsafe { ::core::mem::transmute(used) };
            used as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type lv_mem_buf_arr_t = [lv_mem_buf_t; 16usize];
unsafe extern "C" {
    #[doc = " Initialize the dyn_mem module (work memory and other variables)"]
    pub fn lv_mem_init();
}
unsafe extern "C" {
    #[doc = " Clean up the memory buffer which frees all the allocated memories.\n @note It work only if `LV_MEM_CUSTOM == 0`"]
    pub fn lv_mem_deinit();
}
unsafe extern "C" {
    #[doc = " Allocate a memory dynamically\n @param size size of the memory to allocate in bytes\n @return pointer to the allocated memory"]
    pub fn lv_mem_alloc(size: usize) -> *mut cty::c_void;
}
unsafe extern "C" {
    #[doc = " Free an allocated data\n @param data pointer to an allocated memory"]
    pub fn lv_mem_free(data: *mut cty::c_void);
}
unsafe extern "C" {
    #[doc = " Reallocate a memory with a new size. The old content will be kept.\n @param data pointer to an allocated memory.\n Its content will be copied to the new memory block and freed\n @param new_size the desired new size in byte\n @return pointer to the new memory, NULL on failure"]
    pub fn lv_mem_realloc(data_p: *mut cty::c_void, new_size: usize) -> *mut cty::c_void;
}
unsafe extern "C" {
    #[doc = " @return"]
    pub fn lv_mem_test() -> lv_res_t;
}
unsafe extern "C" {
    #[doc = " Give information about the work memory of dynamic allocation\n @param mon_p pointer to a lv_mem_monitor_t variable,\n              the result of the analysis will be stored here"]
    pub fn lv_mem_monitor(mon_p: *mut lv_mem_monitor_t);
}
unsafe extern "C" {
    #[doc = " Get a temporal buffer with the given size.\n @param size the required size"]
    pub fn lv_mem_buf_get(size: u32) -> *mut cty::c_void;
}
unsafe extern "C" {
    #[doc = " Release a memory buffer\n @param p buffer to release"]
    pub fn lv_mem_buf_release(p: *mut cty::c_void);
}
unsafe extern "C" {
    #[doc = " Free all memory buffers"]
    pub fn lv_mem_buf_free_all();
}
unsafe extern "C" {
    #[doc = " Same as `memcpy` but optimized for 4 byte operation.\n @param dst pointer to the destination buffer\n @param src pointer to the source buffer\n @param len number of byte to copy"]
    pub fn lv_memcpy(
        dst: *mut cty::c_void,
        src: *const cty::c_void,
        len: usize,
    ) -> *mut cty::c_void;
}
unsafe extern "C" {
    #[doc = " Same as `memset` but optimized for 4 byte operation.\n @param dst pointer to the destination buffer\n @param v value to set [0..255]\n @param len number of byte to set"]
    pub fn lv_memset(dst: *mut cty::c_void, v: u8, len: usize);
}
unsafe extern "C" {
    #[doc = " Same as `memset(dst, 0x00, len)` but optimized for 4 byte operation.\n @param dst pointer to the destination buffer\n @param len number of byte to set"]
    pub fn lv_memset_00(dst: *mut cty::c_void, len: usize);
}
unsafe extern "C" {
    #[doc = " Same as `memset(dst, 0xFF, len)` but optimized for 4 byte operation.\n @param dst pointer to the destination buffer\n @param len number of byte to set"]
    pub fn lv_memset_ff(dst: *mut cty::c_void, len: usize);
}
#[doc = " Type for async callback."]
pub type lv_async_cb_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut cty::c_void)>;
unsafe extern "C" {
    #[doc = " Call an asynchronous function the next time lv_timer_handler() is run. This function is likely to return\n **before** the call actually happens!\n @param async_xcb a callback which is the task itself.\n                 (the 'x' in the argument name indicates that it's not a fully generic function because it not follows\n                  the `func_name(object, callback, ...)` convention)\n @param user_data custom parameter"]
    pub fn lv_async_call(async_xcb: lv_async_cb_t, user_data: *mut cty::c_void) -> lv_res_t;
}
unsafe extern "C" {
    #[doc = " Cancel an asynchronous function call\n @param async_xcb a callback which is the task itself.\n @param user_data custom parameter"]
    pub fn lv_async_call_cancel(async_xcb: lv_async_cb_t, user_data: *mut cty::c_void) -> lv_res_t;
}
pub const lv_anim_enable_t_LV_ANIM_OFF: lv_anim_enable_t = 0;
pub const lv_anim_enable_t_LV_ANIM_ON: lv_anim_enable_t = 1;
#[doc = " Can be used to indicate if animations are enabled or disabled in a case"]
pub type lv_anim_enable_t = cty::c_uint;
#[doc = " Get the current value during an animation"]
pub type lv_anim_path_cb_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *const _lv_anim_t) -> i32>;
#[doc = " Generic prototype of \"animator\" functions.\n First parameter is the variable to animate.\n Second parameter is the value to set.\n Compatible with `lv_xxx_set_yyy(obj, value)` functions\n The `x` in `_xcb_t` means it's not a fully generic prototype because\n it doesn't receive `lv_anim_t *` as its first argument"]
pub type lv_anim_exec_xcb_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut cty::c_void, arg2: i32)>;
#[doc = " Same as `lv_anim_exec_xcb_t` but receives `lv_anim_t *` as the first parameter.\n It's more consistent but less convenient. Might be used by binding generator functions."]
pub type lv_anim_custom_exec_cb_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_anim_t, arg2: i32)>;
#[doc = " Callback to call when the animation is ready"]
pub type lv_anim_ready_cb_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_anim_t)>;
#[doc = " Callback to call when the animation really stars (considering `delay`)"]
pub type lv_anim_start_cb_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_anim_t)>;
#[doc = " Callback used when the animation values are relative to get the current value"]
pub type lv_anim_get_value_cb_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_anim_t) -> i32>;
#[doc = " Callback used when the animation is deleted"]
pub type lv_anim_deleted_cb_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut _lv_anim_t)>;
#[doc = " Describes an animation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lv_anim_t {
    #[doc = "<Variable to animate"]
    pub var: *mut cty::c_void,
    #[doc = "< Function to execute to animate"]
    pub exec_cb: lv_anim_exec_xcb_t,
    #[doc = "< Call it when the animation is starts (considering `delay`)"]
    pub start_cb: lv_anim_start_cb_t,
    #[doc = "< Call it when the animation is ready"]
    pub ready_cb: lv_anim_ready_cb_t,
    #[doc = "< Call it when the animation is deleted"]
    pub deleted_cb: lv_anim_deleted_cb_t,
    #[doc = "< Get the current value in relative mode"]
    pub get_value_cb: lv_anim_get_value_cb_t,
    #[doc = "< Custom user data"]
    pub user_data: *mut cty::c_void,
    #[doc = "< Describe the path (curve) of animations"]
    pub path_cb: lv_anim_path_cb_t,
    #[doc = "< Start value"]
    pub start_value: i32,
    #[doc = "< Current value"]
    pub current_value: i32,
    #[doc = "< End value"]
    pub end_value: i32,
    #[doc = "< Animation time in ms"]
    pub time: i32,
    #[doc = "< Current time in animation. Set to negative to make delay."]
    pub act_time: i32,
    #[doc = "< Wait before play back"]
    pub playback_delay: u32,
    #[doc = "< Duration of playback animation"]
    pub playback_time: u32,
    #[doc = "< Wait before repeat"]
    pub repeat_delay: u32,
    #[doc = "< Repeat count for the animation"]
    pub repeat_cnt: u16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lv_anim_t"][::core::mem::size_of::<_lv_anim_t>() - 68usize];
    ["Alignment of _lv_anim_t"][::core::mem::align_of::<_lv_anim_t>() - 4usize];
    ["Offset of field: _lv_anim_t::var"][::core::mem::offset_of!(_lv_anim_t, var) - 0usize];
    ["Offset of field: _lv_anim_t::exec_cb"][::core::mem::offset_of!(_lv_anim_t, exec_cb) - 4usize];
    ["Offset of field: _lv_anim_t::start_cb"]
        [::core::mem::offset_of!(_lv_anim_t, start_cb) - 8usize];
    ["Offset of field: _lv_anim_t::ready_cb"]
        [::core::mem::offset_of!(_lv_anim_t, ready_cb) - 12usize];
    ["Offset of field: _lv_anim_t::deleted_cb"]
        [::core::mem::offset_of!(_lv_anim_t, deleted_cb) - 16usize];
    ["Offset of field: _lv_anim_t::get_value_cb"]
        [::core::mem::offset_of!(_lv_anim_t, get_value_cb) - 20usize];
    ["Offset of field: _lv_anim_t::user_data"]
        [::core::mem::offset_of!(_lv_anim_t, user_data) - 24usize];
    ["Offset of field: _lv_anim_t::path_cb"]
        [::core::mem::offset_of!(_lv_anim_t, path_cb) - 28usize];
    ["Offset of field: _lv_anim_t::start_value"]
        [::core::mem::offset_of!(_lv_anim_t, start_value) - 32usize];
    ["Offset of field: _lv_anim_t::current_value"]
        [::core::mem::offset_of!(_lv_anim_t, current_value) - 36usize];
    ["Offset of field: _lv_anim_t::end_value"]
        [::core::mem::offset_of!(_lv_anim_t, end_value) - 40usize];
    ["Offset of field: _lv_anim_t::time"][::core::mem::offset_of!(_lv_anim_t, time) - 44usize];
    ["Offset of field: _lv_anim_t::act_time"]
        [::core::mem::offset_of!(_lv_anim_t, act_time) - 48usize];
    ["Offset of field: _lv_anim_t::playback_delay"]
        [::core::mem::offset_of!(_lv_anim_t, playback_delay) - 52usize];
    ["Offset of field: _lv_anim_t::playback_time"]
        [::core::mem::offset_of!(_lv_anim_t, playback_time) - 56usize];
    ["Offset of field: _lv_anim_t::repeat_delay"]
        [::core::mem::offset_of!(_lv_anim_t, repeat_delay) - 60usize];
    ["Offset of field: _lv_anim_t::repeat_cnt"]
        [::core::mem::offset_of!(_lv_anim_t, repeat_cnt) - 64usize];
};
impl _lv_anim_t {
    #[inline]
    pub fn early_apply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_early_apply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn early_apply_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_early_apply_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn playback_now(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_playback_now(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn playback_now_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_playback_now_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn run_round(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_run_round(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn run_round_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_run_round_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn start_cb_called(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_start_cb_called(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn start_cb_called_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_start_cb_called_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        early_apply: u8,
        playback_now: u8,
        run_round: u8,
        start_cb_called: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let early_apply: u8 = unsafe { ::core::mem::transmute(early_apply) };
            early_apply as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let playback_now: u8 = unsafe { ::core::mem::transmute(playback_now) };
            playback_now as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let run_round: u8 = unsafe { ::core::mem::transmute(run_round) };
            run_round as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let start_cb_called: u8 = unsafe { ::core::mem::transmute(start_cb_called) };
            start_cb_called as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Describes an animation"]
pub type lv_anim_t = _lv_anim_t;
unsafe extern "C" {
    #[doc = " Init. the animation module"]
    pub fn _lv_anim_core_init();
}
unsafe extern "C" {
    #[doc = " Initialize an animation variable.\n E.g.:\n lv_anim_t a;\n lv_anim_init(&a);\n lv_anim_set_...(&a);\n lv_anim_start(&a);\n @param a     pointer to an `lv_anim_t` variable to initialize"]
    pub fn lv_anim_init(a: *mut lv_anim_t);
}
unsafe extern "C" {
    #[doc = " Create an animation\n @param a         an initialized 'anim_t' variable. Not required after call.\n @return          pointer to the created animation (different from the `a` parameter)"]
    pub fn lv_anim_start(a: *const lv_anim_t) -> *mut lv_anim_t;
}
unsafe extern "C" {
    #[doc = " Get the time used to play the animation.\n @param a pointer to an animation.\n @return the play time in milliseconds."]
    pub fn lv_anim_get_playtime(a: *mut lv_anim_t) -> u32;
}
unsafe extern "C" {
    #[doc = " Delete an animation of a variable with a given animator function\n @param var       pointer to variable\n @param exec_cb   a function pointer which is animating 'var',\n                  or NULL to ignore it and delete all the animations of 'var\n @return          true: at least 1 animation is deleted, false: no animation is deleted"]
    pub fn lv_anim_del(var: *mut cty::c_void, exec_cb: lv_anim_exec_xcb_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Delete all the animations"]
    pub fn lv_anim_del_all();
}
unsafe extern "C" {
    #[doc = " Get the animation of a variable and its `exec_cb`.\n @param var       pointer to variable\n @param exec_cb   a function pointer which is animating 'var', or NULL to return first matching 'var'\n @return          pointer to the animation."]
    pub fn lv_anim_get(var: *mut cty::c_void, exec_cb: lv_anim_exec_xcb_t) -> *mut lv_anim_t;
}
unsafe extern "C" {
    #[doc = " Get global animation refresher timer.\n @return pointer to the animation refresher timer."]
    pub fn lv_anim_get_timer() -> *mut _lv_timer_t;
}
unsafe extern "C" {
    #[doc = " Get the number of currently running animations\n @return      the number of running animations"]
    pub fn lv_anim_count_running() -> u16;
}
unsafe extern "C" {
    #[doc = " Calculate the time of an animation with a given speed and the start and end values\n @param speed speed of animation in unit/sec\n @param start     start value of the animation\n @param end       end value of the animation\n @return          the required time [ms] for the animation with the given parameters"]
    pub fn lv_anim_speed_to_time(speed: u32, start: i32, end: i32) -> u32;
}
unsafe extern "C" {
    #[doc = " Manually refresh the state of the animations.\n Useful to make the animations running in a blocking process where\n `lv_timer_handler` can't run for a while.\n Shouldn't be used directly because it is called in `lv_refr_now()`."]
    pub fn lv_anim_refr_now();
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation applying linear characteristic\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_linear(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation slowing down the start phase\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_ease_in(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation slowing down the end phase\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_ease_out(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation applying an \"S\" characteristic (cosine)\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_ease_in_out(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation with overshoot at the end\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_overshoot(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation with 3 bounces\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_bounce(a: *const lv_anim_t) -> i32;
}
unsafe extern "C" {
    #[doc = " Calculate the current value of an animation applying step characteristic.\n (Set end value on the end of the animation)\n @param a     pointer to an animation\n @return      the current value to set"]
    pub fn lv_anim_path_step(a: *const lv_anim_t) -> i32;
}
#[doc = "      TYPEDEFS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lv_anim_timeline_t {
    _unused: [u8; 0],
}
pub type lv_anim_timeline_t = _lv_anim_timeline_t;
unsafe extern "C" {
    #[doc = " Create an animation timeline.\n @return pointer to the animation timeline."]
    pub fn lv_anim_timeline_create() -> *mut lv_anim_timeline_t;
}
unsafe extern "C" {
    #[doc = " Delete animation timeline.\n @param at    pointer to the animation timeline."]
    pub fn lv_anim_timeline_del(at: *mut lv_anim_timeline_t);
}
unsafe extern "C" {
    #[doc = " Add animation to the animation timeline.\n @param at            pointer to the animation timeline.\n @param start_time    the time the animation started on the timeline, note that start_time will override the value of delay.\n @param a             pointer to an animation."]
    pub fn lv_anim_timeline_add(at: *mut lv_anim_timeline_t, start_time: u32, a: *mut lv_anim_t);
}
unsafe extern "C" {
    #[doc = " Start the animation timeline.\n @param at    pointer to the animation timeline.\n @return total time spent in animation timeline."]
    pub fn lv_anim_timeline_start(at: *mut lv_anim_timeline_t) -> u32;
}
unsafe extern "C" {
    #[doc = " Stop the animation timeline.\n @param at    pointer to the animation timeline."]
    pub fn lv_anim_timeline_stop(at: *mut lv_anim_timeline_t);
}
unsafe extern "C" {
    #[doc = " Set the playback direction of the animation timeline.\n @param at        pointer to the animation timeline.\n @param reverse   whether to play in reverse."]
    pub fn lv_anim_timeline_set_reverse(at: *mut lv_anim_timeline_t, reverse: bool);
}
unsafe extern "C" {
    #[doc = " Set the progress of the animation timeline.\n @param at        pointer to the animation timeline.\n @param progress  set value 0~65535 to map 0~100% animation progress."]
    pub fn lv_anim_timeline_set_progress(at: *mut lv_anim_timeline_t, progress: u16);
}
unsafe extern "C" {
    #[doc = " Get the time used to play the animation timeline.\n @param at    pointer to the animation timeline.\n @return total time spent in animation timeline."]
    pub fn lv_anim_timeline_get_playtime(at: *mut lv_anim_timeline_t) -> u32;
}
unsafe extern "C" {
    #[doc = " Get whether the animation timeline is played in reverse.\n @param at    pointer to the animation timeline.\n @return return true if it is reverse playback."]
    pub fn lv_anim_timeline_get_reverse(at: *mut lv_anim_timeline_t) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::core::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::core::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::core::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::core::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denomer: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        arg1: *const cty::c_char,
        arg2: *mut *mut cty::c_char,
        arg3: cty::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn _strtoimax_r(
        arg1: *mut _reent,
        arg2: *const cty::c_char,
        arg3: *mut *mut cty::c_char,
        arg4: cty::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        arg1: *const cty::c_char,
        arg2: *mut *mut cty::c_char,
        arg3: cty::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn _strtoumax_r(
        arg1: *mut _reent,
        arg2: *const cty::c_char,
        arg3: *mut *mut cty::c_char,
        arg4: cty::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(arg1: *const wchar_t, arg2: *mut *mut wchar_t, arg3: cty::c_int) -> intmax_t;
}
unsafe extern "C" {
    pub fn _wcstoimax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: cty::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(arg1: *const wchar_t, arg2: *mut *mut wchar_t, arg3: cty::c_int) -> uintmax_t;
}
unsafe extern "C" {
    pub fn _wcstoumax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: cty::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn strtoimax_l(
        arg1: *const cty::c_char,
        _restrict: *mut *mut cty::c_char,
        arg2: cty::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax_l(
        arg1: *const cty::c_char,
        _restrict: *mut *mut cty::c_char,
        arg2: cty::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: cty::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: cty::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_vaformat_t {
    pub fmt: *const cty::c_char,
    pub va: *mut va_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_vaformat_t"][::core::mem::size_of::<lv_vaformat_t>() - 8usize];
    ["Alignment of lv_vaformat_t"][::core::mem::align_of::<lv_vaformat_t>() - 4usize];
    ["Offset of field: lv_vaformat_t::fmt"][::core::mem::offset_of!(lv_vaformat_t, fmt) - 0usize];
    ["Offset of field: lv_vaformat_t::va"][::core::mem::offset_of!(lv_vaformat_t, va) - 4usize];
};
unsafe extern "C" {
    #[doc = " Tiny snprintf/vsnprintf implementation\n \\param buffer A pointer to the buffer where to store the formatted string\n \\param count The maximum number of characters to store in the buffer, including a terminating null character\n \\param format A string that specifies the format of the output\n \\param va A value identifying a variable arguments list\n \\return The number of characters that COULD have been written into the buffer, not counting the terminating\n         null character. A value equal or larger than count indicates truncation. Only when the returned value\n         is non-negative and less than count, the string has been completely written."]
    pub fn lv_snprintf(
        buffer: *mut cty::c_char,
        count: usize,
        format: *const cty::c_char,
        ...
    ) -> cty::c_int;
}
unsafe extern "C" {
    pub fn lv_vsnprintf(
        buffer: *mut cty::c_char,
        count: usize,
        format: *const cty::c_char,
        va: va_list,
    ) -> cty::c_int;
}
pub const _LV_STR_SYMBOL_BULLET: _bindgen_ty_2 = 0;
pub const _LV_STR_SYMBOL_AUDIO: _bindgen_ty_2 = 1;
pub const _LV_STR_SYMBOL_VIDEO: _bindgen_ty_2 = 2;
pub const _LV_STR_SYMBOL_LIST: _bindgen_ty_2 = 3;
pub const _LV_STR_SYMBOL_OK: _bindgen_ty_2 = 4;
pub const _LV_STR_SYMBOL_CLOSE: _bindgen_ty_2 = 5;
pub const _LV_STR_SYMBOL_POWER: _bindgen_ty_2 = 6;
pub const _LV_STR_SYMBOL_SETTINGS: _bindgen_ty_2 = 7;
pub const _LV_STR_SYMBOL_HOME: _bindgen_ty_2 = 8;
pub const _LV_STR_SYMBOL_DOWNLOAD: _bindgen_ty_2 = 9;
pub const _LV_STR_SYMBOL_DRIVE: _bindgen_ty_2 = 10;
pub const _LV_STR_SYMBOL_REFRESH: _bindgen_ty_2 = 11;
pub const _LV_STR_SYMBOL_MUTE: _bindgen_ty_2 = 12;
pub const _LV_STR_SYMBOL_VOLUME_MID: _bindgen_ty_2 = 13;
pub const _LV_STR_SYMBOL_VOLUME_MAX: _bindgen_ty_2 = 14;
pub const _LV_STR_SYMBOL_IMAGE: _bindgen_ty_2 = 15;
pub const _LV_STR_SYMBOL_TINT: _bindgen_ty_2 = 16;
pub const _LV_STR_SYMBOL_PREV: _bindgen_ty_2 = 17;
pub const _LV_STR_SYMBOL_PLAY: _bindgen_ty_2 = 18;
pub const _LV_STR_SYMBOL_PAUSE: _bindgen_ty_2 = 19;
pub const _LV_STR_SYMBOL_STOP: _bindgen_ty_2 = 20;
pub const _LV_STR_SYMBOL_NEXT: _bindgen_ty_2 = 21;
pub const _LV_STR_SYMBOL_EJECT: _bindgen_ty_2 = 22;
pub const _LV_STR_SYMBOL_LEFT: _bindgen_ty_2 = 23;
pub const _LV_STR_SYMBOL_RIGHT: _bindgen_ty_2 = 24;
pub const _LV_STR_SYMBOL_PLUS: _bindgen_ty_2 = 25;
pub const _LV_STR_SYMBOL_MINUS: _bindgen_ty_2 = 26;
pub const _LV_STR_SYMBOL_EYE_OPEN: _bindgen_ty_2 = 27;
pub const _LV_STR_SYMBOL_EYE_CLOSE: _bindgen_ty_2 = 28;
pub const _LV_STR_SYMBOL_WARNING: _bindgen_ty_2 = 29;
pub const _LV_STR_SYMBOL_SHUFFLE: _bindgen_ty_2 = 30;
pub const _LV_STR_SYMBOL_UP: _bindgen_ty_2 = 31;
pub const _LV_STR_SYMBOL_DOWN: _bindgen_ty_2 = 32;
pub const _LV_STR_SYMBOL_LOOP: _bindgen_ty_2 = 33;
pub const _LV_STR_SYMBOL_DIRECTORY: _bindgen_ty_2 = 34;
pub const _LV_STR_SYMBOL_UPLOAD: _bindgen_ty_2 = 35;
pub const _LV_STR_SYMBOL_CALL: _bindgen_ty_2 = 36;
pub const _LV_STR_SYMBOL_CUT: _bindgen_ty_2 = 37;
pub const _LV_STR_SYMBOL_COPY: _bindgen_ty_2 = 38;
pub const _LV_STR_SYMBOL_SAVE: _bindgen_ty_2 = 39;
pub const _LV_STR_SYMBOL_BARS: _bindgen_ty_2 = 40;
pub const _LV_STR_SYMBOL_ENVELOPE: _bindgen_ty_2 = 41;
pub const _LV_STR_SYMBOL_CHARGE: _bindgen_ty_2 = 42;
pub const _LV_STR_SYMBOL_PASTE: _bindgen_ty_2 = 43;
pub const _LV_STR_SYMBOL_BELL: _bindgen_ty_2 = 44;
pub const _LV_STR_SYMBOL_KEYBOARD: _bindgen_ty_2 = 45;
pub const _LV_STR_SYMBOL_GPS: _bindgen_ty_2 = 46;
pub const _LV_STR_SYMBOL_FILE: _bindgen_ty_2 = 47;
pub const _LV_STR_SYMBOL_WIFI: _bindgen_ty_2 = 48;
pub const _LV_STR_SYMBOL_BATTERY_FULL: _bindgen_ty_2 = 49;
pub const _LV_STR_SYMBOL_BATTERY_3: _bindgen_ty_2 = 50;
pub const _LV_STR_SYMBOL_BATTERY_2: _bindgen_ty_2 = 51;
pub const _LV_STR_SYMBOL_BATTERY_1: _bindgen_ty_2 = 52;
pub const _LV_STR_SYMBOL_BATTERY_EMPTY: _bindgen_ty_2 = 53;
pub const _LV_STR_SYMBOL_USB: _bindgen_ty_2 = 54;
pub const _LV_STR_SYMBOL_BLUETOOTH: _bindgen_ty_2 = 55;
pub const _LV_STR_SYMBOL_TRASH: _bindgen_ty_2 = 56;
pub const _LV_STR_SYMBOL_EDIT: _bindgen_ty_2 = 57;
pub const _LV_STR_SYMBOL_BACKSPACE: _bindgen_ty_2 = 58;
pub const _LV_STR_SYMBOL_SD_CARD: _bindgen_ty_2 = 59;
pub const _LV_STR_SYMBOL_NEW_LINE: _bindgen_ty_2 = 60;
pub const _LV_STR_SYMBOL_DUMMY: _bindgen_ty_2 = 61;
pub type _bindgen_ty_2 = cty::c_uint;
pub type lv_coord_t = i16;
#[doc = " Represents a point on the screen."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_point_t {
    pub x: lv_coord_t,
    pub y: lv_coord_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_point_t"][::core::mem::size_of::<lv_point_t>() - 4usize];
    ["Alignment of lv_point_t"][::core::mem::align_of::<lv_point_t>() - 2usize];
    ["Offset of field: lv_point_t::x"][::core::mem::offset_of!(lv_point_t, x) - 0usize];
    ["Offset of field: lv_point_t::y"][::core::mem::offset_of!(lv_point_t, y) - 2usize];
};
#[doc = " Represents an area of the screen."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_area_t {
    pub x1: lv_coord_t,
    pub y1: lv_coord_t,
    pub x2: lv_coord_t,
    pub y2: lv_coord_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_area_t"][::core::mem::size_of::<lv_area_t>() - 8usize];
    ["Alignment of lv_area_t"][::core::mem::align_of::<lv_area_t>() - 2usize];
    ["Offset of field: lv_area_t::x1"][::core::mem::offset_of!(lv_area_t, x1) - 0usize];
    ["Offset of field: lv_area_t::y1"][::core::mem::offset_of!(lv_area_t, y1) - 2usize];
    ["Offset of field: lv_area_t::x2"][::core::mem::offset_of!(lv_area_t, x2) - 4usize];
    ["Offset of field: lv_area_t::y2"][::core::mem::offset_of!(lv_area_t, y2) - 6usize];
};
pub const LV_ALIGN_DEFAULT: _bindgen_ty_3 = 0;
pub const LV_ALIGN_TOP_LEFT: _bindgen_ty_3 = 1;
pub const LV_ALIGN_TOP_MID: _bindgen_ty_3 = 2;
pub const LV_ALIGN_TOP_RIGHT: _bindgen_ty_3 = 3;
pub const LV_ALIGN_BOTTOM_LEFT: _bindgen_ty_3 = 4;
pub const LV_ALIGN_BOTTOM_MID: _bindgen_ty_3 = 5;
pub const LV_ALIGN_BOTTOM_RIGHT: _bindgen_ty_3 = 6;
pub const LV_ALIGN_LEFT_MID: _bindgen_ty_3 = 7;
pub const LV_ALIGN_RIGHT_MID: _bindgen_ty_3 = 8;
pub const LV_ALIGN_CENTER: _bindgen_ty_3 = 9;
pub const LV_ALIGN_OUT_TOP_LEFT: _bindgen_ty_3 = 10;
pub const LV_ALIGN_OUT_TOP_MID: _bindgen_ty_3 = 11;
pub const LV_ALIGN_OUT_TOP_RIGHT: _bindgen_ty_3 = 12;
pub const LV_ALIGN_OUT_BOTTOM_LEFT: _bindgen_ty_3 = 13;
pub const LV_ALIGN_OUT_BOTTOM_MID: _bindgen_ty_3 = 14;
pub const LV_ALIGN_OUT_BOTTOM_RIGHT: _bindgen_ty_3 = 15;
pub const LV_ALIGN_OUT_LEFT_TOP: _bindgen_ty_3 = 16;
pub const LV_ALIGN_OUT_LEFT_MID: _bindgen_ty_3 = 17;
pub const LV_ALIGN_OUT_LEFT_BOTTOM: _bindgen_ty_3 = 18;
pub const LV_ALIGN_OUT_RIGHT_TOP: _bindgen_ty_3 = 19;
pub const LV_ALIGN_OUT_RIGHT_MID: _bindgen_ty_3 = 20;
pub const LV_ALIGN_OUT_RIGHT_BOTTOM: _bindgen_ty_3 = 21;
#[doc = " Alignments"]
pub type _bindgen_ty_3 = cty::c_uint;
pub type lv_align_t = u8;
pub const LV_DIR_NONE: _bindgen_ty_4 = 0;
pub const LV_DIR_LEFT: _bindgen_ty_4 = 1;
pub const LV_DIR_RIGHT: _bindgen_ty_4 = 2;
pub const LV_DIR_TOP: _bindgen_ty_4 = 4;
pub const LV_DIR_BOTTOM: _bindgen_ty_4 = 8;
pub const LV_DIR_HOR: _bindgen_ty_4 = 3;
pub const LV_DIR_VER: _bindgen_ty_4 = 12;
pub const LV_DIR_ALL: _bindgen_ty_4 = 15;
pub type _bindgen_ty_4 = cty::c_uint;
pub type lv_dir_t = u8;
unsafe extern "C" {
    #[doc = " Initialize an area\n @param area_p pointer to an area\n @param x1 left coordinate of the area\n @param y1 top coordinate of the area\n @param x2 right coordinate of the area\n @param y2 bottom coordinate of the area"]
    pub fn lv_area_set(
        area_p: *mut lv_area_t,
        x1: lv_coord_t,
        y1: lv_coord_t,
        x2: lv_coord_t,
        y2: lv_coord_t,
    );
}
unsafe extern "C" {
    #[doc = " Set the width of an area\n @param area_p pointer to an area\n @param w the new width of the area (w == 1 makes x1 == x2)"]
    pub fn lv_area_set_width(area_p: *mut lv_area_t, w: lv_coord_t);
}
unsafe extern "C" {
    #[doc = " Set the height of an area\n @param area_p pointer to an area\n @param h the new height of the area (h == 1 makes y1 == y2)"]
    pub fn lv_area_set_height(area_p: *mut lv_area_t, h: lv_coord_t);
}
unsafe extern "C" {
    #[doc = " Set the position of an area (width and height will be kept)\n @param area_p pointer to an area\n @param x the new x coordinate of the area\n @param y the new y coordinate of the area"]
    pub fn _lv_area_set_pos(area_p: *mut lv_area_t, x: lv_coord_t, y: lv_coord_t);
}
unsafe extern "C" {
    #[doc = " Return with area of an area (x * y)\n @param area_p pointer to an area\n @return size of area"]
    pub fn lv_area_get_size(area_p: *const lv_area_t) -> u32;
}
unsafe extern "C" {
    pub fn lv_area_increase(area: *mut lv_area_t, w_extra: lv_coord_t, h_extra: lv_coord_t);
}
unsafe extern "C" {
    pub fn lv_area_move(area: *mut lv_area_t, x_ofs: lv_coord_t, y_ofs: lv_coord_t);
}
unsafe extern "C" {
    #[doc = " Get the common parts of two areas\n @param res_p pointer to an area, the result will be stored her\n @param a1_p pointer to the first area\n @param a2_p pointer to the second area\n @return false: the two area has NO common parts, res_p is invalid"]
    pub fn _lv_area_intersect(
        res_p: *mut lv_area_t,
        a1_p: *const lv_area_t,
        a2_p: *const lv_area_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get resulting sub areas after removing the common parts of two areas from the first area\n @param res_p pointer to an array of areas with a count of 4, the resulting areas will be stored here\n @param a1_p pointer to the first area\n @param a2_p pointer to the second area\n @return number of results (max 4) or -1 if no intersect"]
    pub fn _lv_area_diff(
        res_p: *mut lv_area_t,
        a1_p: *const lv_area_t,
        a2_p: *const lv_area_t,
    ) -> i8;
}
unsafe extern "C" {
    #[doc = " Join two areas into a third which involves the other two\n @param res_p pointer to an area, the result will be stored here\n @param a1_p pointer to the first area\n @param a2_p pointer to the second area"]
    pub fn _lv_area_join(a_res_p: *mut lv_area_t, a1_p: *const lv_area_t, a2_p: *const lv_area_t);
}
unsafe extern "C" {
    #[doc = " Check if a point is on an area\n @param a_p pointer to an area\n @param p_p pointer to a point\n @param radius radius of area (e.g. for rounded rectangle)\n @return false:the point is out of the area"]
    pub fn _lv_area_is_point_on(
        a_p: *const lv_area_t,
        p_p: *const lv_point_t,
        radius: lv_coord_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Check if two area has common parts\n @param a1_p pointer to an area.\n @param a2_p pointer to an other area\n @return false: a1_p and a2_p has no common parts"]
    pub fn _lv_area_is_on(a1_p: *const lv_area_t, a2_p: *const lv_area_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Check if an area is fully on an other\n @param ain_p pointer to an area which could be in 'aholder_p'\n @param aholder_p pointer to an area which could involve 'ain_p'\n @param radius radius of `aholder_p` (e.g. for rounded rectangle)\n @return true: `ain_p` is fully inside `aholder_p`"]
    pub fn _lv_area_is_in(
        ain_p: *const lv_area_t,
        aholder_p: *const lv_area_t,
        radius: lv_coord_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Check if an area is fully out of an other\n @param aout_p pointer to an area which could be in 'aholder_p'\n @param aholder_p pointer to an area which could involve 'ain_p'\n @param radius radius of `aholder_p` (e.g. for rounded rectangle)\n @return true: `aout_p` is fully outside `aholder_p`"]
    pub fn _lv_area_is_out(
        aout_p: *const lv_area_t,
        aholder_p: *const lv_area_t,
        radius: lv_coord_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Check if 2 area is the same\n @param a pointer to an area\n @param b pointer to another area"]
    pub fn _lv_area_is_equal(a: *const lv_area_t, b: *const lv_area_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Align an area to an other\n @param base an are where the other will be aligned\n @param to_align the area to align\n @param align `LV_ALIGN_...`"]
    pub fn lv_area_align(
        base: *const lv_area_t,
        to_align: *mut lv_area_t,
        align: lv_align_t,
        ofs_x: lv_coord_t,
        ofs_y: lv_coord_t,
    );
}
unsafe extern "C" {
    pub fn lv_point_transform(p: *mut lv_point_t, angle: i32, zoom: i32, pivot: *const lv_point_t);
}
#[doc = " Describes the properties of a glyph."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lv_font_glyph_dsc_t {
    #[doc = "< Pointer to a font where the glyph was actually found after handling fallbacks"]
    pub resolved_font: *const _lv_font_t,
    #[doc = "< The glyph needs this space. Draw the next glyph after this width."]
    pub adv_w: u16,
    #[doc = "< Width of the glyph's bounding box"]
    pub box_w: u16,
    #[doc = "< Height of the glyph's bounding box"]
    pub box_h: u16,
    #[doc = "< x offset of the bounding box"]
    pub ofs_x: i16,
    #[doc = "< y offset of the bounding box"]
    pub ofs_y: i16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lv_font_glyph_dsc_t"][::core::mem::size_of::<lv_font_glyph_dsc_t>() - 16usize];
    ["Alignment of lv_font_glyph_dsc_t"][::core::mem::align_of::<lv_font_glyph_dsc_t>() - 4usize];
    ["Offset of field: lv_font_glyph_dsc_t::resolved_font"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, resolved_font) - 0usize];
    ["Offset of field: lv_font_glyph_dsc_t::adv_w"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, adv_w) - 4usize];
    ["Offset of field: lv_font_glyph_dsc_t::box_w"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, box_w) - 6usize];
    ["Offset of field: lv_font_glyph_dsc_t::box_h"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, box_h) - 8usize];
    ["Offset of field: lv_font_glyph_dsc_t::ofs_x"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, ofs_x) - 10usize];
    ["Offset of field: lv_font_glyph_dsc_t::ofs_y"]
        [::core::mem::offset_of!(lv_font_glyph_dsc_t, ofs_y) - 12usize];
};
impl lv_font_glyph_dsc_t {
    #[inline]
    pub fn bpp(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_bpp(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bpp_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bpp_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_placeholder(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_placeholder(&mut self, val: u8) {
        unsafe {
